{
  "SPDXID" : "SPDXRef-DOCUMENT",
  "spdxVersion" : "SPDX-2.3",
  "creationInfo" : {
    "comment" : "This document was created using license information and a generator from Fossology.\nIt contains the license and copyright analysis of protobuf v1.5.0\nPlease check \"LicenseComments\" for explanations of concluded licenses",
    "created" : "2024-11-14T15:09:53Z",
    "creators" : [ "Tool: fossology-4.4.0.51", "Person: Oliver Fendt" ],
    "licenseListVersion" : "3.22"
  },
  "name" : "/srv/fossology/repository/report",
  "dataLicense" : "CC0-1.0",
  "hasExtractedLicensingInfos" : [ {
    "licenseId" : "LicenseRef-Apache-2.0",
    "extractedText" : "Apache License\n                           Version 2.0, January 2004\n                        http://www.apache.org/licenses/\n\n   TERMS AND CONDITIONS FOR USE, REPRODUCTION, AND DISTRIBUTION\n\n   1. Definitions.\n\n      \"License\" shall mean the terms and conditions for use, reproduction,\n      and distribution as defined by Sections 1 through 9 of this document.\n\n      \"Licensor\" shall mean the copyright owner or entity authorized by\n      the copyright owner that is granting the License.\n\n      \"Legal Entity\" shall mean the union of the acting entity and all\n      other entities that control, are controlled by, or are under common\n      control with that entity. For the purposes of this definition,\n      \"control\" means (i) the power, direct or indirect, to cause the\n      direction or management of such entity, whether by contract or\n      otherwise, or (ii) ownership of fifty percent (50%) or more of the\n      outstanding shares, or (iii) beneficial ownership of such entity.\n\n      \"You\" (or \"Your\") shall mean an individual or Legal Entity\n      exercising permissions granted by this License.\n\n      \"Source\" form shall mean the preferred form for making modifications,\n      including but not limited to software source code, documentation\n      source, and configuration files.\n\n      \"Object\" form shall mean any form resulting from mechanical\n      transformation or translation of a Source form, including but\n      not limited to compiled object code, generated documentation,\n      and conversions to other media types.\n\n      \"Work\" shall mean the work of authorship, whether in Source or\n      Object form, made available under the License, as indicated by a\n      copyright notice that is included in or attached to the work\n      (an example is provided in the Appendix below).\n\n      \"Derivative Works\" shall mean any work, whether in Source or Object\n      form, that is based on (or derived from) the Work and for which the\n      editorial revisions, annotations, elaborations, or other modifications\n      represent, as a whole, an original work of authorship. For the purposes\n      of this License, Derivative Works shall not include works that remain\n      separable from, or merely link (or bind by name) to the interfaces of,\n      the Work and Derivative Works thereof.\n\n      \"Contribution\" shall mean any work of authorship, including\n      the original version of the Work and any modifications or additions\n      to that Work or Derivative Works thereof, that is intentionally\n      submitted to Licensor for inclusion in the Work by the copyright owner\n      or by an individual or Legal Entity authorized to submit on behalf of\n      the copyright owner. For the purposes of this definition, \"submitted\"\n      means any form of electronic, verbal, or written communication sent\n      to the Licensor or its representatives, including but not limited to\n      communication on electronic mailing lists, source code control systems,\n      and issue tracking systems that are managed by, or on behalf of, the\n      Licensor for the purpose of discussing and improving the Work, but\n      excluding communication that is conspicuously marked or otherwise\n      designated in writing by the copyright owner as \"Not a Contribution.\"\n\n      \"Contributor\" shall mean Licensor and any individual or Legal Entity\n      on behalf of whom a Contribution has been received by Licensor and\n      subsequently incorporated within the Work.\n\n   2. Grant of Copyright License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      copyright license to reproduce, prepare Derivative Works of,\n      publicly display, publicly perform, sublicense, and distribute the\n      Work and such Derivative Works in Source or Object form.\n\n   3. Grant of Patent License. Subject to the terms and conditions of\n      this License, each Contributor hereby grants to You a perpetual,\n      worldwide, non-exclusive, no-charge, royalty-free, irrevocable\n      (except as stated in this section) patent license to make, have made,\n      use, offer to sell, sell, import, and otherwise transfer the Work,\n      where such license applies only to those patent claims licensable\n      by such Contributor that are necessarily infringed by their\n      Contribution(s) alone or by combination of their Contribution(s)\n      with the Work to which such Contribution(s) was submitted. If You\n      institute patent litigation against any entity (including a\n      cross-claim or counterclaim in a lawsuit) alleging that the Work\n      or a Contribution incorporated within the Work constitutes direct\n      or contributory patent infringement, then any patent licenses\n      granted to You under this License for that Work shall terminate\n      as of the date such litigation is filed.\n\n   4. Redistribution. You may reproduce and distribute copies of the\n      Work or Derivative Works thereof in any medium, with or without\n      modifications, and in Source or Object form, provided that You\n      meet the following conditions:\n\n      (a) You must give any other recipients of the Work or\n          Derivative Works a copy of this License; and\n\n      (b) You must cause any modified files to carry prominent notices\n          stating that You changed the files; and\n\n      (c) You must retain, in the Source form of any Derivative Works\n          that You distribute, all copyright, patent, trademark, and\n          attribution notices from the Source form of the Work,\n          excluding those notices that do not pertain to any part of\n          the Derivative Works; and\n\n      (d) If the Work includes a \"NOTICE\" text file as part of its\n          distribution, then any Derivative Works that You distribute must\n          include a readable copy of the attribution notices contained\n          within such NOTICE file, excluding those notices that do not\n          pertain to any part of the Derivative Works, in at least one\n          of the following places: within a NOTICE text file distributed\n          as part of the Derivative Works; within the Source form or\n          documentation, if provided along with the Derivative Works; or,\n          within a display generated by the Derivative Works, if and\n          wherever such third-party notices normally appear. The contents\n          of the NOTICE file are for informational purposes only and\n          do not modify the License. You may add Your own attribution\n          notices within Derivative Works that You distribute, alongside\n          or as an addendum to the NOTICE text from the Work, provided\n          that such additional attribution notices cannot be construed\n          as modifying the License.\n\n      You may add Your own copyright statement to Your modifications and\n      may provide additional or different license terms and conditions\n      for use, reproduction, or distribution of Your modifications, or\n      for any such Derivative Works as a whole, provided Your use,\n      reproduction, and distribution of the Work otherwise complies with\n      the conditions stated in this License.\n\n   5. Submission of Contributions. Unless You explicitly state otherwise,\n      any Contribution intentionally submitted for inclusion in the Work\n      by You to the Licensor shall be under the terms and conditions of\n      this License, without any additional terms or conditions.\n      Notwithstanding the above, nothing herein shall supersede or modify\n      the terms of any separate license agreement you may have executed\n      with Licensor regarding such Contributions.\n\n   6. Trademarks. This License does not grant permission to use the trade\n      names, trademarks, service marks, or product names of the Licensor,\n      except as required for reasonable and customary use in describing the\n      origin of the Work and reproducing the content of the NOTICE file.\n\n   7. Disclaimer of Warranty. Unless required by applicable law or\n      agreed to in writing, Licensor provides the Work (and each\n      Contributor provides its Contributions) on an \"AS IS\" BASIS,\n      WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or\n      implied, including, without limitation, any warranties or conditions\n      of TITLE, NON-INFRINGEMENT, MERCHANTABILITY, or FITNESS FOR A\n      PARTICULAR PURPOSE. You are solely responsible for determining the\n      appropriateness of using or redistributing the Work and assume any\n      risks associated with Your exercise of permissions under this License.\n\n   8. Limitation of Liability. In no event and under no legal theory,\n      whether in tort (including negligence), contract, or otherwise,\n      unless required by applicable law (such as deliberate and grossly\n      negligent acts) or agreed to in writing, shall any Contributor be\n      liable to You for damages, including any direct, indirect, special,\n      incidental, or consequential damages of any character arising as a\n      result of this License or out of the use or inability to use the\n      Work (including but not limited to damages for loss of goodwill,\n      work stoppage, computer failure or malfunction, or any and all\n      other commercial damages or losses), even if such Contributor\n      has been advised of the possibility of such damages.\n\n   9. Accepting Warranty or Additional Liability. While redistributing\n      the Work or Derivative Works thereof, You may choose to offer,\n      and charge a fee for, acceptance of support, warranty, indemnity,\n      or other liability obligations and/or rights consistent with this\n      License. However, in accepting such obligations, You may act only\n      on Your own behalf and on Your sole responsibility, not on behalf\n      of any other Contributor, and only if You agree to indemnify,\n      defend, and hold each Contributor harmless for any liability\n      incurred by, or claims asserted against, such Contributor by reason\n      of your accepting any such warranty or additional liability.\n\n   END OF TERMS AND CONDITIONS\n\n   APPENDIX: How to apply the Apache License to your work.\n\n      To apply the Apache License to your work, attach the following\n      boilerplate notice, with the fields enclosed by brackets \"{}\"\n      replaced with your own identifying information. (Don't include\n      the brackets!)  The text should be enclosed in the appropriate\n      comment syntax for the file format. We also recommend that a\n      file or class name and description of purpose be included on the\n      same \"printed page\" as the copyright notice for easier\n      identification within third-party archives.\n\n   Copyright {yyyy} {name of copyright owner}\n\n   Licensed under the Apache License, Version 2.0 (the \"License\");\n   you may not use this file except in compliance with the License.\n   You may obtain a copy of the License at\n\n       https://www.apache.org/licenses/LICENSE-2.0\n\n   Unless required by applicable law or agreed to in writing, software\n   distributed under the License is distributed on an \"AS IS\" BASIS,\n   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.\n   See the License for the specific language governing permissions and\nlimitations under the License.",
    "name" : "Apache License 2.0"
  }, {
    "licenseId" : "LicenseRef-Autoconf-exception",
    "extractedText" : "License by Nomos.",
    "name" : "Autoconf-exception"
  }, {
    "licenseId" : "LicenseRef-Autoconf-exception-2.0",
    "extractedText" : "As a special exception, the Free Software Foundation gives unlimited permission to copy, distribute and modify the configure scripts that are the output of Autoconf. You need not follow the terms of the GNU General Public License when using or distributing such scripts, even though portions of the text of Autoconf appear in them. The GNU General Public License (GPL) does govern all other use of the material that constitutes the Autoconf program.\n\nCertain portions of the Autoconf source text are designed to be copied (in certain cases, depending on the input) into the output of Autoconf. We call these the \"data\" portions. The rest of the Autoconf source text consists of comments plus executable code that decides which of the data portions to output in any given case. We call these comments and executable code the \"non-data\" portions. Autoconf never copies any of the non-data portions into its output.\n\nThis special exception to the GPL applies to versions of Autoconf released by the Free Software Foundation. When you make and distribute a modified version of Autoconf, you may extend this special exception to the GPL to apply to your modified version as well, *unless* your modified version has the potential to copy into its output some of the text that was the non-data portion of the version that you started with. (In other words, unless your change moves or copies text from the non-data portions to the data portions.) If your modification has such potential, you must delete any notice of this special exception to the GPL from your modified version.",
    "name" : "Autoconf exception 2.0"
  }, {
    "licenseId" : "LicenseRef-Autoconf-exception-generic",
    "extractedText" : "As a special exception to the GNU General Public License,\nif you distribute this file as part of a program that contains \na configuration script generated by Autoconf, you may include \nit under the same distribution terms that you use for the rest of that program.",
    "name" : "Autoconf generic exception"
  }, {
    "licenseId" : "LicenseRef-Autoconf-exception-macro",
    "extractedText" : "As a special exception, the respective Autoconf Macro's copyright owner\ngives unlimited permission to copy, distribute and modify the configure\nscripts that are the output of Autoconf when processing the Macro. You\nneed not follow the terms of the GNU General Public License when using\nor distributing such scripts, even though portions of the text of the\nMacro appear in them. The GNU General Public License (GPL) does govern\nall other use of the material that constitutes the Autoconf Macro.\n\nThis special exception to the GPL applies to versions of the Autoconf\nMacro released by the Autoconf Archive. When you make and distribute a\nmodified version of the Autoconf Macro, you may extend this special\nexception to the GPL to apply to your modified version as well.",
    "name" : "Autoconf macro exception"
  }, {
    "licenseId" : "LicenseRef-BSD-2-Clause",
    "extractedText" : "Copyright (c) <year> <owner>\n\nRedistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:\n\n1. Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.\n\n2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.",
    "name" : "BSD 2-Clause \"Simplified\" License"
  }, {
    "licenseId" : "LicenseRef-BSD-2-Clause-64d547dda59824f98aba23eb314af065",
    "extractedText" : "Redistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions are\nmet:\n\n* Redistributions of source code must retain the above copyright\nnotice, this list of conditions and the following disclaimer.\n\n* Redistributions in binary form must reproduce the above\ncopyright notice, this list of conditions and the following disclaimer\nin the documentation and/or other materials provided with the\ndistribution.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS\n\"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT\nLIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR\nA PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT\nOWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,\nSPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT\nLIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,\nDATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY\nTHEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\nOF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.",
    "name" : "BSD 2-Clause \"Simplified\" License"
  }, {
    "licenseId" : "LicenseRef-BSD-2-Clause-800d6ee23ee356e5bc046d49bf4686b4",
    "extractedText" : "Redistribution and use in source and binary forms, with or without\nmodification, are permitted provided that the following conditions are\nmet:\n\n* Redistributions of source code must retain the above copyright\nnotice, this list of conditions and the following disclaimer.\n\n* Redistributions in binary form must reproduce the above\ncopyright notice, this list of conditions and the following disclaimer\nin the documentation and/or other materials provided with the\ndistribution.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS\n\"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT\nLIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR\nA PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT\nOWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,\nSPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT\nLIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,\nDATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY\nTHEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n(INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\nOF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\nThe code generated by the protoc-gen-c code generator and by the\nprotoc-c compiler is owned by the owner of the input files used when\ngenerating it. This code is not standalone and requires a support\nlibrary to be linked with it. This support library is covered by the\nabove license.",
    "name" : "BSD 2-Clause \"Simplified\" License"
  }, {
    "licenseId" : "LicenseRef-BSD-2-Clause-Views",
    "extractedText" : "Copyright (c) <year> <owner> All rights reserved.\n\nRedistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:\n\n1. Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.\n\n2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.\n\nThe views and conclusions contained in the software and documentation are those of the authors and should not be interpreted as representing official policies, either expressed or implied, of the copyright holders or contributors.",
    "name" : "BSD 2-Clause with views sentence"
  }, {
    "licenseId" : "LicenseRef-BSD-3-Clause",
    "extractedText" : "Copyright (c) <year> <owner>.\n\nRedistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:\n\n1. Redistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.\n\n2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.\n\n3. Neither the name of the copyright holder nor the names of its contributors may be used to endorse or promote products derived from this software without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.",
    "name" : "BSD 3-Clause \"New\" or \"Revised\" License"
  }, {
    "licenseId" : "LicenseRef-BSD-3-Clause-5d8fbbf3d2c067f361b4e5e9a9352bfc",
    "extractedText" : "Redistribution and use in source and binary forms, with or without\n modification, are permitted provided that the following conditions are\n met:\n\n * Redistributions of source code must retain the above copyright\n notice, this list of conditions and the following disclaimer.\n * Redistributions in binary form must reproduce the above\n copyright notice, this list of conditions and the following disclaimer\n in the documentation and/or other materials provided with the\n distribution.\n * Neither the name of Google Inc. nor the names of its\n contributors may be used to endorse or promote products derived from\n this software without specific prior written permission.\n\n THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS\n \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT\n LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR\n A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT\n OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,\n SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT\n LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,\n DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY\n THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT\n (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE\nOF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.",
    "name" : "BSD 3-Clause \"New\" or \"Revised\" License"
  }, {
    "licenseId" : "LicenseRef-CC0-1.0",
    "extractedText" : "Creative Commons Legal Code\n\nCC0 1.0 Universal\n\n    CREATIVE COMMONS CORPORATION IS NOT A LAW FIRM AND DOES NOT PROVIDE\n    LEGAL SERVICES. DISTRIBUTION OF THIS DOCUMENT DOES NOT CREATE AN\n    ATTORNEY-CLIENT RELATIONSHIP. CREATIVE COMMONS PROVIDES THIS\n    INFORMATION ON AN \"AS-IS\" BASIS. CREATIVE COMMONS MAKES NO WARRANTIES\n    REGARDING THE USE OF THIS DOCUMENT OR THE INFORMATION OR WORKS\n    PROVIDED HEREUNDER, AND DISCLAIMS LIABILITY FOR DAMAGES RESULTING FROM\n    THE USE OF THIS DOCUMENT OR THE INFORMATION OR WORKS PROVIDED\n    HEREUNDER.\n\nStatement of Purpose\n\nThe laws of most jurisdictions throughout the world automatically confer\nexclusive Copyright and Related Rights (defined below) upon the creator\nand subsequent owner(s) (each and all, an \"owner\") of an original work of\nauthorship and/or a database (each, a \"Work\").\n\nCertain owners wish to permanently relinquish those rights to a Work for\nthe purpose of contributing to a commons of creative, cultural and\nscientific works (\"Commons\") that the public can reliably and without fear\nof later claims of infringement build upon, modify, incorporate in other\nworks, reuse and redistribute as freely as possible in any form whatsoever\nand for any purposes, including without limitation commercial purposes.\nThese owners may contribute to the Commons to promote the ideal of a free\nculture and the further production of creative, cultural and scientific\nworks, or to gain reputation or greater distribution for their Work in\npart through the use and efforts of others.\n\nFor these and/or other purposes and motivations, and without any\nexpectation of additional consideration or compensation, the person\nassociating CC0 with a Work (the \"Affirmer\"), to the extent that he or she\nis an owner of Copyright and Related Rights in the Work, voluntarily\nelects to apply CC0 to the Work and publicly distribute the Work under its\nterms, with knowledge of his or her Copyright and Related Rights in the\nWork and the meaning and intended legal effect of CC0 on those rights.\n\n1. Copyright and Related Rights. A Work made available under CC0 may be\nprotected by copyright and related or neighboring rights (\"Copyright and\nRelated Rights\"). Copyright and Related Rights include, but are not\nlimited to, the following:\n\n  i. the right to reproduce, adapt, distribute, perform, display,\n     communicate, and translate a Work;\n ii. moral rights retained by the original author(s) and/or performer(s);\niii. publicity and privacy rights pertaining to a person's image or\n     likeness depicted in a Work;\n iv. rights protecting against unfair competition in regards to a Work,\n     subject to the limitations in paragraph 4(a), below;\n  v. rights protecting the extraction, dissemination, use and reuse of data\n     in a Work;\n vi. database rights (such as those arising under Directive 96/9/EC of the\n     European Parliament and of the Council of 11 March 1996 on the legal\n     protection of databases, and under any national implementation\n     thereof, including any amended or successor version of such\n     directive); and\nvii. other similar, equivalent or corresponding rights throughout the\n     world based on applicable law or treaty, and any national\n     implementations thereof.\n\n2. Waiver. To the greatest extent permitted by, but not in contravention\nof, applicable law, Affirmer hereby overtly, fully, permanently,\nirrevocably and unconditionally waives, abandons, and surrenders all of\nAffirmer's Copyright and Related Rights and associated claims and causes\nof action, whether now known or unknown (including existing as well as\nfuture claims and causes of action), in the Work (i) in all territories\nworldwide, (ii) for the maximum duration provided by applicable law or\ntreaty (including future time extensions), (iii) in any current or future\nmedium and for any number of copies, and (iv) for any purpose whatsoever,\nincluding without limitation commercial, advertising or promotional\npurposes (the \"Waiver\"). Affirmer makes the Waiver for the benefit of each\nmember of the public at large and to the detriment of Affirmer's heirs and\nsuccessors, fully intending that such Waiver shall not be subject to\nrevocation, rescission, cancellation, termination, or any other legal or\nequitable action to disrupt the quiet enjoyment of the Work by the public\nas contemplated by Affirmer's express Statement of Purpose.\n\n3. Public License Fallback. Should any part of the Waiver for any reason\nbe judged legally invalid or ineffective under applicable law, then the\nWaiver shall be preserved to the maximum extent permitted taking into\naccount Affirmer's express Statement of Purpose. In addition, to the\nextent the Waiver is so judged Affirmer hereby grants to each affected\nperson a royalty-free, non transferable, non sublicensable, non exclusive,\nirrevocable and unconditional license to exercise Affirmer's Copyright and\nRelated Rights in the Work (i) in all territories worldwide, (ii) for the\nmaximum duration provided by applicable law or treaty (including future\ntime extensions), (iii) in any current or future medium and for any number\nof copies, and (iv) for any purpose whatsoever, including without\nlimitation commercial, advertising or promotional purposes (the\n\"License\"). The License shall be deemed effective as of the date CC0 was\napplied by Affirmer to the Work. Should any part of the License for any\nreason be judged legally invalid or ineffective under applicable law, such\npartial invalidity or ineffectiveness shall not invalidate the remainder\nof the License, and in such case Affirmer hereby affirms that he or she\nwill not (i) exercise any of his or her remaining Copyright and Related\nRights in the Work or (ii) assert any associated claims and causes of\naction with respect to the Work, in either case contrary to Affirmer's\nexpress Statement of Purpose.\n\n4. Limitations and Disclaimers.\n\n a. No trademark or patent rights held by Affirmer are waived, abandoned,\n    surrendered, licensed or otherwise affected by this document.\n b. Affirmer offers the Work as-is and makes no representations or\n    warranties of any kind concerning the Work, express, implied,\n    statutory or otherwise, including without limitation warranties of\n    title, merchantability, fitness for a particular purpose, non\n    infringement, or the absence of latent or other defects, accuracy, or\n    the present or absence of errors, whether or not discoverable, all to\n    the greatest extent permissible under applicable law.\n c. Affirmer disclaims responsibility for clearing rights of other persons\n    that may apply to the Work or any use thereof, including without\n    limitation any person's Copyright and Related Rights in the Work.\n    Further, Affirmer disclaims responsibility for obtaining any necessary\n    consents, permissions or other rights required for any use of the\n    Work.\n d. Affirmer understands and acknowledges that Creative Commons is not a\n    party to this document and has no duty or obligation with respect to\n    this CC0 or use of the Work.",
    "name" : "Creative Commons Zero v1.0 Universal"
  }, {
    "licenseId" : "LicenseRef-FSFAP",
    "extractedText" : "Copying and distribution of this file, with or without modification, are permitted in any medium without royalty provided the copyright notice and this notice are preserved.  This file is offered as-is, without any warranty.",
    "name" : "FSF All Permissive License"
  }, {
    "licenseId" : "LicenseRef-FSFAP-27b6144a5a871aae6cbd42c8a2812171",
    "extractedText" : "Copying and distribution of this file, with or without modification, are\npermitted in any medium without royalty provided the copyright notice\nand this notice are preserved. This file is offered as-is, without any\nwarranty.",
    "name" : "FSF All Permissive License"
  }, {
    "licenseId" : "LicenseRef-FSFULLR",
    "extractedText" : "Copyright 1996-2006 Free Software Foundation, Inc.\n\nThis file is free software; the Free Software Foundation gives unlimited permission to copy and/or distribute it, with or without modifications, as long as this notice is preserved.",
    "name" : "FSF Unlimited License (with License Retention)"
  }, {
    "licenseId" : "LicenseRef-FSFULLR-564001a1604da16622c52d713e5f360b",
    "extractedText" : "This file is free software; the Free Software Foundation\ngives unlimited permission to copy and/or distribute it,\nwith or without modifications, as long as this notice is preserved.",
    "name" : "FSF Unlimited License (with License Retention)"
  }, {
    "licenseId" : "LicenseRef-GPL-2.0-or-later",
    "extractedText" : "GNU GENERAL PUBLIC LICENSE\n\nVersion 2, June 1991\n\nCopyright (C) 1989, 1991 Free Software Foundation, Inc.\n\n51 Franklin Street, Fifth Floor, Boston, MA 02110-1301, USA\n\nEveryone is permitted to copy and distribute verbatim copies of this license document, but changing it is not allowed.\n\nPreamble\n\nThe licenses for most software are designed to take away your freedom to share and change it. By contrast, the GNU General Public License is intended to guarantee your freedom to share and change free software--to make sure the software is free for all its users. This General Public License applies to most of the Free Software Foundation's software and to any other program whose authors commit to using it. (Some other Free Software Foundation software is covered by the GNU Lesser General Public License instead.) You can apply it to your programs, too.\n\nWhen we speak of free software, we are referring to freedom, not price. Our General Public Licenses are designed to make sure that you have the freedom to distribute copies of free software (and charge for this service if you wish), that you receive source code or can get it if you want it, that you can change the software or use pieces of it in new free programs; and that you know you can do these things.\n\nTo protect your rights, we need to make restrictions that forbid anyone to deny you these rights or to ask you to surrender the rights. These restrictions translate to certain responsibilities for you if you distribute copies of the software, or if you modify it.\n\nFor example, if you distribute copies of such a program, whether gratis or for a fee, you must give the recipients all the rights that you have. You must make sure that they, too, receive or can get the source code. And you must show them these terms so they know their rights.\n\nWe protect your rights with two steps: (1) copyright the software, and (2) offer you this license which gives you legal permission to copy, distribute and/or modify the software.\n\nAlso, for each author's protection and ours, we want to make certain that everyone understands that there is no warranty for this free software. If the software is modified by someone else and passed on, we want its recipients to know that what they have is not the original, so that any problems introduced by others will not reflect on the original authors' reputations.\n\nFinally, any free program is threatened constantly by software patents. We wish to avoid the danger that redistributors of a free program will individually obtain patent licenses, in effect making the program proprietary. To prevent this, we have made it clear that any patent must be licensed for everyone's free use or not licensed at all.\n\nThe precise terms and conditions for copying, distribution and modification follow.\n\nTERMS AND CONDITIONS FOR COPYING, DISTRIBUTION AND MODIFICATION\n\n   0. This License applies to any program or other work which contains a notice placed by the copyright holder saying it may be distributed under the terms of this General Public License. The \"Program\", below, refers to any such program or work, and a \"work based on the Program\" means either the Program or any derivative work under copyright law: that is to say, a work containing the Program or a portion of it, either verbatim or with modifications and/or translated into another language. (Hereinafter, translation is included without limitation in the term \"modification\".) Each licensee is addressed as \"you\".\n\n   Activities other than copying, distribution and modification are not covered by this License; they are outside its scope. The act of running the Program is not restricted, and the output from the Program is covered only if its contents constitute a work based on the Program (independent of having been made by running the Program). Whether that is true depends on what the Program does.\n\n   1. You may copy and distribute verbatim copies of the Program's source code as you receive it, in any medium, provided that you conspicuously and appropriately publish on each copy an appropriate copyright notice and disclaimer of warranty; keep intact all the notices that refer to this License and to the absence of any warranty; and give any other recipients of the Program a copy of this License along with the Program.\n\n   You may charge a fee for the physical act of transferring a copy, and you may at your option offer warranty protection in exchange for a fee.\n\n   2. You may modify your copy or copies of the Program or any portion of it, thus forming a work based on the Program, and copy and distribute such modifications or work under the terms of Section 1 above, provided that you also meet all of these conditions:\n\n      a) You must cause the modified files to carry prominent notices stating that you changed the files and the date of any change.\n\n      b) You must cause any work that you distribute or publish, that in whole or in part contains or is derived from the Program or any part thereof, to be licensed as a whole at no charge to all third parties under the terms of this License.\n\n      c) If the modified program normally reads commands interactively when run, you must cause it, when started running for such interactive use in the most ordinary way, to print or display an announcement including an appropriate copyright notice and a notice that there is no warranty (or else, saying that you provide a warranty) and that users may redistribute the program under these conditions, and telling the user how to view a copy of this License. (Exception: if the Program itself is interactive but does not normally print such an announcement, your work based on the Program is not required to print an announcement.)\n\n   These requirements apply to the modified work as a whole. If identifiable sections of that work are not derived from the Program, and can be reasonably considered independent and separate works in themselves, then this License, and its terms, do not apply to those sections when you distribute them as separate works. But when you distribute the same sections as part of a whole which is a work based on the Program, the distribution of the whole must be on the terms of this License, whose permissions for other licensees extend to the entire whole, and thus to each and every part regardless of who wrote it.\n\n   Thus, it is not the intent of this section to claim rights or contest your rights to work written entirely by you; rather, the intent is to exercise the right to control the distribution of derivative or collective works based on the Program.\n\n   In addition, mere aggregation of another work not based on the Program with the Program (or with a work based on the Program) on a volume of a storage or distribution medium does not bring the other work under the scope of this License.\n\n   3. You may copy and distribute the Program (or a work based on it, under Section 2) in object code or executable form under the terms of Sections 1 and 2 above provided that you also do one of the following:\n\n      a) Accompany it with the complete corresponding machine-readable source code, which must be distributed under the terms of Sections 1 and 2 above on a medium customarily used for software interchange; or,\n\n      b) Accompany it with a written offer, valid for at least three years, to give any third party, for a charge no more than your cost of physically performing source distribution, a complete machine-readable copy of the corresponding source code, to be distributed under the terms of Sections 1 and 2 above on a medium customarily used for software interchange; or,\n\n      c) Accompany it with the information you received as to the offer to distribute corresponding source code. (This alternative is allowed only for noncommercial distribution and only if you received the program in object code or executable form with such an offer, in accord with Subsection b above.)\n\n   The source code for a work means the preferred form of the work for making modifications to it. For an executable work, complete source code means all the source code for all modules it contains, plus any associated interface definition files, plus the scripts used to control compilation and installation of the executable. However, as a special exception, the source code distributed need not include anything that is normally distributed (in either source or binary form) with the major components (compiler, kernel, and so on) of the operating system on which the executable runs, unless that component itself accompanies the executable.\n\n   If distribution of executable or object code is made by offering access to copy from a designated place, then offering equivalent access to copy the source code from the same place counts as distribution of the source code, even though third parties are not compelled to copy the source along with the object code.\n\n   4. You may not copy, modify, sublicense, or distribute the Program except as expressly provided under this License. Any attempt otherwise to copy, modify, sublicense or distribute the Program is void, and will automatically terminate your rights under this License. However, parties who have received copies, or rights, from you under this License will not have their licenses terminated so long as such parties remain in full compliance.\n\n   5. You are not required to accept this License, since you have not signed it. However, nothing else grants you permission to modify or distribute the Program or its derivative works. These actions are prohibited by law if you do not accept this License. Therefore, by modifying or distributing the Program (or any work based on the Program), you indicate your acceptance of this License to do so, and all its terms and conditions for copying, distributing or modifying the Program or works based on it.\n\n   6. Each time you redistribute the Program (or any work based on the Program), the recipient automatically receives a license from the original licensor to copy, distribute or modify the Program subject to these terms and conditions. You may not impose any further restrictions on the recipients' exercise of the rights granted herein. You are not responsible for enforcing compliance by third parties to this License.\n\n   7. If, as a consequence of a court judgment or allegation of patent infringement or for any other reason (not limited to patent issues), conditions are imposed on you (whether by court order, agreement or otherwise) that contradict the conditions of this License, they do not excuse you from the conditions of this License. If you cannot distribute so as to satisfy simultaneously your obligations under this License and any other pertinent obligations, then as a consequence you may not distribute the Program at all. For example, if a patent license would not permit royalty-free redistribution of the Program by all those who receive copies directly or indirectly through you, then the only way you could satisfy both it and this License would be to refrain entirely from distribution of the Program.\n\n   If any portion of this section is held invalid or unenforceable under any particular circumstance, the balance of the section is intended to apply and the section as a whole is intended to apply in other circumstances.\n\n   It is not the purpose of this section to induce you to infringe any patents or other property right claims or to contest validity of any such claims; this section has the sole purpose of protecting the integrity of the free software distribution system, which is implemented by public license practices. Many people have made generous contributions to the wide range of software distributed through that system in reliance on consistent application of that system; it is up to the author/donor to decide if he or she is willing to distribute software through any other system and a licensee cannot impose that choice.\n\n   This section is intended to make thoroughly clear what is believed to be a consequence of the rest of this License.\n\n   8. If the distribution and/or use of the Program is restricted in certain countries either by patents or by copyrighted interfaces, the original copyright holder who places the Program under this License may add an explicit geographical distribution limitation excluding those countries, so that distribution is permitted only in or among countries not thus excluded. In such case, this License incorporates the limitation as if written in the body of this License.\n\n   9. The Free Software Foundation may publish revised and/or new versions of the General Public License from time to time. Such new versions will be similar in spirit to the present version, but may differ in detail to address new problems or concerns.\n\n   Each version is given a distinguishing version number. If the Program specifies a version number of this License which applies to it and \"any later version\", you have the option of following the terms and conditions either of that version or of any later version published by the Free Software Foundation. If the Program does not specify a version number of this License, you may choose any version ever published by the Free Software Foundation.\n\n   10. If you wish to incorporate parts of the Program into other free programs whose distribution conditions are different, write to the author to ask for permission. For software which is copyrighted by the Free Software Foundation, write to the Free Software Foundation; we sometimes make exceptions for this. Our decision will be guided by the two goals of preserving the free status of all derivatives of our free software and of promoting the sharing and reuse of software generally.\n\n   NO WARRANTY\n\n   11. BECAUSE THE PROGRAM IS LICENSED FREE OF CHARGE, THERE IS NO WARRANTY FOR THE PROGRAM, TO THE EXTENT PERMITTED BY APPLICABLE LAW. EXCEPT WHEN OTHERWISE STATED IN WRITING THE COPYRIGHT HOLDERS AND/OR OTHER PARTIES PROVIDE THE PROGRAM \"AS IS\" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. THE ENTIRE RISK AS TO THE QUALITY AND PERFORMANCE OF THE PROGRAM IS WITH YOU. SHOULD THE PROGRAM PROVE DEFECTIVE, YOU ASSUME THE COST OF ALL NECESSARY SERVICING, REPAIR OR CORRECTION.\n\n   12. IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING WILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MAY MODIFY AND/OR REDISTRIBUTE THE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES, INCLUDING ANY GENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE USE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED TO LOSS OF DATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY YOU OR THIRD PARTIES OR A FAILURE OF THE PROGRAM TO OPERATE WITH ANY OTHER PROGRAMS), EVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. END OF TERMS AND CONDITIONS\n\nHow to Apply These Terms to Your New Programs\n\nIf you develop a new program, and you want it to be of the greatest possible use to the public, the best way to achieve this is to make it free software which everyone can redistribute and change under these terms.\n\nTo do so, attach the following notices to the program. It is safest to attach them to the start of each source file to most effectively convey the exclusion of warranty; and each file should have at least the \"copyright\" line and a pointer to where the full notice is found.\n\n<one line to give the program's name and an idea of what it does.>\n\nCopyright (C) <yyyy> <name of author>\n\nThis program is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation; either version 2 of the License, or (at your option) any later version.\n\nThis program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.\n\nYou should have received a copy of the GNU General Public License along with this program; if not, write to the Free Software Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301, USA.\n\nAlso add information on how to contact you by electronic and paper mail.\n\nIf the program is interactive, make it output a short notice like this when it starts in an interactive mode:\n\nGnomovision version 69, Copyright (C) year name of author Gnomovision comes with ABSOLUTELY NO WARRANTY; for details type `show w'. This is free software, and you are welcome to redistribute it under certain conditions; type `show c' for details.\n\nThe hypothetical commands `show w' and `show c' should show the appropriate parts of the General Public License. Of course, the commands you use may be called something other than `show w' and `show c'; they could even be mouse-clicks or menu items--whatever suits your program.\n\nYou should also get your employer (if you work as a programmer) or your school, if any, to sign a \"copyright disclaimer\" for the program, if necessary. Here is a sample; alter the names:\n\nYoyodyne, Inc., hereby disclaims all copyright interest in the program `Gnomovision' (which makes passes at compilers) written by James Hacker.\n\n< signature of Ty Coon > , 1 April 1989 Ty Coon, President of Vice",
    "name" : "GNU General Public License v2.0 or later"
  }, {
    "licenseId" : "LicenseRef-GPL-2.0-or-later-WITH-Autoconf-exception",
    "extractedText" : "GNU GENERAL PUBLIC LICENSE\n                       Version 2, June 1991\n\n Copyright (C) 1989, 1991 Free Software Foundation, Inc.,\n 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA\n Everyone is permitted to copy and distribute verbatim copies\n of this license document, but changing it is not allowed.\n\n                            Preamble\n\n  The licenses for most software are designed to take away your\nfreedom to share and change it.  By contrast, the GNU General Public\nLicense is intended to guarantee your freedom to share and change free\nsoftware--to make sure the software is free for all its users.  This\nGeneral Public License applies to most of the Free Software\nFoundation's software and to any other program whose authors commit to\nusing it.  (Some other Free Software Foundation software is covered by\nthe GNU Lesser General Public License instead.)  You can apply it to\nyour programs, too.\n\n  When we speak of free software, we are referring to freedom, not\nprice.  Our General Public Licenses are designed to make sure that you\nhave the freedom to distribute copies of free software (and charge for\nthis service if you wish), that you receive source code or can get it\nif you want it, that you can change the software or use pieces of it\nin new free programs; and that you know you can do these things.\n\n  To protect your rights, we need to make restrictions that forbid\nanyone to deny you these rights or to ask you to surrender the rights.\nThese restrictions translate to certain responsibilities for you if you\ndistribute copies of the software, or if you modify it.\n\n  For example, if you distribute copies of such a program, whether\ngratis or for a fee, you must give the recipients all the rights that\nyou have.  You must make sure that they, too, receive or can get the\nsource code.  And you must show them these terms so they know their\nrights.\n\n  We protect your rights with two steps: (1) copyright the software, and\n(2) offer you this license which gives you legal permission to copy,\ndistribute and/or modify the software.\n\n  Also, for each author's protection and ours, we want to make certain\nthat everyone understands that there is no warranty for this free\nsoftware.  If the software is modified by someone else and passed on, we\nwant its recipients to know that what they have is not the original, so\nthat any problems introduced by others will not reflect on the original\nauthors' reputations.\n\n  Finally, any free program is threatened constantly by software\npatents.  We wish to avoid the danger that redistributors of a free\nprogram will individually obtain patent licenses, in effect making the\nprogram proprietary.  To prevent this, we have made it clear that any\npatent must be licensed for everyone's free use or not licensed at all.\n\n  The precise terms and conditions for copying, distribution and\nmodification follow.\n\n                    GNU GENERAL PUBLIC LICENSE\n   TERMS AND CONDITIONS FOR COPYING, DISTRIBUTION AND MODIFICATION\n\n  0. This License applies to any program or other work which contains\na notice placed by the copyright holder saying it may be distributed\nunder the terms of this General Public License.  The \"Program\", below,\nrefers to any such program or work, and a \"work based on the Program\"\nmeans either the Program or any derivative work under copyright law:\nthat is to say, a work containing the Program or a portion of it,\neither verbatim or with modifications and/or translated into another\nlanguage.  (Hereinafter, translation is included without limitation in\nthe term \"modification\".)  Each licensee is addressed as \"you\".\n\nActivities other than copying, distribution and modification are not\ncovered by this License; they are outside its scope.  The act of\nrunning the Program is not restricted, and the output from the Program\nis covered only if its contents constitute a work based on the\nProgram (independent of having been made by running the Program).\nWhether that is true depends on what the Program does.\n\n  1. You may copy and distribute verbatim copies of the Program's\nsource code as you receive it, in any medium, provided that you\nconspicuously and appropriately publish on each copy an appropriate\ncopyright notice and disclaimer of warranty; keep intact all the\nnotices that refer to this License and to the absence of any warranty;\nand give any other recipients of the Program a copy of this License\nalong with the Program.\n\nYou may charge a fee for the physical act of transferring a copy, and\nyou may at your option offer warranty protection in exchange for a fee.\n\n  2. You may modify your copy or copies of the Program or any portion\nof it, thus forming a work based on the Program, and copy and\ndistribute such modifications or work under the terms of Section 1\nabove, provided that you also meet all of these conditions:\n\n    a) You must cause the modified files to carry prominent notices\n    stating that you changed the files and the date of any change.\n\n    b) You must cause any work that you distribute or publish, that in\n    whole or in part contains or is derived from the Program or any\n    part thereof, to be licensed as a whole at no charge to all third\n    parties under the terms of this License.\n\n    c) If the modified program normally reads commands interactively\n    when run, you must cause it, when started running for such\n    interactive use in the most ordinary way, to print or display an\n    announcement including an appropriate copyright notice and a\n    notice that there is no warranty (or else, saying that you provide\n    a warranty) and that users may redistribute the program under\n    these conditions, and telling the user how to view a copy of this\n    License.  (Exception: if the Program itself is interactive but\n    does not normally print such an announcement, your work based on\n    the Program is not required to print an announcement.)\n\nThese requirements apply to the modified work as a whole.  If\nidentifiable sections of that work are not derived from the Program,\nand can be reasonably considered independent and separate works in\nthemselves, then this License, and its terms, do not apply to those\nsections when you distribute them as separate works.  But when you\ndistribute the same sections as part of a whole which is a work based\non the Program, the distribution of the whole must be on the terms of\nthis License, whose permissions for other licensees extend to the\nentire whole, and thus to each and every part regardless of who wrote it.\n\nThus, it is not the intent of this section to claim rights or contest\nyour rights to work written entirely by you; rather, the intent is to\nexercise the right to control the distribution of derivative or\ncollective works based on the Program.\n\nIn addition, mere aggregation of another work not based on the Program\nwith the Program (or with a work based on the Program) on a volume of\na storage or distribution medium does not bring the other work under\nthe scope of this License.\n\n  3. You may copy and distribute the Program (or a work based on it,\nunder Section 2) in object code or executable form under the terms of\nSections 1 and 2 above provided that you also do one of the following:\n\n    a) Accompany it with the complete corresponding machine-readable\n    source code, which must be distributed under the terms of Sections\n    1 and 2 above on a medium customarily used for software interchange; or,\n\n    b) Accompany it with a written offer, valid for at least three\n    years, to give any third party, for a charge no more than your\n    cost of physically performing source distribution, a complete\n    machine-readable copy of the corresponding source code, to be\n    distributed under the terms of Sections 1 and 2 above on a medium\n    customarily used for software interchange; or,\n\n    c) Accompany it with the information you received as to the offer\n    to distribute corresponding source code.  (This alternative is\n    allowed only for noncommercial distribution and only if you\n    received the program in object code or executable form with such\n    an offer, in accord with Subsection b above.)\n\nThe source code for a work means the preferred form of the work for\nmaking modifications to it.  For an executable work, complete source\ncode means all the source code for all modules it contains, plus any\nassociated interface definition files, plus the scripts used to\ncontrol compilation and installation of the executable.  However, as a\nspecial exception, the source code distributed need not include\nanything that is normally distributed (in either source or binary\nform) with the major components (compiler, kernel, and so on) of the\noperating system on which the executable runs, unless that component\nitself accompanies the executable.\n\nIf distribution of executable or object code is made by offering\naccess to copy from a designated place, then offering equivalent\naccess to copy the source code from the same place counts as\ndistribution of the source code, even though third parties are not\ncompelled to copy the source along with the object code.\n\n  4. You may not copy, modify, sublicense, or distribute the Program\nexcept as expressly provided under this License.  Any attempt\notherwise to copy, modify, sublicense or distribute the Program is\nvoid, and will automatically terminate your rights under this License.\nHowever, parties who have received copies, or rights, from you under\nthis License will not have their licenses terminated so long as such\nparties remain in full compliance.\n\n  5. You are not required to accept this License, since you have not\nsigned it.  However, nothing else grants you permission to modify or\ndistribute the Program or its derivative works.  These actions are\nprohibited by law if you do not accept this License.  Therefore, by\nmodifying or distributing the Program (or any work based on the\nProgram), you indicate your acceptance of this License to do so, and\nall its terms and conditions for copying, distributing or modifying\nthe Program or works based on it.\n\n  6. Each time you redistribute the Program (or any work based on the\nProgram), the recipient automatically receives a license from the\noriginal licensor to copy, distribute or modify the Program subject to\nthese terms and conditions.  You may not impose any further\nrestrictions on the recipients' exercise of the rights granted herein.\nYou are not responsible for enforcing compliance by third parties to\nthis License.\n\n  7. If, as a consequence of a court judgment or allegation of patent\ninfringement or for any other reason (not limited to patent issues),\nconditions are imposed on you (whether by court order, agreement or\notherwise) that contradict the conditions of this License, they do not\nexcuse you from the conditions of this License.  If you cannot\ndistribute so as to satisfy simultaneously your obligations under this\nLicense and any other pertinent obligations, then as a consequence you\nmay not distribute the Program at all.  For example, if a patent\nlicense would not permit royalty-free redistribution of the Program by\nall those who receive copies directly or indirectly through you, then\nthe only way you could satisfy both it and this License would be to\nrefrain entirely from distribution of the Program.\n\nIf any portion of this section is held invalid or unenforceable under\nany particular circumstance, the balance of the section is intended to\napply and the section as a whole is intended to apply in other\ncircumstances.\n\nIt is not the purpose of this section to induce you to infringe any\npatents or other property right claims or to contest validity of any\nsuch claims; this section has the sole purpose of protecting the\nintegrity of the free software distribution system, which is\nimplemented by public license practices.  Many people have made\ngenerous contributions to the wide range of software distributed\nthrough that system in reliance on consistent application of that\nsystem; it is up to the author/donor to decide if he or she is willing\nto distribute software through any other system and a licensee cannot\nimpose that choice.\n\nThis section is intended to make thoroughly clear what is believed to\nbe a consequence of the rest of this License.\n\n  8. If the distribution and/or use of the Program is restricted in\ncertain countries either by patents or by copyrighted interfaces, the\noriginal copyright holder who places the Program under this License\nmay add an explicit geographical distribution limitation excluding\nthose countries, so that distribution is permitted only in or among\ncountries not thus excluded.  In such case, this License incorporates\nthe limitation as if written in the body of this License.\n\n  9. The Free Software Foundation may publish revised and/or new versions\nof the General Public License from time to time.  Such new versions will\nbe similar in spirit to the present version, but may differ in detail to\naddress new problems or concerns.\n\nEach version is given a distinguishing version number.  If the Program\nspecifies a version number of this License which applies to it and \"any\nlater version\", you have the option of following the terms and conditions\neither of that version or of any later version published by the Free\nSoftware Foundation.  If the Program does not specify a version number of\nthis License, you may choose any version ever published by the Free Software\nFoundation.\n\n  10. If you wish to incorporate parts of the Program into other free\nprograms whose distribution conditions are different, write to the author\nto ask for permission.  For software which is copyrighted by the Free\nSoftware Foundation, write to the Free Software Foundation; we sometimes\nmake exceptions for this.  Our decision will be guided by the two goals\nof preserving the free status of all derivatives of our free software and\nof promoting the sharing and reuse of software generally.\n\n                            NO WARRANTY\n\n  11. BECAUSE THE PROGRAM IS LICENSED FREE OF CHARGE, THERE IS NO WARRANTY\nFOR THE PROGRAM, TO THE EXTENT PERMITTED BY APPLICABLE LAW.  EXCEPT WHEN\nOTHERWISE STATED IN WRITING THE COPYRIGHT HOLDERS AND/OR OTHER PARTIES\nPROVIDE THE PROGRAM \"AS IS\" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED\nOR IMPLIED, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF\nMERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.  THE ENTIRE RISK AS\nTO THE QUALITY AND PERFORMANCE OF THE PROGRAM IS WITH YOU.  SHOULD THE\nPROGRAM PROVE DEFECTIVE, YOU ASSUME THE COST OF ALL NECESSARY SERVICING,\nREPAIR OR CORRECTION.\n\n  12. IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING\nWILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MAY MODIFY AND/OR\nREDISTRIBUTE THE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES,\nINCLUDING ANY GENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING\nOUT OF THE USE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED\nTO LOSS OF DATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY\nYOU OR THIRD PARTIES OR A FAILURE OF THE PROGRAM TO OPERATE WITH ANY OTHER\nPROGRAMS), EVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE\nPOSSIBILITY OF SUCH DAMAGES.\n\n                     END OF TERMS AND CONDITIONS\n\n            How to Apply These Terms to Your New Programs\n\n  If you develop a new program, and you want it to be of the greatest\npossible use to the public, the best way to achieve this is to make it\nfree software which everyone can redistribute and change under these terms.\n\n  To do so, attach the following notices to the program.  It is safest\nto attach them to the start of each source file to most effectively\nconvey the exclusion of warranty; and each file should have at least\nthe \"copyright\" line and a pointer to where the full notice is found.\n\n    <one line to give the program's name and a brief idea of what it does.>\n    Copyright (C) <year>  <name of author>\n\n    This program is free software; you can redistribute it and/or modify\n    it under the terms of the GNU General Public License as published by\n    the Free Software Foundation; either version 2 of the License, or\n    (at your option) any later version.\n\n    This program is distributed in the hope that it will be useful,\n    but WITHOUT ANY WARRANTY; without even the implied warranty of\n    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\n    GNU General Public License for more details.\n\n    You should have received a copy of the GNU General Public License along\n    with this program; if not, write to the Free Software Foundation, Inc.,\n    51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA.\n\nAlso add information on how to contact you by electronic and paper mail.\n\nIf the program is interactive, make it output a short notice like this\nwhen it starts in an interactive mode:\n\n    Gnomovision version 69, Copyright (C) year name of author\n    Gnomovision comes with ABSOLUTELY NO WARRANTY; for details type `show w'.\n    This is free software, and you are welcome to redistribute it\n    under certain conditions; type `show c' for details.\n\nThe hypothetical commands `show w' and `show c' should show the appropriate\nparts of the General Public License.  Of course, the commands you use may\nbe called something other than `show w' and `show c'; they could even be\nmouse-clicks or menu items--whatever suits your program.\n\nYou should also get your employer (if you work as a programmer) or your\nschool, if any, to sign a \"copyright disclaimer\" for the program, if\nnecessary.  Here is a sample; alter the names:\n\n  Yoyodyne, Inc., hereby disclaims all copyright interest in the program\n  `Gnomovision' (which makes passes at compilers) written by James Hacker.\n\n  <signature of Ty Coon>, 1 April 1989\n  Ty Coon, President of Vice\n\nThis General Public License does not permit incorporating your program into\nproprietary programs.  If your program is a subroutine library, you may\nconsider it more useful to permit linking proprietary applications with the\nlibrary.  If this is what you want to do, use the GNU Lesser General\nPublic License instead of this License.\n\nAs a special exception to the GNU General Public License, if you\ndistribute this file as part of a program that contains a\nconfiguration script generated by Autoconf, you may include it under\nthe same distribution terms that you use for the rest of that program.",
    "name" : "GPL-2.0-or-later WITH Autoconf-exception"
  }, {
    "licenseId" : "LicenseRef-GPL-3.0-or-later",
    "extractedText" : "GNU GENERAL PUBLIC LICENSE\n\nVersion 3, 29 June 2007\n\nCopyright  2007 Free Software Foundation, Inc. <https://fsf.org/>\n\nEveryone is permitted to copy and distribute verbatim copies of this license document, but changing it is not allowed.\n\nPreamble\n\nThe GNU General Public License is a free, copyleft license for software and other kinds of works.\n\nThe licenses for most software and other practical works are designed to take away your freedom to share and change the works. By contrast, the GNU General Public License is intended to guarantee your freedom to share and change all versions of a program--to make sure it remains free software for all its users. We, the Free Software Foundation, use the GNU General Public License for most of our software; it applies also to any other work released this way by its authors. You can apply it to your programs, too.\n\nWhen we speak of free software, we are referring to freedom, not price. Our General Public Licenses are designed to make sure that you have the freedom to distribute copies of free software (and charge for them if you wish), that you receive source code or can get it if you want it, that you can change the software or use pieces of it in new free programs, and that you know you can do these things.\n\nTo protect your rights, we need to prevent others from denying you these rights or asking you to surrender the rights. Therefore, you have certain responsibilities if you distribute copies of the software, or if you modify it: responsibilities to respect the freedom of others.\n\nFor example, if you distribute copies of such a program, whether gratis or for a fee, you must pass on to the recipients the same freedoms that you received. You must make sure that they, too, receive or can get the source code. And you must show them these terms so they know their rights.\n\nDevelopers that use the GNU GPL protect your rights with two steps: (1) assert copyright on the software, and (2) offer you this License giving you legal permission to copy, distribute and/or modify it.\n\nFor the developers' and authors' protection, the GPL clearly explains that there is no warranty for this free software. For both users' and authors' sake, the GPL requires that modified versions be marked as changed, so that their problems will not be attributed erroneously to authors of previous versions.\n\nSome devices are designed to deny users access to install or run modified versions of the software inside them, although the manufacturer can do so. This is fundamentally incompatible with the aim of protecting users' freedom to change the software. The systematic pattern of such abuse occurs in the area of products for individuals to use, which is precisely where it is most unacceptable. Therefore, we have designed this version of the GPL to prohibit the practice for those products. If such problems arise substantially in other domains, we stand ready to extend this provision to those domains in future versions of the GPL, as needed to protect the freedom of users.\n\nFinally, every program is threatened constantly by software patents. States should not allow patents to restrict development and use of software on general-purpose computers, but in those that do, we wish to avoid the special danger that patents applied to a free program could make it effectively proprietary. To prevent this, the GPL assures that patents cannot be used to render the program non-free.\n\nThe precise terms and conditions for copying, distribution and modification follow.\n\nTERMS AND CONDITIONS\n\n   0. Definitions.\n\n   \"This License\" refers to version 3 of the GNU General Public License.\n\n   \"Copyright\" also means copyright-like laws that apply to other kinds of works, such as semiconductor masks.\n\n   \"The Program\" refers to any copyrightable work licensed under this License. Each licensee is addressed as \"you\". \"Licensees\" and \"recipients\" may be individuals or organizations.\n\n   To \"modify\" a work means to copy from or adapt all or part of the work in a fashion requiring copyright permission, other than the making of an exact copy. The resulting work is called a \"modified version\" of the earlier work or a work \"based on\" the earlier work.\n\n   A \"covered work\" means either the unmodified Program or a work based on the Program.\n\n   To \"propagate\" a work means to do anything with it that, without permission, would make you directly or secondarily liable for infringement under applicable copyright law, except executing it on a computer or modifying a private copy. Propagation includes copying, distribution (with or without modification), making available to the public, and in some countries other activities as well.\n\n   To \"convey\" a work means any kind of propagation that enables other parties to make or receive copies. Mere interaction with a user through a computer network, with no transfer of a copy, is not conveying.\n\n   An interactive user interface displays \"Appropriate Legal Notices\" to the extent that it includes a convenient and prominently visible feature that (1) displays an appropriate copyright notice, and (2) tells the user that there is no warranty for the work (except to the extent that warranties are provided), that licensees may convey the work under this License, and how to view a copy of this License. If the interface presents a list of user commands or options, such as a menu, a prominent item in the list meets this criterion.\n\n   1. Source Code.\n\n   The \"source code\" for a work means the preferred form of the work for making modifications to it. \"Object code\" means any non-source form of a work.\n\n   A \"Standard Interface\" means an interface that either is an official standard defined by a recognized standards body, or, in the case of interfaces specified for a particular programming language, one that is widely used among developers working in that language.\n\n   The \"System Libraries\" of an executable work include anything, other than the work as a whole, that (a) is included in the normal form of packaging a Major Component, but which is not part of that Major Component, and (b) serves only to enable use of the work with that Major Component, or to implement a Standard Interface for which an implementation is available to the public in source code form. A \"Major Component\", in this context, means a major essential component (kernel, window system, and so on) of the specific operating system (if any) on which the executable work runs, or a compiler used to produce the work, or an object code interpreter used to run it.\n\n   The \"Corresponding Source\" for a work in object code form means all the source code needed to generate, install, and (for an executable work) run the object code and to modify the work, including scripts to control those activities. However, it does not include the work's System Libraries, or general-purpose tools or generally available free programs which are used unmodified in performing those activities but which are not part of the work. For example, Corresponding Source includes interface definition files associated with source files for the work, and the source code for shared libraries and dynamically linked subprograms that the work is specifically designed to require, such as by intimate data communication or control flow between those subprograms and other parts of the work.\n\n   The Corresponding Source need not include anything that users can regenerate automatically from other parts of the Corresponding Source.\n\n   The Corresponding Source for a work in source code form is that same work.\n\n   2. Basic Permissions.\n\n   All rights granted under this License are granted for the term of copyright on the Program, and are irrevocable provided the stated conditions are met. This License explicitly affirms your unlimited permission to run the unmodified Program. The output from running a covered work is covered by this License only if the output, given its content, constitutes a covered work. This License acknowledges your rights of fair use or other equivalent, as provided by copyright law.\n\n   You may make, run and propagate covered works that you do not convey, without conditions so long as your license otherwise remains in force. You may convey covered works to others for the sole purpose of having them make modifications exclusively for you, or provide you with facilities for running those works, provided that you comply with the terms of this License in conveying all material for which you do not control copyright. Those thus making or running the covered works for you must do so exclusively on your behalf, under your direction and control, on terms that prohibit them from making any copies of your copyrighted material outside their relationship with you.\n\n   Conveying under any other circumstances is permitted solely under the conditions stated below. Sublicensing is not allowed; section 10 makes it unnecessary.\n\n   3. Protecting Users' Legal Rights From Anti-Circumvention Law.\n\n   No covered work shall be deemed part of an effective technological measure under any applicable law fulfilling obligations under article 11 of the WIPO copyright treaty adopted on 20 December 1996, or similar laws prohibiting or restricting circumvention of such measures.\n\n   When you convey a covered work, you waive any legal power to forbid circumvention of technological measures to the extent such circumvention is effected by exercising rights under this License with respect to the covered work, and you disclaim any intention to limit operation or modification of the work as a means of enforcing, against the work's users, your or third parties' legal rights to forbid circumvention of technological measures.\n\n   4. Conveying Verbatim Copies.\n\n   You may convey verbatim copies of the Program's source code as you receive it, in any medium, provided that you conspicuously and appropriately publish on each copy an appropriate copyright notice; keep intact all notices stating that this License and any non-permissive terms added in accord with section 7 apply to the code; keep intact all notices of the absence of any warranty; and give all recipients a copy of this License along with the Program.\n\n   You may charge any price or no price for each copy that you convey, and you may offer support or warranty protection for a fee.\n\n   5. Conveying Modified Source Versions.\n\n   You may convey a work based on the Program, or the modifications to produce it from the Program, in the form of source code under the terms of section 4, provided that you also meet all of these conditions:\n\n      a) The work must carry prominent notices stating that you modified it, and giving a relevant date.\n\n      b) The work must carry prominent notices stating that it is released under this License and any conditions added under section 7. This requirement modifies the requirement in section 4 to \"keep intact all notices\".\n\n      c) You must license the entire work, as a whole, under this License to anyone who comes into possession of a copy. This License will therefore apply, along with any applicable section 7 additional terms, to the whole of the work, and all its parts, regardless of how they are packaged. This License gives no permission to license the work in any other way, but it does not invalidate such permission if you have separately received it.\n\n      d) If the work has interactive user interfaces, each must display Appropriate Legal Notices; however, if the Program has interactive interfaces that do not display Appropriate Legal Notices, your work need not make them do so.\n\n   A compilation of a covered work with other separate and independent works, which are not by their nature extensions of the covered work, and which are not combined with it such as to form a larger program, in or on a volume of a storage or distribution medium, is called an \"aggregate\" if the compilation and its resulting copyright are not used to limit the access or legal rights of the compilation's users beyond what the individual works permit. Inclusion of a covered work in an aggregate does not cause this License to apply to the other parts of the aggregate.\n\n   6. Conveying Non-Source Forms.\n\n   You may convey a covered work in object code form under the terms of sections 4 and 5, provided that you also convey the machine-readable Corresponding Source under the terms of this License, in one of these ways:\n\n      a) Convey the object code in, or embodied in, a physical product (including a physical distribution medium), accompanied by the Corresponding Source fixed on a durable physical medium customarily used for software interchange.\n\n      b) Convey the object code in, or embodied in, a physical product (including a physical distribution medium), accompanied by a written offer, valid for at least three years and valid for as long as you offer spare parts or customer support for that product model, to give anyone who possesses the object code either (1) a copy of the Corresponding Source for all the software in the product that is covered by this License, on a durable physical medium customarily used for software interchange, for a price no more than your reasonable cost of physically performing this conveying of source, or (2) access to copy the Corresponding Source from a network server at no charge.\n\n      c) Convey individual copies of the object code with a copy of the written offer to provide the Corresponding Source. This alternative is allowed only occasionally and noncommercially, and only if you received the object code with such an offer, in accord with subsection 6b.\n\n      d) Convey the object code by offering access from a designated place (gratis or for a charge), and offer equivalent access to the Corresponding Source in the same way through the same place at no further charge. You need not require recipients to copy the Corresponding Source along with the object code. If the place to copy the object code is a network server, the Corresponding Source may be on a different server (operated by you or a third party) that supports equivalent copying facilities, provided you maintain clear directions next to the object code saying where to find the Corresponding Source. Regardless of what server hosts the Corresponding Source, you remain obligated to ensure that it is available for as long as needed to satisfy these requirements.\n\n      e) Convey the object code using peer-to-peer transmission, provided you inform other peers where the object code and Corresponding Source of the work are being offered to the general public at no charge under subsection 6d.\n\n   A separable portion of the object code, whose source code is excluded from the Corresponding Source as a System Library, need not be included in conveying the object code work.\n\n   A \"User Product\" is either (1) a \"consumer product\", which means any tangible personal property which is normally used for personal, family, or household purposes, or (2) anything designed or sold for incorporation into a dwelling. In determining whether a product is a consumer product, doubtful cases shall be resolved in favor of coverage. For a particular product received by a particular user, \"normally used\" refers to a typical or common use of that class of product, regardless of the status of the particular user or of the way in which the particular user actually uses, or expects or is expected to use, the product. A product is a consumer product regardless of whether the product has substantial commercial, industrial or non-consumer uses, unless such uses represent the only significant mode of use of the product.\n\n   \"Installation Information\" for a User Product means any methods, procedures, authorization keys, or other information required to install and execute modified versions of a covered work in that User Product from a modified version of its Corresponding Source. The information must suffice to ensure that the continued functioning of the modified object code is in no case prevented or interfered with solely because modification has been made.\n\n   If you convey an object code work under this section in, or with, or specifically for use in, a User Product, and the conveying occurs as part of a transaction in which the right of possession and use of the User Product is transferred to the recipient in perpetuity or for a fixed term (regardless of how the transaction is characterized), the Corresponding Source conveyed under this section must be accompanied by the Installation Information. But this requirement does not apply if neither you nor any third party retains the ability to install modified object code on the User Product (for example, the work has been installed in ROM).\n\n   The requirement to provide Installation Information does not include a requirement to continue to provide support service, warranty, or updates for a work that has been modified or installed by the recipient, or for the User Product in which it has been modified or installed. Access to a network may be denied when the modification itself materially and adversely affects the operation of the network or violates the rules and protocols for communication across the network.\n\n   Corresponding Source conveyed, and Installation Information provided, in accord with this section must be in a format that is publicly documented (and with an implementation available to the public in source code form), and must require no special password or key for unpacking, reading or copying.\n\n   7. Additional Terms.\n\n   \"Additional permissions\" are terms that supplement the terms of this License by making exceptions from one or more of its conditions. Additional permissions that are applicable to the entire Program shall be treated as though they were included in this License, to the extent that they are valid under applicable law. If additional permissions apply only to part of the Program, that part may be used separately under those permissions, but the entire Program remains governed by this License without regard to the additional permissions.\n\n   When you convey a copy of a covered work, you may at your option remove any additional permissions from that copy, or from any part of it. (Additional permissions may be written to require their own removal in certain cases when you modify the work.) You may place additional permissions on material, added by you to a covered work, for which you have or can give appropriate copyright permission.\n\n   Notwithstanding any other provision of this License, for material you add to a covered work, you may (if authorized by the copyright holders of that material) supplement the terms of this License with terms:\n\n      a) Disclaiming warranty or limiting liability differently from the terms of sections 15 and 16 of this License; or\n\n      b) Requiring preservation of specified reasonable legal notices or author attributions in that material or in the Appropriate Legal Notices displayed by works containing it; or\n\n      c) Prohibiting misrepresentation of the origin of that material, or requiring that modified versions of such material be marked in reasonable ways as different from the original version; or\n\n      d) Limiting the use for publicity purposes of names of licensors or authors of the material; or\n\n      e) Declining to grant rights under trademark law for use of some trade names, trademarks, or service marks; or\n\n      f) Requiring indemnification of licensors and authors of that material by anyone who conveys the material (or modified versions of it) with contractual assumptions of liability to the recipient, for any liability that these contractual assumptions directly impose on those licensors and authors.\n\n   All other non-permissive additional terms are considered \"further restrictions\" within the meaning of section 10. If the Program as you received it, or any part of it, contains a notice stating that it is governed by this License along with a term that is a further restriction, you may remove that term. If a license document contains a further restriction but permits relicensing or conveying under this License, you may add to a covered work material governed by the terms of that license document, provided that the further restriction does not survive such relicensing or conveying.\n\n   If you add terms to a covered work in accord with this section, you must place, in the relevant source files, a statement of the additional terms that apply to those files, or a notice indicating where to find the applicable terms.\n\n   Additional terms, permissive or non-permissive, may be stated in the form of a separately written license, or stated as exceptions; the above requirements apply either way.\n\n   8. Termination.\n\n   You may not propagate or modify a covered work except as expressly provided under this License. Any attempt otherwise to propagate or modify it is void, and will automatically terminate your rights under this License (including any patent licenses granted under the third paragraph of section 11).\n\n   However, if you cease all violation of this License, then your license from a particular copyright holder is reinstated (a) provisionally, unless and until the copyright holder explicitly and finally terminates your license, and (b) permanently, if the copyright holder fails to notify you of the violation by some reasonable means prior to 60 days after the cessation.\n\n   Moreover, your license from a particular copyright holder is reinstated permanently if the copyright holder notifies you of the violation by some reasonable means, this is the first time you have received notice of violation of this License (for any work) from that copyright holder, and you cure the violation prior to 30 days after your receipt of the notice.\n\n   Termination of your rights under this section does not terminate the licenses of parties who have received copies or rights from you under this License. If your rights have been terminated and not permanently reinstated, you do not qualify to receive new licenses for the same material under section 10.\n\n   9. Acceptance Not Required for Having Copies.\n\n   You are not required to accept this License in order to receive or run a copy of the Program. Ancillary propagation of a covered work occurring solely as a consequence of using peer-to-peer transmission to receive a copy likewise does not require acceptance. However, nothing other than this License grants you permission to propagate or modify any covered work. These actions infringe copyright if you do not accept this License. Therefore, by modifying or propagating a covered work, you indicate your acceptance of this License to do so.\n\n   10. Automatic Licensing of Downstream Recipients.\n\n   Each time you convey a covered work, the recipient automatically receives a license from the original licensors, to run, modify and propagate that work, subject to this License. You are not responsible for enforcing compliance by third parties with this License.\n\n   An \"entity transaction\" is a transaction transferring control of an organization, or substantially all assets of one, or subdividing an organization, or merging organizations. If propagation of a covered work results from an entity transaction, each party to that transaction who receives a copy of the work also receives whatever licenses to the work the party's predecessor in interest had or could give under the previous paragraph, plus a right to possession of the Corresponding Source of the work from the predecessor in interest, if the predecessor has it or can get it with reasonable efforts.\n\n   You may not impose any further restrictions on the exercise of the rights granted or affirmed under this License. For example, you may not impose a license fee, royalty, or other charge for exercise of rights granted under this License, and you may not initiate litigation (including a cross-claim or counterclaim in a lawsuit) alleging that any patent claim is infringed by making, using, selling, offering for sale, or importing the Program or any portion of it.\n\n   11. Patents.\n\n   A \"contributor\" is a copyright holder who authorizes use under this License of the Program or a work on which the Program is based. The work thus licensed is called the contributor's \"contributor version\".\n\n   A contributor's \"essential patent claims\" are all patent claims owned or controlled by the contributor, whether already acquired or hereafter acquired, that would be infringed by some manner, permitted by this License, of making, using, or selling its contributor version, but do not include claims that would be infringed only as a consequence of further modification of the contributor version. For purposes of this definition, \"control\" includes the right to grant patent sublicenses in a manner consistent with the requirements of this License.\n\n   Each contributor grants you a non-exclusive, worldwide, royalty-free patent license under the contributor's essential patent claims, to make, use, sell, offer for sale, import and otherwise run, modify and propagate the contents of its contributor version.\n\n   In the following three paragraphs, a \"patent license\" is any express agreement or commitment, however denominated, not to enforce a patent (such as an express permission to practice a patent or covenant not to sue for patent infringement). To \"grant\" such a patent license to a party means to make such an agreement or commitment not to enforce a patent against the party.\n\n   If you convey a covered work, knowingly relying on a patent license, and the Corresponding Source of the work is not available for anyone to copy, free of charge and under the terms of this License, through a publicly available network server or other readily accessible means, then you must either (1) cause the Corresponding Source to be so available, or (2) arrange to deprive yourself of the benefit of the patent license for this particular work, or (3) arrange, in a manner consistent with the requirements of this License, to extend the patent license to downstream recipients. \"Knowingly relying\" means you have actual knowledge that, but for the patent license, your conveying the covered work in a country, or your recipient's use of the covered work in a country, would infringe one or more identifiable patents in that country that you have reason to believe are valid.\n\n   If, pursuant to or in connection with a single transaction or arrangement, you convey, or propagate by procuring conveyance of, a covered work, and grant a patent license to some of the parties receiving the covered work authorizing them to use, propagate, modify or convey a specific copy of the covered work, then the patent license you grant is automatically extended to all recipients of the covered work and works based on it.\n\n   A patent license is \"discriminatory\" if it does not include within the scope of its coverage, prohibits the exercise of, or is conditioned on the non-exercise of one or more of the rights that are specifically granted under this License. You may not convey a covered work if you are a party to an arrangement with a third party that is in the business of distributing software, under which you make payment to the third party based on the extent of your activity of conveying the work, and under which the third party grants, to any of the parties who would receive the covered work from you, a discriminatory patent license (a) in connection with copies of the covered work conveyed by you (or copies made from those copies), or (b) primarily for and in connection with specific products or compilations that contain the covered work, unless you entered into that arrangement, or that patent license was granted, prior to 28 March 2007.\n\n   Nothing in this License shall be construed as excluding or limiting any implied license or other defenses to infringement that may otherwise be available to you under applicable patent law.\n\n   12. No Surrender of Others' Freedom.\n\n   If conditions are imposed on you (whether by court order, agreement or otherwise) that contradict the conditions of this License, they do not excuse you from the conditions of this License. If you cannot convey a covered work so as to satisfy simultaneously your obligations under this License and any other pertinent obligations, then as a consequence you may not convey it at all. For example, if you agree to terms that obligate you to collect a royalty for further conveying from those to whom you convey the Program, the only way you could satisfy both those terms and this License would be to refrain entirely from conveying the Program.\n\n   13. Use with the GNU Affero General Public License.\n\n   Notwithstanding any other provision of this License, you have permission to link or combine any covered work with a work licensed under version 3 of the GNU Affero General Public License into a single combined work, and to convey the resulting work. The terms of this License will continue to apply to the part which is the covered work, but the special requirements of the GNU Affero General Public License, section 13, concerning interaction through a network will apply to the combination as such.\n\n   14. Revised Versions of this License.\n\n   The Free Software Foundation may publish revised and/or new versions of the GNU General Public License from time to time. Such new versions will be similar in spirit to the present version, but may differ in detail to address new problems or concerns.\n\n   Each version is given a distinguishing version number. If the Program specifies that a certain numbered version of the GNU General Public License \"or any later version\" applies to it, you have the option of following the terms and conditions either of that numbered version or of any later version published by the Free Software Foundation. If the Program does not specify a version number of the GNU General Public License, you may choose any version ever published by the Free Software Foundation.\n\n   If the Program specifies that a proxy can decide which future versions of the GNU General Public License can be used, that proxy's public statement of acceptance of a version permanently authorizes you to choose that version for the Program.\n\n   Later license versions may give you additional or different permissions. However, no additional obligations are imposed on any author or copyright holder as a result of your choosing to follow a later version.\n\n   15. Disclaimer of Warranty.\n\n   THERE IS NO WARRANTY FOR THE PROGRAM, TO THE EXTENT PERMITTED BY APPLICABLE LAW. EXCEPT WHEN OTHERWISE STATED IN WRITING THE COPYRIGHT HOLDERS AND/OR OTHER PARTIES PROVIDE THE PROGRAM \"AS IS\" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. THE ENTIRE RISK AS TO THE QUALITY AND PERFORMANCE OF THE PROGRAM IS WITH YOU. SHOULD THE PROGRAM PROVE DEFECTIVE, YOU ASSUME THE COST OF ALL NECESSARY SERVICING, REPAIR OR CORRECTION.\n\n   16. Limitation of Liability.\n\n   IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING WILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MODIFIES AND/OR CONVEYS THE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES, INCLUDING ANY GENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE USE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED TO LOSS OF DATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY YOU OR THIRD PARTIES OR A FAILURE OF THE PROGRAM TO OPERATE WITH ANY OTHER PROGRAMS), EVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n\n   17. Interpretation of Sections 15 and 16.\n\nIf the disclaimer of warranty and limitation of liability provided above cannot be given local legal effect according to their terms, reviewing courts shall apply local law that most closely approximates an absolute waiver of all civil liability in connection with the Program, unless a warranty or assumption of liability accompanies a copy of the Program in return for a fee.\n\nEND OF TERMS AND CONDITIONS\n\nHow to Apply These Terms to Your New Programs\n\nIf you develop a new program, and you want it to be of the greatest possible use to the public, the best way to achieve this is to make it free software which everyone can redistribute and change under these terms.\n\nTo do so, attach the following notices to the program. It is safest to attach them to the start of each source file to most effectively state the exclusion of warranty; and each file should have at least the \"copyright\" line and a pointer to where the full notice is found.\n\n<one line to give the program's name and a brief idea of what it does.>\n\nCopyright (C) <year> <name of author>\n\nThis program is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version.\n\nThis program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.\n\nYou should have received a copy of the GNU General Public License along with this program. If not, see <https://www.gnu.org/licenses/>.\n\nAlso add information on how to contact you by electronic and paper mail.\n\nIf the program does terminal interaction, make it output a short notice like this when it starts in an interactive mode:\n\n<program> Copyright (C) <year> <name of author>\n\nThis program comes with ABSOLUTELY NO WARRANTY; for details type `show w'.\n\nThis is free software, and you are welcome to redistribute it under certain conditions; type `show c' for details.\n\nThe hypothetical commands `show w' and `show c' should show the appropriate parts of the General Public License. Of course, your program's commands might be different; for a GUI interface, you would use an \"about box\".\n\nYou should also get your employer (if you work as a programmer) or school, if any, to sign a \"copyright disclaimer\" for the program, if necessary. For more information on this, and how to apply and follow the GNU GPL, see <https://www.gnu.org/licenses/>.\n\nThe GNU General Public License does not permit incorporating your program into proprietary programs. If your program is a subroutine library, you may consider it more useful to permit linking proprietary applications with the library. If this is what you want to do, use the GNU Lesser General Public License instead of this License. But first, please read <https://www.gnu.org/ licenses /why-not-lgpl.html>.",
    "name" : "GNU General Public License v3.0 or later"
  }, {
    "licenseId" : "LicenseRef-GPL-3.0-or-later-WITH-Autoconf-exception-44340b8ffba581c57e1e73e97bf161ce",
    "extractedText" : "GNU GENERAL PUBLIC LICENSE\n\nVersion 3, 29 June 2007\n\nCopyright  2007 Free Software Foundation, Inc. <https://fsf.org/>\n\nEveryone is permitted to copy and distribute verbatim copies of this license document, but changing it is not allowed.\n\nPreamble\n\nThe GNU General Public License is a free, copyleft license for software and other kinds of works.\n\nThe licenses for most software and other practical works are designed to take away your freedom to share and change the works. By contrast, the GNU General Public License is intended to guarantee your freedom to share and change all versions of a program--to make sure it remains free software for all its users. We, the Free Software Foundation, use the GNU General Public License for most of our software; it applies also to any other work released this way by its authors. You can apply it to your programs, too.\n\nWhen we speak of free software, we are referring to freedom, not price. Our General Public Licenses are designed to make sure that you have the freedom to distribute copies of free software (and charge for them if you wish), that you receive source code or can get it if you want it, that you can change the software or use pieces of it in new free programs, and that you know you can do these things.\n\nTo protect your rights, we need to prevent others from denying you these rights or asking you to surrender the rights. Therefore, you have certain responsibilities if you distribute copies of the software, or if you modify it: responsibilities to respect the freedom of others.\n\nFor example, if you distribute copies of such a program, whether gratis or for a fee, you must pass on to the recipients the same freedoms that you received. You must make sure that they, too, receive or can get the source code. And you must show them these terms so they know their rights.\n\nDevelopers that use the GNU GPL protect your rights with two steps: (1) assert copyright on the software, and (2) offer you this License giving you legal permission to copy, distribute and/or modify it.\n\nFor the developers' and authors' protection, the GPL clearly explains that there is no warranty for this free software. For both users' and authors' sake, the GPL requires that modified versions be marked as changed, so that their problems will not be attributed erroneously to authors of previous versions.\n\nSome devices are designed to deny users access to install or run modified versions of the software inside them, although the manufacturer can do so. This is fundamentally incompatible with the aim of protecting users' freedom to change the software. The systematic pattern of such abuse occurs in the area of products for individuals to use, which is precisely where it is most unacceptable. Therefore, we have designed this version of the GPL to prohibit the practice for those products. If such problems arise substantially in other domains, we stand ready to extend this provision to those domains in future versions of the GPL, as needed to protect the freedom of users.\n\nFinally, every program is threatened constantly by software patents. States should not allow patents to restrict development and use of software on general-purpose computers, but in those that do, we wish to avoid the special danger that patents applied to a free program could make it effectively proprietary. To prevent this, the GPL assures that patents cannot be used to render the program non-free.\n\nThe precise terms and conditions for copying, distribution and modification follow.\n\nTERMS AND CONDITIONS\n\n0. Definitions.\n\n\"This License\" refers to version 3 of the GNU General Public License.\n\n\"Copyright\" also means copyright-like laws that apply to other kinds of works, such as semiconductor masks.\n\n\"The Program\" refers to any copyrightable work licensed under this License. Each licensee is addressed as \"you\". \"Licensees\" and \"recipients\" may be individuals or organizations.\n\nTo \"modify\" a work means to copy from or adapt all or part of the work in a fashion requiring copyright permission, other than the making of an exact copy. The resulting work is called a \"modified version\" of the earlier work or a work \"based on\" the earlier work.\n\nA \"covered work\" means either the unmodified Program or a work based on the Program.\n\nTo \"propagate\" a work means to do anything with it that, without permission, would make you directly or secondarily liable for infringement under applicable copyright law, except executing it on a computer or modifying a private copy. Propagation includes copying, distribution (with or without modification), making available to the public, and in some countries other activities as well.\n\nTo \"convey\" a work means any kind of propagation that enables other parties to make or receive copies. Mere interaction with a user through a computer network, with no transfer of a copy, is not conveying.\n\nAn interactive user interface displays \"Appropriate Legal Notices\" to the extent that it includes a convenient and prominently visible feature that (1) displays an appropriate copyright notice, and (2) tells the user that there is no warranty for the work (except to the extent that warranties are provided), that licensees may convey the work under this License, and how to view a copy of this License. If the interface presents a list of user commands or options, such as a menu, a prominent item in the list meets this criterion.\n\n1. Source Code.\n\nThe \"source code\" for a work means the preferred form of the work for making modifications to it. \"Object code\" means any non-source form of a work.\n\nA \"Standard Interface\" means an interface that either is an official standard defined by a recognized standards body, or, in the case of interfaces specified for a particular programming language, one that is widely used among developers working in that language.\n\nThe \"System Libraries\" of an executable work include anything, other than the work as a whole, that (a) is included in the normal form of packaging a Major Component, but which is not part of that Major Component, and (b) serves only to enable use of the work with that Major Component, or to implement a Standard Interface for which an implementation is available to the public in source code form. A \"Major Component\", in this context, means a major essential component (kernel, window system, and so on) of the specific operating system (if any) on which the executable work runs, or a compiler used to produce the work, or an object code interpreter used to run it.\n\nThe \"Corresponding Source\" for a work in object code form means all the source code needed to generate, install, and (for an executable work) run the object code and to modify the work, including scripts to control those activities. However, it does not include the work's System Libraries, or general-purpose tools or generally available free programs which are used unmodified in performing those activities but which are not part of the work. For example, Corresponding Source includes interface definition files associated with source files for the work, and the source code for shared libraries and dynamically linked subprograms that the work is specifically designed to require, such as by intimate data communication or control flow between those subprograms and other parts of the work.\n\nThe Corresponding Source need not include anything that users can regenerate automatically from other parts of the Corresponding Source.\n\nThe Corresponding Source for a work in source code form is that same work.\n\n2. Basic Permissions.\n\nAll rights granted under this License are granted for the term of copyright on the Program, and are irrevocable provided the stated conditions are met. This License explicitly affirms your unlimited permission to run the unmodified Program. The output from running a covered work is covered by this License only if the output, given its content, constitutes a covered work. This License acknowledges your rights of fair use or other equivalent, as provided by copyright law.\n\nYou may make, run and propagate covered works that you do not convey, without conditions so long as your license otherwise remains in force. You may convey covered works to others for the sole purpose of having them make modifications exclusively for you, or provide you with facilities for running those works, provided that you comply with the terms of this License in conveying all material for which you do not control copyright. Those thus making or running the covered works for you must do so exclusively on your behalf, under your direction and control, on terms that prohibit them from making any copies of your copyrighted material outside their relationship with you.\n\nConveying under any other circumstances is permitted solely under the conditions stated below. Sublicensing is not allowed; section 10 makes it unnecessary.\n\n3. Protecting Users' Legal Rights From Anti-Circumvention Law.\n\nNo covered work shall be deemed part of an effective technological measure under any applicable law fulfilling obligations under article 11 of the WIPO copyright treaty adopted on 20 December 1996, or similar laws prohibiting or restricting circumvention of such measures.\n\nWhen you convey a covered work, you waive any legal power to forbid circumvention of technological measures to the extent such circumvention is effected by exercising rights under this License with respect to the covered work, and you disclaim any intention to limit operation or modification of the work as a means of enforcing, against the work's users, your or third parties' legal rights to forbid circumvention of technological measures.\n\n4. Conveying Verbatim Copies.\n\nYou may convey verbatim copies of the Program's source code as you receive it, in any medium, provided that you conspicuously and appropriately publish on each copy an appropriate copyright notice; keep intact all notices stating that this License and any non-permissive terms added in accord with section 7 apply to the code; keep intact all notices of the absence of any warranty; and give all recipients a copy of this License along with the Program.\n\nYou may charge any price or no price for each copy that you convey, and you may offer support or warranty protection for a fee.\n\n5. Conveying Modified Source Versions.\n\nYou may convey a work based on the Program, or the modifications to produce it from the Program, in the form of source code under the terms of section 4, provided that you also meet all of these conditions:\n\na) The work must carry prominent notices stating that you modified it, and giving a relevant date.\n\nb) The work must carry prominent notices stating that it is released under this License and any conditions added under section 7. This requirement modifies the requirement in section 4 to \"keep intact all notices\".\n\nc) You must license the entire work, as a whole, under this License to anyone who comes into possession of a copy. This License will therefore apply, along with any applicable section 7 additional terms, to the whole of the work, and all its parts, regardless of how they are packaged. This License gives no permission to license the work in any other way, but it does not invalidate such permission if you have separately received it.\n\nd) If the work has interactive user interfaces, each must display Appropriate Legal Notices; however, if the Program has interactive interfaces that do not display Appropriate Legal Notices, your work need not make them do so.\n\nA compilation of a covered work with other separate and independent works, which are not by their nature extensions of the covered work, and which are not combined with it such as to form a larger program, in or on a volume of a storage or distribution medium, is called an \"aggregate\" if the compilation and its resulting copyright are not used to limit the access or legal rights of the compilation's users beyond what the individual works permit. Inclusion of a covered work in an aggregate does not cause this License to apply to the other parts of the aggregate.\n\n6. Conveying Non-Source Forms.\n\nYou may convey a covered work in object code form under the terms of sections 4 and 5, provided that you also convey the machine-readable Corresponding Source under the terms of this License, in one of these ways:\n\na) Convey the object code in, or embodied in, a physical product (including a physical distribution medium), accompanied by the Corresponding Source fixed on a durable physical medium customarily used for software interchange.\n\nb) Convey the object code in, or embodied in, a physical product (including a physical distribution medium), accompanied by a written offer, valid for at least three years and valid for as long as you offer spare parts or customer support for that product model, to give anyone who possesses the object code either (1) a copy of the Corresponding Source for all the software in the product that is covered by this License, on a durable physical medium customarily used for software interchange, for a price no more than your reasonable cost of physically performing this conveying of source, or (2) access to copy the Corresponding Source from a network server at no charge.\n\nc) Convey individual copies of the object code with a copy of the written offer to provide the Corresponding Source. This alternative is allowed only occasionally and noncommercially, and only if you received the object code with such an offer, in accord with subsection 6b.\n\nd) Convey the object code by offering access from a designated place (gratis or for a charge), and offer equivalent access to the Corresponding Source in the same way through the same place at no further charge. You need not require recipients to copy the Corresponding Source along with the object code. If the place to copy the object code is a network server, the Corresponding Source may be on a different server (operated by you or a third party) that supports equivalent copying facilities, provided you maintain clear directions next to the object code saying where to find the Corresponding Source. Regardless of what server hosts the Corresponding Source, you remain obligated to ensure that it is available for as long as needed to satisfy these requirements.\n\ne) Convey the object code using peer-to-peer transmission, provided you inform other peers where the object code and Corresponding Source of the work are being offered to the general public at no charge under subsection 6d.\n\nA separable portion of the object code, whose source code is excluded from the Corresponding Source as a System Library, need not be included in conveying the object code work.\n\nA \"User Product\" is either (1) a \"consumer product\", which means any tangible personal property which is normally used for personal, family, or household purposes, or (2) anything designed or sold for incorporation into a dwelling. In determining whether a product is a consumer product, doubtful cases shall be resolved in favor of coverage. For a particular product received by a particular user, \"normally used\" refers to a typical or common use of that class of product, regardless of the status of the particular user or of the way in which the particular user actually uses, or expects or is expected to use, the product. A product is a consumer product regardless of whether the product has substantial commercial, industrial or non-consumer uses, unless such uses represent the only significant mode of use of the product.\n\n\"Installation Information\" for a User Product means any methods, procedures, authorization keys, or other information required to install and execute modified versions of a covered work in that User Product from a modified version of its Corresponding Source. The information must suffice to ensure that the continued functioning of the modified object code is in no case prevented or interfered with solely because modification has been made.\n\nIf you convey an object code work under this section in, or with, or specifically for use in, a User Product, and the conveying occurs as part of a transaction in which the right of possession and use of the User Product is transferred to the recipient in perpetuity or for a fixed term (regardless of how the transaction is characterized), the Corresponding Source conveyed under this section must be accompanied by the Installation Information. But this requirement does not apply if neither you nor any third party retains the ability to install modified object code on the User Product (for example, the work has been installed in ROM).\n\nThe requirement to provide Installation Information does not include a requirement to continue to provide support service, warranty, or updates for a work that has been modified or installed by the recipient, or for the User Product in which it has been modified or installed. Access to a network may be denied when the modification itself materially and adversely affects the operation of the network or violates the rules and protocols for communication across the network.\n\nCorresponding Source conveyed, and Installation Information provided, in accord with this section must be in a format that is publicly documented (and with an implementation available to the public in source code form), and must require no special password or key for unpacking, reading or copying.\n\n7. Additional Terms.\n\n\"Additional permissions\" are terms that supplement the terms of this License by making exceptions from one or more of its conditions. Additional permissions that are applicable to the entire Program shall be treated as though they were included in this License, to the extent that they are valid under applicable law. If additional permissions apply only to part of the Program, that part may be used separately under those permissions, but the entire Program remains governed by this License without regard to the additional permissions.\n\nWhen you convey a copy of a covered work, you may at your option remove any additional permissions from that copy, or from any part of it. (Additional permissions may be written to require their own removal in certain cases when you modify the work.) You may place additional permissions on material, added by you to a covered work, for which you have or can give appropriate copyright permission.\n\nNotwithstanding any other provision of this License, for material you add to a covered work, you may (if authorized by the copyright holders of that material) supplement the terms of this License with terms:\n\na) Disclaiming warranty or limiting liability differently from the terms of sections 15 and 16 of this License; or\n\nb) Requiring preservation of specified reasonable legal notices or author attributions in that material or in the Appropriate Legal Notices displayed by works containing it; or\n\nc) Prohibiting misrepresentation of the origin of that material, or requiring that modified versions of such material be marked in reasonable ways as different from the original version; or\n\nd) Limiting the use for publicity purposes of names of licensors or authors of the material; or\n\ne) Declining to grant rights under trademark law for use of some trade names, trademarks, or service marks; or\n\nf) Requiring indemnification of licensors and authors of that material by anyone who conveys the material (or modified versions of it) with contractual assumptions of liability to the recipient, for any liability that these contractual assumptions directly impose on those licensors and authors.\n\nAll other non-permissive additional terms are considered \"further restrictions\" within the meaning of section 10. If the Program as you received it, or any part of it, contains a notice stating that it is governed by this License along with a term that is a further restriction, you may remove that term. If a license document contains a further restriction but permits relicensing or conveying under this License, you may add to a covered work material governed by the terms of that license document, provided that the further restriction does not survive such relicensing or conveying.\n\nIf you add terms to a covered work in accord with this section, you must place, in the relevant source files, a statement of the additional terms that apply to those files, or a notice indicating where to find the applicable terms.\n\nAdditional terms, permissive or non-permissive, may be stated in the form of a separately written license, or stated as exceptions; the above requirements apply either way.\n\n8. Termination.\n\nYou may not propagate or modify a covered work except as expressly provided under this License. Any attempt otherwise to propagate or modify it is void, and will automatically terminate your rights under this License (including any patent licenses granted under the third paragraph of section 11).\n\nHowever, if you cease all violation of this License, then your license from a particular copyright holder is reinstated (a) provisionally, unless and until the copyright holder explicitly and finally terminates your license, and (b) permanently, if the copyright holder fails to notify you of the violation by some reasonable means prior to 60 days after the cessation.\n\nMoreover, your license from a particular copyright holder is reinstated permanently if the copyright holder notifies you of the violation by some reasonable means, this is the first time you have received notice of violation of this License (for any work) from that copyright holder, and you cure the violation prior to 30 days after your receipt of the notice.\n\nTermination of your rights under this section does not terminate the licenses of parties who have received copies or rights from you under this License. If your rights have been terminated and not permanently reinstated, you do not qualify to receive new licenses for the same material under section 10.\n\n9. Acceptance Not Required for Having Copies.\n\nYou are not required to accept this License in order to receive or run a copy of the Program. Ancillary propagation of a covered work occurring solely as a consequence of using peer-to-peer transmission to receive a copy likewise does not require acceptance. However, nothing other than this License grants you permission to propagate or modify any covered work. These actions infringe copyright if you do not accept this License. Therefore, by modifying or propagating a covered work, you indicate your acceptance of this License to do so.\n\n10. Automatic Licensing of Downstream Recipients.\n\nEach time you convey a covered work, the recipient automatically receives a license from the original licensors, to run, modify and propagate that work, subject to this License. You are not responsible for enforcing compliance by third parties with this License.\n\nAn \"entity transaction\" is a transaction transferring control of an organization, or substantially all assets of one, or subdividing an organization, or merging organizations. If propagation of a covered work results from an entity transaction, each party to that transaction who receives a copy of the work also receives whatever licenses to the work the party's predecessor in interest had or could give under the previous paragraph, plus a right to possession of the Corresponding Source of the work from the predecessor in interest, if the predecessor has it or can get it with reasonable efforts.\n\nYou may not impose any further restrictions on the exercise of the rights granted or affirmed under this License. For example, you may not impose a license fee, royalty, or other charge for exercise of rights granted under this License, and you may not initiate litigation (including a cross-claim or counterclaim in a lawsuit) alleging that any patent claim is infringed by making, using, selling, offering for sale, or importing the Program or any portion of it.\n\n11. Patents.\n\nA \"contributor\" is a copyright holder who authorizes use under this License of the Program or a work on which the Program is based. The work thus licensed is called the contributor's \"contributor version\".\n\nA contributor's \"essential patent claims\" are all patent claims owned or controlled by the contributor, whether already acquired or hereafter acquired, that would be infringed by some manner, permitted by this License, of making, using, or selling its contributor version, but do not include claims that would be infringed only as a consequence of further modification of the contributor version. For purposes of this definition, \"control\" includes the right to grant patent sublicenses in a manner consistent with the requirements of this License.\n\nEach contributor grants you a non-exclusive, worldwide, royalty-free patent license under the contributor's essential patent claims, to make, use, sell, offer for sale, import and otherwise run, modify and propagate the contents of its contributor version.\n\nIn the following three paragraphs, a \"patent license\" is any express agreement or commitment, however denominated, not to enforce a patent (such as an express permission to practice a patent or covenant not to sue for patent infringement). To \"grant\" such a patent license to a party means to make such an agreement or commitment not to enforce a patent against the party.\n\nIf you convey a covered work, knowingly relying on a patent license, and the Corresponding Source of the work is not available for anyone to copy, free of charge and under the terms of this License, through a publicly available network server or other readily accessible means, then you must either (1) cause the Corresponding Source to be so available, or (2) arrange to deprive yourself of the benefit of the patent license for this particular work, or (3) arrange, in a manner consistent with the requirements of this License, to extend the patent license to downstream recipients. \"Knowingly relying\" means you have actual knowledge that, but for the patent license, your conveying the covered work in a country, or your recipient's use of the covered work in a country, would infringe one or more identifiable patents in that country that you have reason to believe are valid.\n\nIf, pursuant to or in connection with a single transaction or arrangement, you convey, or propagate by procuring conveyance of, a covered work, and grant a patent license to some of the parties receiving the covered work authorizing them to use, propagate, modify or convey a specific copy of the covered work, then the patent license you grant is automatically extended to all recipients of the covered work and works based on it.\n\nA patent license is \"discriminatory\" if it does not include within the scope of its coverage, prohibits the exercise of, or is conditioned on the non-exercise of one or more of the rights that are specifically granted under this License. You may not convey a covered work if you are a party to an arrangement with a third party that is in the business of distributing software, under which you make payment to the third party based on the extent of your activity of conveying the work, and under which the third party grants, to any of the parties who would receive the covered work from you, a discriminatory patent license (a) in connection with copies of the covered work conveyed by you (or copies made from those copies), or (b) primarily for and in connection with specific products or compilations that contain the covered work, unless you entered into that arrangement, or that patent license was granted, prior to 28 March 2007.\n\nNothing in this License shall be construed as excluding or limiting any implied license or other defenses to infringement that may otherwise be available to you under applicable patent law.\n\n12. No Surrender of Others' Freedom.\n\nIf conditions are imposed on you (whether by court order, agreement or otherwise) that contradict the conditions of this License, they do not excuse you from the conditions of this License. If you cannot convey a covered work so as to satisfy simultaneously your obligations under this License and any other pertinent obligations, then as a consequence you may not convey it at all. For example, if you agree to terms that obligate you to collect a royalty for further conveying from those to whom you convey the Program, the only way you could satisfy both those terms and this License would be to refrain entirely from conveying the Program.\n\n13. Use with the GNU Affero General Public License.\n\nNotwithstanding any other provision of this License, you have permission to link or combine any covered work with a work licensed under version 3 of the GNU Affero General Public License into a single combined work, and to convey the resulting work. The terms of this License will continue to apply to the part which is the covered work, but the special requirements of the GNU Affero General Public License, section 13, concerning interaction through a network will apply to the combination as such.\n\n14. Revised Versions of this License.\n\nThe Free Software Foundation may publish revised and/or new versions of the GNU General Public License from time to time. Such new versions will be similar in spirit to the present version, but may differ in detail to address new problems or concerns.\n\nEach version is given a distinguishing version number. If the Program specifies that a certain numbered version of the GNU General Public License \"or any later version\" applies to it, you have the option of following the terms and conditions either of that numbered version or of any later version published by the Free Software Foundation. If the Program does not specify a version number of the GNU General Public License, you may choose any version ever published by the Free Software Foundation.\n\nIf the Program specifies that a proxy can decide which future versions of the GNU General Public License can be used, that proxy's public statement of acceptance of a version permanently authorizes you to choose that version for the Program.\n\nLater license versions may give you additional or different permissions. However, no additional obligations are imposed on any author or copyright holder as a result of your choosing to follow a later version.\n\n15. Disclaimer of Warranty.\n\nTHERE IS NO WARRANTY FOR THE PROGRAM, TO THE EXTENT PERMITTED BY APPLICABLE LAW. EXCEPT WHEN OTHERWISE STATED IN WRITING THE COPYRIGHT HOLDERS AND/OR OTHER PARTIES PROVIDE THE PROGRAM \"AS IS\" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. THE ENTIRE RISK AS TO THE QUALITY AND PERFORMANCE OF THE PROGRAM IS WITH YOU. SHOULD THE PROGRAM PROVE DEFECTIVE, YOU ASSUME THE COST OF ALL NECESSARY SERVICING, REPAIR OR CORRECTION.\n\n16. Limitation of Liability.\n\nIN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING WILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MODIFIES AND/OR CONVEYS THE PROGRAM AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES, INCLUDING ANY GENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE USE OR INABILITY TO USE THE PROGRAM (INCLUDING BUT NOT LIMITED TO LOSS OF DATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY YOU OR THIRD PARTIES OR A FAILURE OF THE PROGRAM TO OPERATE WITH ANY OTHER PROGRAMS), EVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.\n\n17. Interpretation of Sections 15 and 16.\n\nIf the disclaimer of warranty and limitation of liability provided above cannot be given local legal effect according to their terms, reviewing courts shall apply local law that most closely approximates an absolute waiver of all civil liability in connection with the Program, unless a warranty or assumption of liability accompanies a copy of the Program in return for a fee.\n\nEND OF TERMS AND CONDITIONS\n\nHow to Apply These Terms to Your New Programs\n\nIf you develop a new program, and you want it to be of the greatest possible use to the public, the best way to achieve this is to make it free software which everyone can redistribute and change under these terms.\n\nTo do so, attach the following notices to the program. It is safest to attach them to the start of each source file to most effectively state the exclusion of warranty; and each file should have at least the \"copyright\" line and a pointer to where the full notice is found.\n\n<one line to give the program's name and a brief idea of what it does.>\n\nCopyright (C) <year> <name of author>\n\nThis program is free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version.\n\nThis program is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.\n\nYou should have received a copy of the GNU General Public License along with this program. If not, see <https://www.gnu.org/licenses/>.\n\nAlso add information on how to contact you by electronic and paper mail.\n\nIf the program does terminal interaction, make it output a short notice like this when it starts in an interactive mode:\n\n<program> Copyright (C) <year> <name of author>\n\nThis program comes with ABSOLUTELY NO WARRANTY; for details type `show w'.\n\nThis is free software, and you are welcome to redistribute it under certain conditions; type `show c' for details.\n\nThe hypothetical commands `show w' and `show c' should show the appropriate parts of the General Public License. Of course, your program's commands might be different; for a GUI interface, you would use an \"about box\".\n\nYou should also get your employer (if you work as a programmer) or school, if any, to sign a \"copyright disclaimer\" for the program, if necessary. For more information on this, and how to apply and follow the GNU GPL, see <https://www.gnu.org/licenses/>.\n\nThe GNU General Public License does not permit incorporating your program into proprietary programs. If your program is a subroutine library, you may consider it more useful to permit linking proprietary applications with the library. If this is what you want to do, use the GNU Lesser General Public License instead of this License. But first, please read <https://www.gnu.org/ licenses /why-not-lgpl.html>.\n\n\n\n As a special exception, the respective Autoconf Macro's copyright owner\n gives unlimited permission to copy, distribute and modify the configure\n scripts that are the output of Autoconf when processing the Macro. You\n need not follow the terms of the GNU General Public License when using\n or distributing such scripts, even though portions of the text of the\n Macro appear in them. The GNU General Public License (GPL) does govern\n all other use of the material that constitutes the Autoconf Macro.\n\n This special exception to the GPL applies to versions of the Autoconf\n Macro released by the Autoconf Archive. When you make and distribute a\n modified version of the Autoconf Macro, you may extend this special\nexception to the GPL to apply to your modified version as well.",
    "name" : "GPL-3.0-or-later WITH Autoconf-exception"
  }, {
    "licenseId" : "LicenseRef-LGPL-2.1-or-later",
    "extractedText" : "GNU LESSER GENERAL PUBLIC LICENSE\n\nVersion 2.1, February 1999\n\nCopyright (C) 1991, 1999 Free Software Foundation, Inc.\n\n51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA\n\nEveryone is permitted to copy and distribute verbatim copies of this license document, but changing it is not allowed.\n\n[This is the first released version of the Lesser GPL. It also counts as the successor of the GNU Library Public License, version 2, hence the version number 2.1.]\n\nPreamble\n\nThe licenses for most software are designed to take away your freedom to share and change it. By contrast, the GNU General Public Licenses are intended to guarantee your freedom to share and change free software--to make sure the software is free for all its users.\n\nThis license, the Lesser General Public License, applies to some specially designated software packages--typically libraries--of the Free Software Foundation and other authors who decide to use it. You can use it too, but we suggest you first think carefully about whether this license or the ordinary General Public License is the better strategy to use in any particular case, based on the explanations below.\n\nWhen we speak of free software, we are referring to freedom of use, not price. Our General Public Licenses are designed to make sure that you have the freedom to distribute copies of free software (and charge for this service if you wish); that you receive source code or can get it if you want it; that you can change the software and use pieces of it in new free programs; and that you are informed that you can do these things.\n\nTo protect your rights, we need to make restrictions that forbid distributors to deny you these rights or to ask you to surrender these rights. These restrictions translate to certain responsibilities for you if you distribute copies of the library or if you modify it.\n\nFor example, if you distribute copies of the library, whether gratis or for a fee, you must give the recipients all the rights that we gave you. You must make sure that they, too, receive or can get the source code. If you link other code with the library, you must provide complete object files to the recipients, so that they can relink them with the library after making changes to the library and recompiling it. And you must show them these terms so they know their rights.\n\nWe protect your rights with a two-step method: (1) we copyright the library, and (2) we offer you this license, which gives you legal permission to copy, distribute and/or modify the library.\n\nTo protect each distributor, we want to make it very clear that there is no warranty for the free library. Also, if the library is modified by someone else and passed on, the recipients should know that what they have is not the original version, so that the original author's reputation will not be affected by problems that might be introduced by others.\n\nFinally, software patents pose a constant threat to the existence of any free program. We wish to make sure that a company cannot effectively restrict the users of a free program by obtaining a restrictive license from a patent holder. Therefore, we insist that any patent license obtained for a version of the library must be consistent with the full freedom of use specified in this license.\n\nMost GNU software, including some libraries, is covered by the ordinary GNU General Public License. This license, the GNU Lesser General Public License, applies to certain designated libraries, and is quite different from the ordinary General Public License. We use this license for certain libraries in order to permit linking those libraries into non-free programs.\n\nWhen a program is linked with a library, whether statically or using a shared library, the combination of the two is legally speaking a combined work, a derivative of the original library. The ordinary General Public License therefore permits such linking only if the entire combination fits its criteria of freedom. The Lesser General Public License permits more lax criteria for linking other code with the library.\n\nWe call this license the \"Lesser\" General Public License because it does Less to protect the user's freedom than the ordinary General Public License. It also provides other free software developers Less of an advantage over competing non-free programs. These disadvantages are the reason we use the ordinary General Public License for many libraries. However, the Lesser license provides advantages in certain special circumstances.\n\nFor example, on rare occasions, there may be a special need to encourage the widest possible use of a certain library, so that it becomes a de-facto standard. To achieve this, non-free programs must be allowed to use the library. A more frequent case is that a free library does the same job as widely used non-free libraries. In this case, there is little to gain by limiting the free library to free software only, so we use the Lesser General Public License.\n\nIn other cases, permission to use a particular library in non-free programs enables a greater number of people to use a large body of free software. For example, permission to use the GNU C Library in non-free programs enables many more people to use the whole GNU operating system, as well as its variant, the GNU/Linux operating system.\n\nAlthough the Lesser General Public License is Less protective of the users' freedom, it does ensure that the user of a program that is linked with the Library has the freedom and the wherewithal to run that program using a modified version of the Library.\n\nThe precise terms and conditions for copying, distribution and modification follow. Pay close attention to the difference between a \"work based on the library\" and a \"work that uses the library\". The former contains code derived from the library, whereas the latter must be combined with the library in order to run.\n\nTERMS AND CONDITIONS FOR COPYING, DISTRIBUTION AND MODIFICATION\n\n   0. This License Agreement applies to any software library or other program which contains a notice placed by the copyright holder or other authorized party saying it may be distributed under the terms of this Lesser General Public License (also called \"this License\"). Each licensee is addressed as \"you\".\n\n   A \"library\" means a collection of software functions and/or data prepared so as to be conveniently linked with application programs (which use some of those functions and data) to form executables.\n\n   The \"Library\", below, refers to any such software library or work which has been distributed under these terms. A \"work based on the Library\" means either the Library or any derivative work under copyright law: that is to say, a work containing the Library or a portion of it, either verbatim or with modifications and/or translated straightforwardly into another language. (Hereinafter, translation is included without limitation in the term \"modification\".)\n\n   \"Source code\" for a work means the preferred form of the work for making modifications to it. For a library, complete source code means all the source code for all modules it contains, plus any associated interface definition files, plus the scripts used to control compilation and installation of the library.\n\n   Activities other than copying, distribution and modification are not covered by this License; they are outside its scope. The act of running a program using the Library is not restricted, and output from such a program is covered only if its contents constitute a work based on the Library (independent of the use of the Library in a tool for writing it). Whether that is true depends on what the Library does and what the program that uses the Library does.\n\n   1. You may copy and distribute verbatim copies of the Library's complete source code as you receive it, in any medium, provided that you conspicuously and appropriately publish on each copy an appropriate copyright notice and disclaimer of warranty; keep intact all the notices that refer to this License and to the absence of any warranty; and distribute a copy of this License along with the Library.\n\n   You may charge a fee for the physical act of transferring a copy, and you may at your option offer warranty protection in exchange for a fee.\n\n   2. You may modify your copy or copies of the Library or any portion of it, thus forming a work based on the Library, and copy and distribute such modifications or work under the terms of Section 1 above, provided that you also meet all of these conditions:\n\n      a) The modified work must itself be a software library.\n\n      b) You must cause the files modified to carry prominent notices stating that you changed the files and the date of any change.\n\n      c) You must cause the whole of the work to be licensed at no charge to all third parties under the terms of this License.\n\n      d) If a facility in the modified Library refers to a function or a table of data to be supplied by an application program that uses the facility, other than as an argument passed when the facility is invoked, then you must make a good faith effort to ensure that, in the event an application does not supply such function or table, the facility still operates, and performs whatever part of its purpose remains meaningful.\n\n   (For example, a function in a library to compute square roots has a purpose that is entirely well-defined independent of the application. Therefore, Subsection 2d requires that any application-supplied function or table used by this function must be optional: if the application does not supply it, the square root function must still compute square roots.)\n\n   These requirements apply to the modified work as a whole. If identifiable sections of that work are not derived from the Library, and can be reasonably considered independent and separate works in themselves, then this License, and its terms, do not apply to those sections when you distribute them as separate works. But when you distribute the same sections as part of a whole which is a work based on the Library, the distribution of the whole must be on the terms of this License, whose permissions for other licensees extend to the entire whole, and thus to each and every part regardless of who wrote it.\n\n   Thus, it is not the intent of this section to claim rights or contest your rights to work written entirely by you; rather, the intent is to exercise the right to control the distribution of derivative or collective works based on the Library.\n\n   In addition, mere aggregation of another work not based on the Library with the Library (or with a work based on the Library) on a volume of a storage or distribution medium does not bring the other work under the scope of this License.\n\n   3. You may opt to apply the terms of the ordinary GNU General Public License instead of this License to a given copy of the Library. To do this, you must alter all the notices that refer to this License, so that they refer to the ordinary GNU General Public License, version 2, instead of to this License. (If a newer version than version 2 of the ordinary GNU General Public License has appeared, then you can specify that version instead if you wish.) Do not make any other change in these notices.\n\n   Once this change is made in a given copy, it is irreversible for that copy, so the ordinary GNU General Public License applies to all subsequent copies and derivative works made from that copy.\n\n   This option is useful when you wish to copy part of the code of the Library into a program that is not a library.\n\n   4. You may copy and distribute the Library (or a portion or derivative of it, under Section 2) in object code or executable form under the terms of Sections 1 and 2 above provided that you accompany it with the complete corresponding machine-readable source code, which must be distributed under the terms of Sections 1 and 2 above on a medium customarily used for software interchange.\n\n   If distribution of object code is made by offering access to copy from a designated place, then offering equivalent access to copy the source code from the same place satisfies the requirement to distribute the source code, even though third parties are not compelled to copy the source along with the object code.\n\n   5. A program that contains no derivative of any portion of the Library, but is designed to work with the Library by being compiled or linked with it, is called a \"work that uses the Library\". Such a work, in isolation, is not a derivative work of the Library, and therefore falls outside the scope of this License.\n\n   However, linking a \"work that uses the Library\" with the Library creates an executable that is a derivative of the Library (because it contains portions of the Library), rather than a \"work that uses the library\". The executable is therefore covered by this License. Section 6 states terms for distribution of such executables.\n\n   When a \"work that uses the Library\" uses material from a header file that is part of the Library, the object code for the work may be a derivative work of the Library even though the source code is not. Whether this is true is especially significant if the work can be linked without the Library, or if the work is itself a library. The threshold for this to be true is not precisely defined by law.\n\n   If such an object file uses only numerical parameters, data structure layouts and accessors, and small macros and small inline functions (ten lines or less in length), then the use of the object file is unrestricted, regardless of whether it is legally a derivative work. (Executables containing this object code plus portions of the Library will still fall under Section 6.)\n\n   Otherwise, if the work is a derivative of the Library, you may distribute the object code for the work under the terms of Section 6. Any executables containing that work also fall under Section 6, whether or not they are linked directly with the Library itself.\n\n   6. As an exception to the Sections above, you may also combine or link a \"work that uses the Library\" with the Library to produce a work containing portions of the Library, and distribute that work under terms of your choice, provided that the terms permit modification of the work for the customer's own use and reverse engineering for debugging such modifications.\n\n   You must give prominent notice with each copy of the work that the Library is used in it and that the Library and its use are covered by this License. You must supply a copy of this License. If the work during execution displays copyright notices, you must include the copyright notice for the Library among them, as well as a reference directing the user to the copy of this License. Also, you must do one of these things:\n\n      a) Accompany the work with the complete corresponding machine-readable source code for the Library including whatever changes were used in the work (which must be distributed under Sections 1 and 2 above); and, if the work is an executable linked with the Library, with the complete machine-readable \"work that uses the Library\", as object code and/or source code, so that the user can modify the Library and then relink to produce a modified executable containing the modified Library. (It is understood that the user who changes the contents of definitions files in the Library will not necessarily be able to recompile the application to use the modified definitions.)\n\n      b) Use a suitable shared library mechanism for linking with the Library. A suitable mechanism is one that (1) uses at run time a copy of the library already present on the user's computer system, rather than copying library functions into the executable, and (2) will operate properly with a modified version of the library, if the user installs one, as long as the modified version is interface-compatible with the version that the work was made with.\n\n      c) Accompany the work with a written offer, valid for at least three years, to give the same user the materials specified in Subsection 6a, above, for a charge no more than the cost of performing this distribution.\n\n      d) If distribution of the work is made by offering access to copy from a designated place, offer equivalent access to copy the above specified materials from the same place.\n\n      e) Verify that the user has already received a copy of these materials or that you have already sent this user a copy.\n\n   For an executable, the required form of the \"work that uses the Library\" must include any data and utility programs needed for reproducing the executable from it. However, as a special exception, the materials to be distributed need not include anything that is normally distributed (in either source or binary form) with the major components (compiler, kernel, and so on) of the operating system on which the executable runs, unless that component itself accompanies the executable.\n\n   It may happen that this requirement contradicts the license restrictions of other proprietary libraries that do not normally accompany the operating system. Such a contradiction means you cannot use both them and the Library together in an executable that you distribute.\n\n   7. You may place library facilities that are a work based on the Library side-by-side in a single library together with other library facilities not covered by this License, and distribute such a combined library, provided that the separate distribution of the work based on the Library and of the other library facilities is otherwise permitted, and provided that you do these two things:\n\n      a) Accompany the combined library with a copy of the same work based on the Library, uncombined with any other library facilities. This must be distributed under the terms of the Sections above.\n\n      b) Give prominent notice with the combined library of the fact that part of it is a work based on the Library, and explaining where to find the accompanying uncombined form of the same work.\n\n   8. You may not copy, modify, sublicense, link with, or distribute the Library except as expressly provided under this License. Any attempt otherwise to copy, modify, sublicense, link with, or distribute the Library is void, and will automatically terminate your rights under this License. However, parties who have received copies, or rights, from you under this License will not have their licenses terminated so long as such parties remain in full compliance.\n\n   9. You are not required to accept this License, since you have not signed it. However, nothing else grants you permission to modify or distribute the Library or its derivative works. These actions are prohibited by law if you do not accept this License. Therefore, by modifying or distributing the Library (or any work based on the Library), you indicate your acceptance of this License to do so, and all its terms and conditions for copying, distributing or modifying the Library or works based on it.\n\n   10. Each time you redistribute the Library (or any work based on the Library), the recipient automatically receives a license from the original licensor to copy, distribute, link with or modify the Library subject to these terms and conditions. You may not impose any further restrictions on the recipients' exercise of the rights granted herein. You are not responsible for enforcing compliance by third parties with this License.\n\n   11. If, as a consequence of a court judgment or allegation of patent infringement or for any other reason (not limited to patent issues), conditions are imposed on you (whether by court order, agreement or otherwise) that contradict the conditions of this License, they do not excuse you from the conditions of this License. If you cannot distribute so as to satisfy simultaneously your obligations under this License and any other pertinent obligations, then as a consequence you may not distribute the Library at all. For example, if a patent license would not permit royalty-free redistribution of the Library by all those who receive copies directly or indirectly through you, then the only way you could satisfy both it and this License would be to refrain entirely from distribution of the Library.\n\n   If any portion of this section is held invalid or unenforceable under any particular circumstance, the balance of the section is intended to apply, and the section as a whole is intended to apply in other circumstances.\n\n   It is not the purpose of this section to induce you to infringe any patents or other property right claims or to contest validity of any such claims; this section has the sole purpose of protecting the integrity of the free software distribution system which is implemented by public license practices. Many people have made generous contributions to the wide range of software distributed through that system in reliance on consistent application of that system; it is up to the author/donor to decide if he or she is willing to distribute software through any other system and a licensee cannot impose that choice.\n\n   This section is intended to make thoroughly clear what is believed to be a consequence of the rest of this License.\n\n   12. If the distribution and/or use of the Library is restricted in certain countries either by patents or by copyrighted interfaces, the original copyright holder who places the Library under this License may add an explicit geographical distribution limitation excluding those countries, so that distribution is permitted only in or among countries not thus excluded. In such case, this License incorporates the limitation as if written in the body of this License.\n\n   13. The Free Software Foundation may publish revised and/or new versions of the Lesser General Public License from time to time. Such new versions will be similar in spirit to the present version, but may differ in detail to address new problems or concerns.\n\n   Each version is given a distinguishing version number. If the Library specifies a version number of this License which applies to it and \"any later version\", you have the option of following the terms and conditions either of that version or of any later version published by the Free Software Foundation. If the Library does not specify a license version number, you may choose any version ever published by the Free Software Foundation.\n\n   14. If you wish to incorporate parts of the Library into other free programs whose distribution conditions are incompatible with these, write to the author to ask for permission. For software which is copyrighted by the Free Software Foundation, write to the Free Software Foundation; we sometimes make exceptions for this. Our decision will be guided by the two goals of preserving the free status of all derivatives of our free software and of promoting the sharing and reuse of software generally.\n\n   NO WARRANTY\n\n   15. BECAUSE THE LIBRARY IS LICENSED FREE OF CHARGE, THERE IS NO WARRANTY FOR THE LIBRARY, TO THE EXTENT PERMITTED BY APPLICABLE LAW. EXCEPT WHEN OTHERWISE STATED IN WRITING THE COPYRIGHT HOLDERS AND/OR OTHER PARTIES PROVIDE THE LIBRARY \"AS IS\" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. THE ENTIRE RISK AS TO THE QUALITY AND PERFORMANCE OF THE LIBRARY IS WITH YOU. SHOULD THE LIBRARY PROVE DEFECTIVE, YOU ASSUME THE COST OF ALL NECESSARY SERVICING, REPAIR OR CORRECTION.\n\n   16. IN NO EVENT UNLESS REQUIRED BY APPLICABLE LAW OR AGREED TO IN WRITING WILL ANY COPYRIGHT HOLDER, OR ANY OTHER PARTY WHO MAY MODIFY AND/OR REDISTRIBUTE THE LIBRARY AS PERMITTED ABOVE, BE LIABLE TO YOU FOR DAMAGES, INCLUDING ANY GENERAL, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES ARISING OUT OF THE USE OR INABILITY TO USE THE LIBRARY (INCLUDING BUT NOT LIMITED TO LOSS OF DATA OR DATA BEING RENDERED INACCURATE OR LOSSES SUSTAINED BY YOU OR THIRD PARTIES OR A FAILURE OF THE LIBRARY TO OPERATE WITH ANY OTHER SOFTWARE), EVEN IF SUCH HOLDER OR OTHER PARTY HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES. END OF TERMS AND CONDITIONS\n\nHow to Apply These Terms to Your New Libraries\n\nIf you develop a new library, and you want it to be of the greatest possible use to the public, we recommend making it free software that everyone can redistribute and change. You can do so by permitting redistribution under these terms (or, alternatively, under the terms of the ordinary General Public License).\n\nTo apply these terms, attach the following notices to the library. It is safest to attach them to the start of each source file to most effectively convey the exclusion of warranty; and each file should have at least the \"copyright\" line and a pointer to where the full notice is found.\n\n<one line to give the library's name and an idea of what it does.>\n\nCopyright (C) <year> <name of author>\n\nThis library is free software; you can redistribute it and/or modify it under the terms of the GNU Lesser General Public License as published by the Free Software Foundation; either version 2.1 of the License, or (at your option) any later version.\n\nThis library is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU Lesser General Public License for more details.\n\nYou should have received a copy of the GNU Lesser General Public License along with this library; if not, write to the Free Software Foundation, Inc., 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA\n\nAlso add information on how to contact you by electronic and paper mail.\n\nYou should also get your employer (if you work as a programmer) or your school, if any, to sign a \"copyright disclaimer\" for the library, if necessary. Here is a sample; alter the names:\n\nYoyodyne, Inc., hereby disclaims all copyright interest in\n\nthe library `Frob' (a library for tweaking knobs) written\n\nby James Random Hacker.\n\n< signature of Ty Coon > , 1 April 1990\n\nTy Coon, President of Vice\n\nThat's all there is to it!",
    "name" : "GNU Library General Public License v2.1 or later"
  }, {
    "licenseId" : "LicenseRef-See-doc.OTHER",
    "extractedText" : "License by Nomos.",
    "name" : "See-doc.OTHER"
  }, {
    "licenseId" : "LicenseRef-WebM",
    "extractedText" : "Software License\nCopyright (c) 2010, Google Inc. All rights reserved.\n\nRedistribution and use in source and binary forms, with or without modification, are permitted provided that the following conditions are met:\n\nRedistributions of source code must retain the above copyright notice, this list of conditions and the following disclaimer.\n\nRedistributions in binary form must reproduce the above copyright notice, this list of conditions and the following disclaimer in the documentation and/or other materials provided with the distribution.\n\nNeither the name of Google nor the names of its contributors may be used to endorse or promote products derived from this software without specific prior written permission.\n\nTHIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS \"AS IS\" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.",
    "name" : "WebM Software License"
  }, {
    "licenseId" : "LicenseRef-scancode-autoconf-simple-exception-2.0",
    "extractedText" : "License by Scancode.",
    "name" : "Autoconf simple exception to GPL-2.0"
  }, {
    "licenseId" : "LicenseRef-scancode-unknown-license-reference",
    "extractedText" : "License by Scancode.",
    "name" : "Unknown License file reference"
  } ],
  "documentNamespace" : "http://fossy.osadl.org/repo/SPDX2TV_protobuf-c-1.5.0.tar.gz_1731596992.spdx",
  "packages" : [ {
    "SPDXID" : "SPDXRef-upload2276",
    "checksums" : [ {
      "algorithm" : "MD5",
      "checksumValue" : "eb0b3a395aa35fe30b46c366cf2e5eb5"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "c9c478c372d26b7aa25c47f2a57c7aea17fd5d3b"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "d4cb022d55f49796959b07a9d83040822e39129bc0eb28f4e8301da17d758f62"
    } ],
    "copyrightText" : "NOASSERTION",
    "downloadLocation" : "https://github.com/protobuf-c/protobuf-c/archive/refs/tags/v1.5.0.tar.gz",
    "externalRefs" : [ {
      "referenceCategory" : "PACKAGE-MANAGER",
      "referenceLocator" : "pkg:github/protobuf-c/protobuf-c@v1.5.0",
      "referenceType" : "purl"
    } ],
    "filesAnalyzed" : true,
    "licenseComments" : "licenseInfoInFile determined by Scanners:\n - nomos (\"4.4.0.51\".1e52cb)\n - monk (\"4.4.0.51\".1e52cb)\n - ojo (\"4.4.0.51\".1e52cb)\n- scancode (\"4.4.0.51\".1e52cb)",
    "licenseConcluded" : "NOASSERTION",
    "licenseDeclared" : "LicenseRef-BSD-2-Clause-800d6ee23ee356e5bc046d49bf4686b4",
    "licenseInfoFromFiles" : [ "NOASSERTION" ],
    "name" : "protobuf-c-1.5.0.tar.gz",
    "packageFileName" : "protobuf-c-1.5.0.tar.gz",
    "packageVerificationCode" : {
      "packageVerificationCodeValue" : "1e3de8674d2fffcfd03673128393b5c7005c2a21"
    }
  } ],
  "files" : [ {
    "SPDXID" : "SPDXRef-item9851360",
    "checksums" : [ {
      "algorithm" : "MD5",
      "checksumValue" : "d11077c6a2b5d2e64b9f32b61a9b78ba"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "c124a76939823ca74ded035dbe70a8534429dd33"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "ad28bbf89340b86d15aad1ff62c4f4590025d836415307dc66cf0338235cc2f4"
    } ],
    "copyrightText" : "Copyright (c) 2008-2023, Dave Benson and the protobuf-c authors. All rights reserved.",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/LICENSE",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "LicenseRef-BSD-2-Clause-Views", "LicenseRef-BSD-2-Clause" ]
  }, {
    "SPDXID" : "SPDXRef-item9851363",
    "checksums" : [ {
      "algorithm" : "MD5",
      "checksumValue" : "7a4aecdb5be1d7a7a43fbb434093d261"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "64e2f564d5cb79e53abc1f1c81fe8fc3b74d5c95"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "1ea6983865737fca4c2fc9fc9c865552f2d975b5d137da6ffa6fd21a069cec99"
    } ],
    "copyrightText" : "NOASSERTION",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/t/issue204/issue204.proto",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "NOASSERTION" ]
  }, {
    "SPDXID" : "SPDXRef-item9851364",
    "checksums" : [ {
      "algorithm" : "SHA256",
      "checksumValue" : "943f56bc13e6fb3d79126b503f97d514550a119408c83caab9e1bb1fb55ec5b5"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "c913919a0dd771898bc0bcc23fb5b358"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "4c3ca4a349d8823cc9338f8994fe9cfb6d4df11f"
    } ],
    "copyrightText" : "NOASSERTION",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/t/issue204/issue204.c",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "NOASSERTION" ]
  }, {
    "SPDXID" : "SPDXRef-item9851365",
    "checksums" : [ {
      "algorithm" : "SHA256",
      "checksumValue" : "e436d291bf607f0666f8c7136d6c8b21103533187e92c5861e363c8a07884e67"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "209aaf56ce33140cdf0177014577b94a"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "0bd284385eb54c8ebbc03cd44d38e90129d3fc64"
    } ],
    "copyrightText" : "NOASSERTION",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/t/issue204/.gitignore",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "NOASSERTION" ]
  }, {
    "SPDXID" : "SPDXRef-item9851366",
    "checksums" : [ {
      "algorithm" : "MD5",
      "checksumValue" : "804046a5957dbba520c4c38ee3b6d150"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "544c569c672375cd7a22df4dddf34f0cbd636b9f"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "2762da70fef7f8d0054347342e20ae5159810211f10ab86d2688cb1f012600bb"
    } ],
    "copyrightText" : "NOASSERTION",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/t/test-optimized.proto",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "NOASSERTION" ]
  }, {
    "SPDXID" : "SPDXRef-item9851368",
    "checksums" : [ {
      "algorithm" : "SHA1",
      "checksumValue" : "bb75a7d10e386f3fcac5faeeb745f459cafbe784"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "36dac19b93d5d5177ab1915881a16814f3a9b3af5882b8cd2295f6040e1f9ac9"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "bb901eb140ec29aae2a7c31a112c61e4"
    } ],
    "copyrightText" : "NOASSERTION",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/t/issue220/issue220.c",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "NOASSERTION" ]
  }, {
    "SPDXID" : "SPDXRef-item9851369",
    "checksums" : [ {
      "algorithm" : "SHA256",
      "checksumValue" : "672fd4a01547c879affea55f4c8a8adde324b26b2c2371561bb7a4eef8ef27d2"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "c1d3ab66b80f52effd493d4e3da568b2"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "84a8f3ff2bf1bcea063debeb9bca1e497df7fba9"
    } ],
    "copyrightText" : "NOASSERTION",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/t/issue220/issue220.proto",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "NOASSERTION" ]
  }, {
    "SPDXID" : "SPDXRef-item9851370",
    "checksums" : [ {
      "algorithm" : "SHA256",
      "checksumValue" : "a2900d4388c6f41f2903d3d2f1b0083fd2e1b07a0fb859128055226328a46494"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "816cb9e4af948507dd7ed87310764a49"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "4ce8e6a8f5d4380fb9c8ec0a37bcc41e6d2b55b0"
    } ],
    "copyrightText" : "NOASSERTION",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/t/issue220/.gitignore",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "NOASSERTION" ]
  }, {
    "SPDXID" : "SPDXRef-item9851372",
    "checksums" : [ {
      "algorithm" : "SHA1",
      "checksumValue" : "14a8ad7fc3c22a2078232004609b7a04d6c58a02"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "be12ac7879184b22aac9ae14a6acdf37"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "66fbffa6a566f53939d04b7d4f250f11e8f540f4b9367d8ba881e11e03daee6b"
    } ],
    "copyrightText" : "NOASSERTION",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/t/generated-code/test-generated-code.c",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "NOASSERTION" ]
  }, {
    "SPDXID" : "SPDXRef-item9851373",
    "checksums" : [ {
      "algorithm" : "MD5",
      "checksumValue" : "74a0c8399af84027fa6d986f4b838eb1"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "92c3091ea33557eeae510aac7ff22bb4c5d042aa"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "c0b583229fefa38c9f912018c5f43742599ad4a56f24040d3f755b68d446e861"
    } ],
    "copyrightText" : "NOASSERTION",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/t/test-full.proto",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "NOASSERTION" ]
  }, {
    "SPDXID" : "SPDXRef-item9851374",
    "checksums" : [ {
      "algorithm" : "SHA256",
      "checksumValue" : "092debf13d184fce22fa1d6c46bb3bb620485003f4b217d8df990a1ee514ea63"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "a289bb06128f16fdd503dc99fa904ab6"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "ec8a82ceb931d5462ba288db875a0c72336f1058"
    } ],
    "copyrightText" : "NOASSERTION",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/t/test.proto",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "NOASSERTION" ]
  }, {
    "SPDXID" : "SPDXRef-item9851376",
    "checksums" : [ {
      "algorithm" : "SHA1",
      "checksumValue" : "36b4287c97180cd862881ea55bdc78b5d5217b7c"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "59c02cf83ddb27cd0832b3c653fc784ed050f23db3e457e6eb193765e88b3184"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "595df26523428b3597daa00eb5422371"
    } ],
    "copyrightText" : "NOASSERTION",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/t/issue251/issue251.c",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "NOASSERTION" ]
  }, {
    "SPDXID" : "SPDXRef-item9851377",
    "checksums" : [ {
      "algorithm" : "SHA256",
      "checksumValue" : "dbe517a54094074742f4357d3f45b14f5df7ca0b386e733567768db4f36e5488"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "4643db36ca35e3049ea57ac21d7177ff05c406c3"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "2873d66c3e63e95780036f42595ffb35"
    } ],
    "copyrightText" : "NOASSERTION",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/t/issue251/issue251.proto",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "NOASSERTION" ]
  }, {
    "SPDXID" : "SPDXRef-item9851378",
    "checksums" : [ {
      "algorithm" : "SHA256",
      "checksumValue" : "bf4eab645cf51d7a0b5c969e39206390ffbd3a95e0dd177d87978403a2def337"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "eae6eacae426fb027fff9bbcd4a588f7"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "f059bc7aaeb3f1a3b6f27953649c076fb7ce367a"
    } ],
    "copyrightText" : "NOASSERTION",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/t/issue251/.gitignore",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "NOASSERTION" ]
  }, {
    "SPDXID" : "SPDXRef-item9851380",
    "checksums" : [ {
      "algorithm" : "SHA256",
      "checksumValue" : "cc220776174ee0ec1c229ac452dfe0da12a966d947a73562c1792c027bf429de"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "251d3dbda99a65e21a1d63a52d735d9c"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "75324b2c84e241d6a24fd664b113775cc7bd813a"
    } ],
    "copyrightText" : "NOASSERTION",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/t/issue330/issue330.proto",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "NOASSERTION" ]
  }, {
    "SPDXID" : "SPDXRef-item9851381",
    "checksums" : [ {
      "algorithm" : "MD5",
      "checksumValue" : "5ba7d9ca97d6b4276824e42e96ef3d52"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "ef32aa8bb0a6ac2e277525a3fb81166fb30745c3"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "4f170ceda081b315d2a24d36fd2e53aa0fc4eabfaceba0864cc79cef0a0ebbfc"
    } ],
    "copyrightText" : "NOASSERTION",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/t/issue330/issue330.c",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "NOASSERTION" ]
  }, {
    "SPDXID" : "SPDXRef-item9851382",
    "checksums" : [ {
      "algorithm" : "SHA256",
      "checksumValue" : "3cc5baad3b706e17ca8e6413df5c36c610b2a2b7ca9632a324555664dba6d1c4"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "2a55836a6aa630b34ec64a1c92e4cd72"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "5a4889ce3bc002f895ef962ae6ce7affffc1335f"
    } ],
    "copyrightText" : "NOASSERTION",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/t/issue330/.gitignore",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "NOASSERTION" ]
  }, {
    "SPDXID" : "SPDXRef-item9851383",
    "checksums" : [ {
      "algorithm" : "SHA256",
      "checksumValue" : "48caaea6afc962b77fbb4e6c756c07f2011ebe625867cbc643b3fadbb19dfaab"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "6844f2bae7000d74ceabe91703714f0e"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "826e727370f158af82091b4498350703a0ee80b5"
    } ],
    "copyrightText" : "NOASSERTION",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/t/README",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "NOASSERTION" ]
  }, {
    "SPDXID" : "SPDXRef-item9851385",
    "checksums" : [ {
      "algorithm" : "SHA1",
      "checksumValue" : "7294665068c87443fd2b5b9a2726e1df647b4102"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "f60c9f5d32c7bb2e23e9e2b6d8a70c8511d545921a8e707f59487e27a079e1ef"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "477a51170a80a9e4dcb035db65fbc79a"
    } ],
    "copyrightText" : "NOASSERTION",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/t/generated-code2/cxx-generate-packed-data.cc",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "NOASSERTION" ]
  }, {
    "SPDXID" : "SPDXRef-item9851386",
    "checksums" : [ {
      "algorithm" : "SHA1",
      "checksumValue" : "70d99be9db11a20d33832633c57fdb876f558cb1"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "c84a24addcb56e4a37c34af9d5a51fa85ea289e2d1660ba77a8783beb9b94a64"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "22e150cf323a566e8833cfb24e6d2de3"
    } ],
    "copyrightText" : "NOASSERTION",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/t/generated-code2/test-generated-code2.c",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "NOASSERTION" ]
  }, {
    "SPDXID" : "SPDXRef-item9851387",
    "checksums" : [ {
      "algorithm" : "SHA256",
      "checksumValue" : "ed7d7546a089ee134178e72fc0e1ef7f382cd419b07269a446b3665807c49e84"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "660921e38d23b8e28a02f75c2affdf4e8ba5c79a"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "be0c4070adc44b45d805027548822a9e"
    } ],
    "copyrightText" : "NOASSERTION",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/t/generated-code2/common-test-arrays.h",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "NOASSERTION" ]
  }, {
    "SPDXID" : "SPDXRef-item9851389",
    "checksums" : [ {
      "algorithm" : "SHA1",
      "checksumValue" : "a7c17f2eee69b7c1c3f8deb795a732654519ce84"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "1eaf3d39d71f4a24489ffbf7fbce517639765c89cd08b8a4fd2beedfb05b2c95"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "9fccc61bb25633b2b53382c681cbc852"
    } ],
    "copyrightText" : "NOASSERTION",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/t/issue375/issue375.proto",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "NOASSERTION" ]
  }, {
    "SPDXID" : "SPDXRef-item9851390",
    "checksums" : [ {
      "algorithm" : "SHA256",
      "checksumValue" : "144d0550db581639f016e3515d78fdc0c7c1d43db39da4085994f43452fd08e0"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "dcebbdb5012a38a165aecfd6a02899d3"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "eb8b00a1090a758dd946a9544320cb25b2d958a9"
    } ],
    "copyrightText" : "NOASSERTION",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/t/issue375/issue375.c",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "NOASSERTION" ]
  }, {
    "SPDXID" : "SPDXRef-item9851391",
    "checksums" : [ {
      "algorithm" : "SHA1",
      "checksumValue" : "ff7e9bbac755fce2ca0e1a40df8144b8c83fcc05"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "bbe748efef847852c182d2fb294d67236057755d54872925f4301be655b2cf70"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "dd1490299285ba959beda37173b9b7cf"
    } ],
    "copyrightText" : "NOASSERTION",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/t/issue375/.gitignore",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "NOASSERTION" ]
  }, {
    "SPDXID" : "SPDXRef-item9851393",
    "checksums" : [ {
      "algorithm" : "SHA256",
      "checksumValue" : "810225d40ce42fd7c873af543e41e69f903d0b9c0bc6861d79a181fcfce76273"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "e5cf728a8231289b18acd86a7e52c8c8"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "f112725254c4768fda8f636aed70e4e58659bfe9"
    } ],
    "copyrightText" : "NOASSERTION",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/t/issue440/issue440.proto",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "NOASSERTION" ]
  }, {
    "SPDXID" : "SPDXRef-item9851394",
    "checksums" : [ {
      "algorithm" : "SHA1",
      "checksumValue" : "c12d737d8a61f585d5ee72e0e1e1106536ee634a"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "c0c702444450c5710aec0df2b577aadf29f1138ef15a38fd44c87fe77451eaec"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "d68d1d3a8adbe1a7725149523ea65640"
    } ],
    "copyrightText" : "NOASSERTION",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/t/issue440/issue440.c",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "NOASSERTION" ]
  }, {
    "SPDXID" : "SPDXRef-item9851395",
    "checksums" : [ {
      "algorithm" : "SHA256",
      "checksumValue" : "e265a0eb417763368dfb0a2532918129b4c89a186c3d11154328c3324804e2d2"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "f9d89f82a29a5d4c06ab164f62e999b3"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "7f1e208669916a6de39bb0e845f014645539d8f0"
    } ],
    "copyrightText" : "NOASSERTION",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/t/issue440/.gitignore",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "NOASSERTION" ]
  }, {
    "SPDXID" : "SPDXRef-item9851397",
    "checksums" : [ {
      "algorithm" : "MD5",
      "checksumValue" : "293dec1c9b221965a4f1257a187b6624"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "5e86be2203486dd2cfba011f3e0ef889f5acec8a18b40566a4c8ca7979557604"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "12cd493d56c0e707d43da9e44e6ff6733ff611f8"
    } ],
    "copyrightText" : "Copyright (c) 2014, The protobuf-c authors. All rights reserved.",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/t/version/version.c",
    "licenseConcluded" : "LicenseRef-BSD-2-Clause-64d547dda59824f98aba23eb314af065",
    "licenseInfoInFiles" : [ "LicenseRef-BSD-2-Clause" ]
  }, {
    "SPDXID" : "SPDXRef-item9851398",
    "checksums" : [ {
      "algorithm" : "SHA1",
      "checksumValue" : "699519ef346b227021be828ea48a6c04835f2357"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "e5a6eae5363f2c7e949055f356878aef3b42405e16df2e80860b04deb2a25dcf"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "bbd233f63f299ade329683b48a53c03d"
    } ],
    "copyrightText" : "NOASSERTION",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/t/test-proto3.proto",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "NOASSERTION" ]
  }, {
    "SPDXID" : "SPDXRef-item9851400",
    "checksums" : [ {
      "algorithm" : "MD5",
      "checksumValue" : "927b073efbbbe88e554aa073082e24aa"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "e81075a387686733034c26cf8895d51e8b851e46"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "6640018aa0412d028f146fb4674781ce02a472c53931690e1995156d2f7677a2"
    } ],
    "copyrightText" : "NOASSERTION",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/t/issue389/issue389.proto",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "NOASSERTION" ]
  }, {
    "SPDXID" : "SPDXRef-item9851401",
    "checksums" : [ {
      "algorithm" : "SHA1",
      "checksumValue" : "04bfc416876dd4ee40208f5fd1920de0f292c80d"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "1a439dc710871d2c7d5e5546639ba3369a0e84414efa33a6ea217713e8c31cbf"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "d4f8007efda077b62b2a3f68ee4a43cb"
    } ],
    "copyrightText" : "NOASSERTION",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/TODO",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "NOASSERTION" ]
  }, {
    "SPDXID" : "SPDXRef-item9851402",
    "checksums" : [ {
      "algorithm" : "SHA1",
      "checksumValue" : "0be3289992fd4ea21cd5bf1bc40416e57cf49449"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "b74b0f4c408fdcee9258f38f24e2a8b32646b2e3e1f0e124dac21c09d9e182f0"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "5af9bf015768dad0e72f5b202cd7edfd"
    } ],
    "copyrightText" : "NOASSERTION",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/README.md",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "LicenseRef-scancode-unknown-license-reference", "LicenseRef-BSD-2-Clause" ]
  }, {
    "SPDXID" : "SPDXRef-item9851403",
    "checksums" : [ {
      "algorithm" : "SHA256",
      "checksumValue" : "4f1ad692fe0af04a9789329ecdc91a9b5d5c39f7ba9367db1424f27fea83d6ea"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "79ebc3413a4fa64236f5c238253e551d"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "92a9bc4110f2336b180319436c1988a4295706f6"
    } ],
    "copyrightText" : "NOASSERTION",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/configure.ac",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "NOASSERTION" ]
  }, {
    "SPDXID" : "SPDXRef-item9851405",
    "checksums" : [ {
      "algorithm" : "SHA256",
      "checksumValue" : "a1581bad0c6935d2300c9e5b8d2126db3ec94afdd14ea19dd286fd561eb2e68d"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "2db01687c06fef3c26b9a7b76ea62eb5"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "ef87bcf64f5cf3c00df7ea525e5a24daa5181ac2"
    } ],
    "copyrightText" : "NOASSERTION",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/build-cmake/Config.cmake.in",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "NOASSERTION" ]
  }, {
    "SPDXID" : "SPDXRef-item9851406",
    "checksums" : [ {
      "algorithm" : "SHA256",
      "checksumValue" : "0dbdf23a23d083b9d22f0cbcd97f6691ebc11097a553afafe63a3b53fc52669e"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "c63f4c62e49f9d1525dc6a47a0e0c3e9247bea3b"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "8bc47aad2ec7728ba82b4e973c9d3497"
    } ],
    "copyrightText" : "NOASSERTION",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/build-cmake/CMakeLists.txt",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "NOASSERTION" ]
  }, {
    "SPDXID" : "SPDXRef-item9851407",
    "checksums" : [ {
      "algorithm" : "SHA1",
      "checksumValue" : "904650f783b2e54977c8645f58c7705cbfc7df0b"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "37063f8deb0bca25702501ecd15a595d877f3cbc9353ec5246331d9f5a95a040"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "f202492fe0e4dad47b959864dae078de"
    } ],
    "copyrightText" : "NOASSERTION",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/build-cmake/.gitignore",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "NOASSERTION" ]
  }, {
    "SPDXID" : "SPDXRef-item9851408",
    "checksums" : [ {
      "algorithm" : "MD5",
      "checksumValue" : "553136a1c26fa7446b3eccdd6fc43a94"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "f716e387b806061e7c5f480ee4e52ed1337e9c1a"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "e90bb0a6b23f44cbc366d8ba8edf49a56227171fa31c3665285f1bdc2638b068"
    } ],
    "copyrightText" : "NOASSERTION",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/CONTRIBUTING.md",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "LicenseRef-scancode-unknown-license-reference", "LicenseRef-BSD-2-Clause" ]
  }, {
    "SPDXID" : "SPDXRef-item9851410",
    "checksums" : [ {
      "algorithm" : "MD5",
      "checksumValue" : "96f84d404ffc13ed100355543cc28138"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "0b33d11a5f8601b62d4fc9ea1c2e323a0f269d6cbe3fcea3582318e59966eb1f"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "3518b74cf672f487e71b86792734f121db23d1ce"
    } ],
    "copyrightText" : "Copyright 2008 Google Inc. All rights reserved. http://code.google.com/p/protobuf/\nCopyright (c) 2008-2013, Dave Benson. All rights reserved.",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/protoc-c/c_service.cc",
    "licenseConcluded" : "(LicenseRef-BSD-3-Clause-5d8fbbf3d2c067f361b4e5e9a9352bfc AND LicenseRef-BSD-2-Clause-64d547dda59824f98aba23eb314af065)",
    "licenseInfoInFiles" : [ "LicenseRef-WebM", "LicenseRef-BSD-2-Clause", "LicenseRef-BSD-3-Clause" ]
  }, {
    "SPDXID" : "SPDXRef-item9851411",
    "checksums" : [ {
      "algorithm" : "MD5",
      "checksumValue" : "8cfbfa76473e2e7cd8b81e24cdbfd7c7"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "5d0458388aa6cb355c5524be7eb3e777d70d74d5"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "4427572cc07896dd46ce13dabd0831e847e4d79c70d9dd87b476140dd0874f9a"
    } ],
    "copyrightText" : "Copyright 2008 Google Inc. All rights reserved. http://code.google.com/p/protobuf/\nCopyright (c) 2008-2013, Dave Benson. All rights reserved.",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/protoc-c/c_helpers.cc",
    "licenseConcluded" : "(LicenseRef-BSD-3-Clause-5d8fbbf3d2c067f361b4e5e9a9352bfc AND LicenseRef-BSD-2-Clause-64d547dda59824f98aba23eb314af065)",
    "licenseInfoInFiles" : [ "LicenseRef-WebM", "LicenseRef-BSD-2-Clause", "LicenseRef-BSD-3-Clause" ]
  }, {
    "SPDXID" : "SPDXRef-item9851412",
    "checksums" : [ {
      "algorithm" : "MD5",
      "checksumValue" : "340b1bde1a02ed9731bd218373ee7a0b"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "099a6249200b948f3cb858bbf4c2a24b23f85967"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "ce4e10ec341af60456d69ddd5298ec082cd1993cf0ee51a117fbcbd299a03275"
    } ],
    "copyrightText" : "Copyright 2008 Google Inc. All rights reserved. http://code.google.com/p/protobuf/\nCopyright (c) 2008-2013, Dave Benson. All rights reserved.",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/protoc-c/c_enum_field.cc",
    "licenseConcluded" : "(LicenseRef-BSD-3-Clause-5d8fbbf3d2c067f361b4e5e9a9352bfc AND LicenseRef-BSD-2-Clause-64d547dda59824f98aba23eb314af065)",
    "licenseInfoInFiles" : [ "LicenseRef-WebM", "LicenseRef-BSD-2-Clause", "LicenseRef-BSD-3-Clause" ]
  }, {
    "SPDXID" : "SPDXRef-item9851413",
    "checksums" : [ {
      "algorithm" : "SHA1",
      "checksumValue" : "e303c20528d032d40fe58de521f6f338939a428d"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "298502d197bf7f337798858f82608eb5a2054f2881a8b3c7f37d72574123584c"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "391d8d6bded75ed1c8c14d944a99bc9c"
    } ],
    "copyrightText" : "Copyright 2008 Google Inc. All rights reserved. http://code.google.com/p/protobuf/\nCopyright (c) 2008-2013, Dave Benson. All rights reserved.",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/protoc-c/c_field.cc",
    "licenseConcluded" : "(LicenseRef-BSD-3-Clause-5d8fbbf3d2c067f361b4e5e9a9352bfc AND LicenseRef-BSD-2-Clause-64d547dda59824f98aba23eb314af065)",
    "licenseInfoInFiles" : [ "LicenseRef-WebM", "LicenseRef-BSD-2-Clause", "LicenseRef-BSD-3-Clause" ]
  }, {
    "SPDXID" : "SPDXRef-item9851414",
    "checksums" : [ {
      "algorithm" : "SHA256",
      "checksumValue" : "b9f5c80eff787318d9f7975cf9e2559ed21c8647caad389ac6f308d9ef354bba"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "c22e8784765a158acfda46575fbadbe9"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "b74463f045293ec9cfa92ebcad5342fb22523a62"
    } ],
    "copyrightText" : "Copyright 2008 Google Inc. All rights reserved. http://code.google.com/p/protobuf/\nCopyright (c) 2008-2013, Dave Benson. All rights reserved.",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/protoc-c/c_enum_field.h",
    "licenseConcluded" : "(LicenseRef-BSD-3-Clause-5d8fbbf3d2c067f361b4e5e9a9352bfc AND LicenseRef-BSD-2-Clause-64d547dda59824f98aba23eb314af065)",
    "licenseInfoInFiles" : [ "LicenseRef-WebM", "LicenseRef-BSD-2-Clause", "LicenseRef-BSD-3-Clause" ]
  }, {
    "SPDXID" : "SPDXRef-item9851415",
    "checksums" : [ {
      "algorithm" : "SHA1",
      "checksumValue" : "d4f92eca2cd43a2e43d90538b902f749173351ce"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "014b8ada60a117fc7ce45d6816edb3feed6a6b842f84dd6c55ca4f5a870a53de"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "425191f096cdcebca8c2bbf92a871256"
    } ],
    "copyrightText" : "Copyright 2008 Google Inc. All rights reserved. http://code.google.com/p/protobuf/\nCopyright (c) 2008-2013, Dave Benson. All rights reserved.",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/protoc-c/c_field.h",
    "licenseConcluded" : "(LicenseRef-BSD-3-Clause-5d8fbbf3d2c067f361b4e5e9a9352bfc AND LicenseRef-BSD-2-Clause-64d547dda59824f98aba23eb314af065)",
    "licenseInfoInFiles" : [ "LicenseRef-WebM", "LicenseRef-BSD-2-Clause", "LicenseRef-BSD-3-Clause" ]
  }, {
    "SPDXID" : "SPDXRef-item9851416",
    "checksums" : [ {
      "algorithm" : "SHA1",
      "checksumValue" : "993fa10eca8d1b57467a65246a5dfbb7cf9bb98f"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "22f56db63df7d987737fe992dcbb596f"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "65f4c4c26cbdf1ab42d0d53b169db78facb56785daf6875b773e2db92bc2493e"
    } ],
    "copyrightText" : "Copyright 2008 Google Inc. All rights reserved. http://code.google.com/p/protobuf/\nCopyright (c) 2008-2013, Dave Benson. All rights reserved.",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/protoc-c/c_string_field.cc",
    "licenseConcluded" : "(LicenseRef-BSD-3-Clause-5d8fbbf3d2c067f361b4e5e9a9352bfc AND LicenseRef-BSD-2-Clause-64d547dda59824f98aba23eb314af065)",
    "licenseInfoInFiles" : [ "LicenseRef-WebM", "LicenseRef-BSD-2-Clause", "LicenseRef-BSD-3-Clause" ]
  }, {
    "SPDXID" : "SPDXRef-item9851417",
    "checksums" : [ {
      "algorithm" : "SHA256",
      "checksumValue" : "72f702e76e2c845570d6dadb60fa01f96bf7a6fb11e199026453e93f5f12983e"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "f30d685f18b258dd3a219e0e8c87ba2e"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "2d3aa0f07bdc57281415da0fa6c116ba05dc5a14"
    } ],
    "copyrightText" : "Copyright 2008 Google Inc. All rights reserved. http://code.google.com/p/protobuf/\nCopyright (c) 2008-2013, Dave Benson. All rights reserved.",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/protoc-c/c_message.cc",
    "licenseConcluded" : "(LicenseRef-BSD-3-Clause-5d8fbbf3d2c067f361b4e5e9a9352bfc AND LicenseRef-BSD-2-Clause-64d547dda59824f98aba23eb314af065)",
    "licenseInfoInFiles" : [ "LicenseRef-WebM", "LicenseRef-BSD-2-Clause", "LicenseRef-BSD-3-Clause" ]
  }, {
    "SPDXID" : "SPDXRef-item9851418",
    "checksums" : [ {
      "algorithm" : "SHA256",
      "checksumValue" : "3d2fd9610a30a6180469273e6ccf0778bec2e1939d71419f71ba4a92e5d27c7c"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "bd7b6ffcdc68728108fba9672c94d8131c220341"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "a4eefc64f44e80eff0e7e2b73a38ed1a"
    } ],
    "copyrightText" : "Copyright 2008 Google Inc. All rights reserved. http://code.google.com/p/protobuf/\nCopyright (c) 2008-2013, Dave Benson. All rights reserved.",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/protoc-c/c_string_field.h",
    "licenseConcluded" : "(LicenseRef-BSD-3-Clause-5d8fbbf3d2c067f361b4e5e9a9352bfc AND LicenseRef-BSD-2-Clause-64d547dda59824f98aba23eb314af065)",
    "licenseInfoInFiles" : [ "LicenseRef-WebM", "LicenseRef-BSD-2-Clause", "LicenseRef-BSD-3-Clause" ]
  }, {
    "SPDXID" : "SPDXRef-item9851419",
    "checksums" : [ {
      "algorithm" : "MD5",
      "checksumValue" : "156ab67dec92e040ec68c56824df1d5a"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "39dd4d245728c11c3b5666e1046047a0489fcd48062bfcd5d772b9fc8d112d28"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "e832067e6c5222a8b0c27d87913fdecf73146d51"
    } ],
    "copyrightText" : "Copyright 2008 Google Inc. All rights reserved. http://code.google.com/p/protobuf/\nCopyright (c) 2008-2013, Dave Benson. All rights reserved.",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/protoc-c/c_message_field.h",
    "licenseConcluded" : "(LicenseRef-BSD-3-Clause-5d8fbbf3d2c067f361b4e5e9a9352bfc AND LicenseRef-BSD-2-Clause-64d547dda59824f98aba23eb314af065)",
    "licenseInfoInFiles" : [ "LicenseRef-WebM", "LicenseRef-BSD-2-Clause", "LicenseRef-BSD-3-Clause" ]
  }, {
    "SPDXID" : "SPDXRef-item9851420",
    "checksums" : [ {
      "algorithm" : "SHA1",
      "checksumValue" : "bd77ba4d84216d436f26744692481cb20d9ebcf2"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "b8e5078f2648c8a746972b3c0b68bf2f64843be42c07571f50fe5966898fc67b"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "728dbc9565be1cbf324e3f6f7ca9631e"
    } ],
    "copyrightText" : "NOASSERTION",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/protoc-c/main.cc",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "NOASSERTION" ]
  }, {
    "SPDXID" : "SPDXRef-item9851421",
    "checksums" : [ {
      "algorithm" : "SHA1",
      "checksumValue" : "ffcf0fd6d7c3feaa24c075ae86154636efd84ce6"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "a621d6b41d7abda2c1a4606392767e4e52f0ad5a38a5914c5bdeda1781e4cd03"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "a7a9b810022095d41b58235e53c016c4"
    } ],
    "copyrightText" : "Copyright 2008 Google Inc. All rights reserved. http://code.google.com/p/protobuf/\nCopyright (c) 2008-2013, Dave Benson. All rights reserved.",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/protoc-c/c_bytes_field.cc",
    "licenseConcluded" : "(LicenseRef-BSD-3-Clause-5d8fbbf3d2c067f361b4e5e9a9352bfc AND LicenseRef-BSD-2-Clause-64d547dda59824f98aba23eb314af065)",
    "licenseInfoInFiles" : [ "LicenseRef-WebM", "LicenseRef-BSD-2-Clause", "LicenseRef-BSD-3-Clause" ]
  }, {
    "SPDXID" : "SPDXRef-item9851422",
    "checksums" : [ {
      "algorithm" : "MD5",
      "checksumValue" : "8487f7b85a9a5632672e55ab83e43d8f"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "2db73f5e61198148086aad5980bd67fd84af8155"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "2e1761095b98b2b5e1327300f99ec1094c5ba64202adf2b27950e0caeb9fd03f"
    } ],
    "copyrightText" : "Copyright 2008 Google Inc. All rights reserved. http://code.google.com/p/protobuf/\nCopyright (c) 2008-2014, Dave Benson and the protobuf-c authors. All rights reserved.",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/protoc-c/c_file.cc",
    "licenseConcluded" : "(LicenseRef-BSD-3-Clause-5d8fbbf3d2c067f361b4e5e9a9352bfc AND LicenseRef-BSD-2-Clause-64d547dda59824f98aba23eb314af065)",
    "licenseInfoInFiles" : [ "LicenseRef-WebM", "LicenseRef-BSD-2-Clause", "LicenseRef-BSD-3-Clause" ]
  }, {
    "SPDXID" : "SPDXRef-item9851423",
    "checksums" : [ {
      "algorithm" : "SHA256",
      "checksumValue" : "88c2635ea344fbd39e8da6c021167770baa1a80b070ad0fd532595ff133daaaa"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "6735196d9805cf18619cd395269c565a"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "a69636185e96ce68dd69e960fc4bc95becfb4464"
    } ],
    "copyrightText" : "Copyright 2008 Google Inc. All rights reserved. http://code.google.com/p/protobuf/\nCopyright (c) 2008-2013, Dave Benson. All rights reserved.",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/protoc-c/c_extension.h",
    "licenseConcluded" : "(LicenseRef-BSD-3-Clause-5d8fbbf3d2c067f361b4e5e9a9352bfc AND LicenseRef-BSD-2-Clause-64d547dda59824f98aba23eb314af065)",
    "licenseInfoInFiles" : [ "LicenseRef-WebM", "LicenseRef-BSD-2-Clause", "LicenseRef-BSD-3-Clause" ]
  }, {
    "SPDXID" : "SPDXRef-item9851424",
    "checksums" : [ {
      "algorithm" : "MD5",
      "checksumValue" : "0e7061aa8a873828a09c14a2f8d79edc"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "e0f879c9f541a7d1b98942d4de283cbc2d36a674"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "783fc4736db0aed147c2c80a64c2161ac5ec820854e8fca65d589493553abc61"
    } ],
    "copyrightText" : "Copyright 2008 Google Inc. All rights reserved. http://code.google.com/p/protobuf/\nCopyright (c) 2008-2013, Dave Benson. All rights reserved.",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/protoc-c/c_service.h",
    "licenseConcluded" : "(LicenseRef-BSD-3-Clause-5d8fbbf3d2c067f361b4e5e9a9352bfc AND LicenseRef-BSD-2-Clause-64d547dda59824f98aba23eb314af065)",
    "licenseInfoInFiles" : [ "LicenseRef-WebM", "LicenseRef-BSD-2-Clause", "LicenseRef-BSD-3-Clause" ]
  }, {
    "SPDXID" : "SPDXRef-item9851425",
    "checksums" : [ {
      "algorithm" : "SHA1",
      "checksumValue" : "5d6dac61a5f322f0e655f1391276b62616e2186e"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "7be7091db664435ff38fd2a38f213a5abf2a6cb0f96e1b5171fa29ed4805774b"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "f81c996aa9e7467b5455398d2c8f2478"
    } ],
    "copyrightText" : "Copyright 2008 Google Inc. All rights reserved. http://code.google.com/p/protobuf/\nCopyright (c) 2008-2013, Dave Benson. All rights reserved.",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/protoc-c/c_message.h",
    "licenseConcluded" : "(LicenseRef-BSD-3-Clause-5d8fbbf3d2c067f361b4e5e9a9352bfc AND LicenseRef-BSD-2-Clause-64d547dda59824f98aba23eb314af065)",
    "licenseInfoInFiles" : [ "LicenseRef-WebM", "LicenseRef-BSD-2-Clause", "LicenseRef-BSD-3-Clause" ]
  }, {
    "SPDXID" : "SPDXRef-item9851426",
    "checksums" : [ {
      "algorithm" : "SHA256",
      "checksumValue" : "a2d459bd817354e1872cbc0d7d8a627297a43eca0b730071985b8c8b62775301"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "b80d5e1a58106f9204826db47761d314"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "e1ddb0c4a27f4cc5c1f5c486991f6a49207215fc"
    } ],
    "copyrightText" : "Copyright 2008 Google Inc. All rights reserved. http://code.google.com/p/protobuf/\nCopyright (c) 2008-2013, Dave Benson. All rights reserved.",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/protoc-c/c_extension.cc",
    "licenseConcluded" : "(LicenseRef-BSD-3-Clause-5d8fbbf3d2c067f361b4e5e9a9352bfc AND LicenseRef-BSD-2-Clause-64d547dda59824f98aba23eb314af065)",
    "licenseInfoInFiles" : [ "LicenseRef-WebM", "LicenseRef-BSD-2-Clause", "LicenseRef-BSD-3-Clause" ]
  }, {
    "SPDXID" : "SPDXRef-item9851427",
    "checksums" : [ {
      "algorithm" : "SHA1",
      "checksumValue" : "94bbab7f51c12968f31d8a7f151d142992eaee25"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "031d789916f144b49650dfa9982f138096902822bd2f9159ca535531a5937171"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "1524059a2dba44c9939a0b4c10774e0d"
    } ],
    "copyrightText" : "Copyright 2008 Google Inc. All rights reserved. http://code.google.com/p/protobuf/\nCopyright (c) 2008-2013, Dave Benson. All rights reserved.",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/protoc-c/c_enum.cc",
    "licenseConcluded" : "(LicenseRef-BSD-3-Clause-5d8fbbf3d2c067f361b4e5e9a9352bfc AND LicenseRef-BSD-2-Clause-64d547dda59824f98aba23eb314af065)",
    "licenseInfoInFiles" : [ "LicenseRef-WebM", "LicenseRef-BSD-2-Clause", "LicenseRef-BSD-3-Clause" ]
  }, {
    "SPDXID" : "SPDXRef-item9851428",
    "checksums" : [ {
      "algorithm" : "SHA256",
      "checksumValue" : "5432b75eccddfad50ec89994eb8af8858a0d93b0e335112bb660d2a66f4f457a"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "bb3aadd91878de4ba0022b5a8c7769ae"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "f827992c17b0d08a57b9ef594fbc706d73a61f7c"
    } ],
    "copyrightText" : "Copyright 2008 Google Inc. All rights reserved. http://code.google.com/p/protobuf/\nCopyright (c) 2008-2013, Dave Benson. All rights reserved.",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/protoc-c/c_primitive_field.h",
    "licenseConcluded" : "(LicenseRef-BSD-3-Clause-5d8fbbf3d2c067f361b4e5e9a9352bfc AND LicenseRef-BSD-2-Clause-64d547dda59824f98aba23eb314af065)",
    "licenseInfoInFiles" : [ "LicenseRef-WebM", "LicenseRef-BSD-2-Clause", "LicenseRef-BSD-3-Clause" ]
  }, {
    "SPDXID" : "SPDXRef-item9851429",
    "checksums" : [ {
      "algorithm" : "MD5",
      "checksumValue" : "3d3d4c799abdf1872fbe87d15b4116fb"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "c4a9853c17be15117d11edd486807b546ec82936"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "04dcf236ab9130ace7808f417c0ce381bf768d054312bf436e2db4cdbaa93607"
    } ],
    "copyrightText" : "Copyright 2008 Google Inc. All rights reserved. http://code.google.com/p/protobuf/\nCopyright (c) 2008-2013, Dave Benson. All rights reserved.",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/protoc-c/c_primitive_field.cc",
    "licenseConcluded" : "(LicenseRef-BSD-3-Clause-5d8fbbf3d2c067f361b4e5e9a9352bfc AND LicenseRef-BSD-2-Clause-64d547dda59824f98aba23eb314af065)",
    "licenseInfoInFiles" : [ "LicenseRef-WebM", "LicenseRef-BSD-2-Clause", "LicenseRef-BSD-3-Clause" ]
  }, {
    "SPDXID" : "SPDXRef-item9851430",
    "checksums" : [ {
      "algorithm" : "SHA256",
      "checksumValue" : "87be3696559c640964da256743a6d7e0f40333c97e2c9fc81e3af50b538535aa"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "940e8408e8611c1a8776373632667fff"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "fccff63f4649e0ca3be48e7408a9fe176c0b7f0d"
    } ],
    "copyrightText" : "Copyright 2008 Google Inc. All rights reserved. http://code.google.com/p/protobuf/\nCopyright (c) 2008-2013, Dave Benson. All rights reserved.",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/protoc-c/c_message_field.cc",
    "licenseConcluded" : "(LicenseRef-BSD-3-Clause-5d8fbbf3d2c067f361b4e5e9a9352bfc AND LicenseRef-BSD-2-Clause-64d547dda59824f98aba23eb314af065)",
    "licenseInfoInFiles" : [ "LicenseRef-WebM", "LicenseRef-BSD-2-Clause", "LicenseRef-BSD-3-Clause" ]
  }, {
    "SPDXID" : "SPDXRef-item9851431",
    "checksums" : [ {
      "algorithm" : "SHA256",
      "checksumValue" : "63f38101653c6c9257ce5e135a9fe530e47989934ba1c8a6a4f5cdcadc3e9141"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "8f8654c883fb40bc8d3ba0823333d675"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "cfe4090507c6510007bacc74bb7011e2c3b12e29"
    } ],
    "copyrightText" : "Copyright 2008 Google Inc. All rights reserved. http://code.google.com/p/protobuf/\nCopyright (c) 2008-2013, Dave Benson. All rights reserved.",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/protoc-c/c_generator.h",
    "licenseConcluded" : "(LicenseRef-BSD-3-Clause-5d8fbbf3d2c067f361b4e5e9a9352bfc AND LicenseRef-BSD-2-Clause-64d547dda59824f98aba23eb314af065)",
    "licenseInfoInFiles" : [ "LicenseRef-WebM", "LicenseRef-BSD-2-Clause", "LicenseRef-BSD-3-Clause" ]
  }, {
    "SPDXID" : "SPDXRef-item9851432",
    "checksums" : [ {
      "algorithm" : "SHA1",
      "checksumValue" : "e9c9db67956b2511fcbdcf78618def3908d7045c"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "285474deed8cecf2c50a7453d06c6293f1ef517fa2c9a5de2a124ad53f1a3179"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "6bd5c477c833a5f8da37bdeecad46428"
    } ],
    "copyrightText" : "Copyright 2008 Google Inc. All rights reserved. http://code.google.com/p/protobuf/\nCopyright (c) 2008-2013, Dave Benson. All rights reserved.",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/protoc-c/c_enum.h",
    "licenseConcluded" : "(LicenseRef-BSD-3-Clause-5d8fbbf3d2c067f361b4e5e9a9352bfc AND LicenseRef-BSD-2-Clause-64d547dda59824f98aba23eb314af065)",
    "licenseInfoInFiles" : [ "LicenseRef-WebM", "LicenseRef-BSD-2-Clause", "LicenseRef-BSD-3-Clause" ]
  }, {
    "SPDXID" : "SPDXRef-item9851433",
    "checksums" : [ {
      "algorithm" : "SHA1",
      "checksumValue" : "ae643a48c10bf4776a9dfd714d21fcfd741707f8"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "775f7acb8f2aea1c11c31a3beba55170500bd2183143a7aa430beaaa0d3878f8"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "dc501cac8f394bb6b7cf3b32be659cb3"
    } ],
    "copyrightText" : "Copyright 2008 Google Inc. All rights reserved. http://code.google.com/p/protobuf/\nCopyright (c) 2008-2013, Dave Benson. All rights reserved.",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/protoc-c/c_file.h",
    "licenseConcluded" : "(LicenseRef-BSD-3-Clause-5d8fbbf3d2c067f361b4e5e9a9352bfc AND LicenseRef-BSD-2-Clause-64d547dda59824f98aba23eb314af065)",
    "licenseInfoInFiles" : [ "LicenseRef-WebM", "LicenseRef-BSD-2-Clause", "LicenseRef-BSD-3-Clause" ]
  }, {
    "SPDXID" : "SPDXRef-item9851434",
    "checksums" : [ {
      "algorithm" : "MD5",
      "checksumValue" : "43ee92e0d061ed9a20e4d205c35666ae"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "e60039e7b6213bab2155cfc2b5e62a977609fae0"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "84e73bd0b639931a7295ff18e77c929ca8b1f9cc1e5c11bec055d8e7b8bfd199"
    } ],
    "copyrightText" : "Copyright 2008 Google Inc. All rights reserved. http://code.google.com/p/protobuf/\nCopyright (c) 2008-2013, Dave Benson. All rights reserved.",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/protoc-c/c_bytes_field.h",
    "licenseConcluded" : "(LicenseRef-BSD-3-Clause-5d8fbbf3d2c067f361b4e5e9a9352bfc AND LicenseRef-BSD-2-Clause-64d547dda59824f98aba23eb314af065)",
    "licenseInfoInFiles" : [ "LicenseRef-WebM", "LicenseRef-BSD-2-Clause", "LicenseRef-BSD-3-Clause" ]
  }, {
    "SPDXID" : "SPDXRef-item9851435",
    "checksums" : [ {
      "algorithm" : "MD5",
      "checksumValue" : "4a447a991e9cf7f64e0d22ede47d91ab"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "b14b8d6c9915f0dfccd191cf9364249cc9551f87"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "dccc05968028fe0526afef98f2d6fbcacc5c5979dbb9abb338cc1464aa471b3f"
    } ],
    "copyrightText" : "Copyright 2008 Google Inc. All rights reserved. http://code.google.com/p/protobuf/\nCopyright (c) 2008-2013, Dave Benson. All rights reserved.",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/protoc-c/c_generator.cc",
    "licenseConcluded" : "(LicenseRef-BSD-3-Clause-5d8fbbf3d2c067f361b4e5e9a9352bfc AND LicenseRef-BSD-2-Clause-64d547dda59824f98aba23eb314af065)",
    "licenseInfoInFiles" : [ "LicenseRef-WebM", "LicenseRef-BSD-2-Clause", "LicenseRef-BSD-3-Clause" ]
  }, {
    "SPDXID" : "SPDXRef-item9851436",
    "checksums" : [ {
      "algorithm" : "SHA1",
      "checksumValue" : "3d5a1972fa98b070b71b8987dc40feead49f55f3"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "9d76da29d3e733898a02846e50b6d7be9435610a63ce77a4f07f30b52d695705"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "9fbc5b5aa9e6c0e3e6249f1cde227d71"
    } ],
    "copyrightText" : "Copyright 2008 Google Inc. All rights reserved. http://code.google.com/p/protobuf/\nCopyright (c) 2008-2013, Dave Benson. All rights reserved.",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/protoc-c/c_helpers.h",
    "licenseConcluded" : "(LicenseRef-BSD-3-Clause-5d8fbbf3d2c067f361b4e5e9a9352bfc AND LicenseRef-BSD-2-Clause-64d547dda59824f98aba23eb314af065)",
    "licenseInfoInFiles" : [ "LicenseRef-WebM", "LicenseRef-BSD-2-Clause", "LicenseRef-BSD-3-Clause" ]
  }, {
    "SPDXID" : "SPDXRef-item9851437",
    "checksums" : [ {
      "algorithm" : "MD5",
      "checksumValue" : "5c511c03189e81eff3ccaa6e3c80b041"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "065d1f2c45d39e0f754a1f3a0794e90bdd862d63"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "2e5c2761f7ba052df8fa9bae7e38ea6b084ae20a84541e59651cef889931893a"
    } ],
    "copyrightText" : "NOASSERTION",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/Doxyfile.in",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "LicenseRef-See-doc.OTHER" ]
  }, {
    "SPDXID" : "SPDXRef-item9851440",
    "checksums" : [ {
      "algorithm" : "SHA256",
      "checksumValue" : "c83b7478607a687aaaa51ff13455f2ff48dabf6828eb72c839ccced91f67e9c7"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "66830f91543b5507d689eb307bc3db2c70907827"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "59143096f27e6eb273f6df7fe67161ac"
    } ],
    "copyrightText" : "NOASSERTION",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/.github/workflows/build.yml",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "NOASSERTION" ]
  }, {
    "SPDXID" : "SPDXRef-item9851441",
    "checksums" : [ {
      "algorithm" : "SHA256",
      "checksumValue" : "02726388864e158726e4d99c1d351da0813664993bc7e0a9fc3df3791bf553a4"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "9e063dfebbda3df79409f5889927e868"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "160a9fe30f99cac36f87e30d747bdc1d3e5ee566"
    } ],
    "copyrightText" : "NOASSERTION",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/autogen.sh",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "NOASSERTION" ]
  }, {
    "SPDXID" : "SPDXRef-item9851443",
    "checksums" : [ {
      "algorithm" : "SHA1",
      "checksumValue" : "8e6168b4199a2d76390329ff9e68398b6e7636ad"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "0f2c3eece299f5971c33bcea3fca26a00eef6b2e59e2e5b827c1062aaad39c6b"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "c240b42b8a99fedc76780547589ec192"
    } ],
    "copyrightText" : "Copyright (C) 2008-2011 Free Software Foundation, Inc.",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/m4/valgrind-tests.m4",
    "licenseConcluded" : "LicenseRef-FSFULLR-564001a1604da16622c52d713e5f360b",
    "licenseInfoInFiles" : [ "LicenseRef-FSFULLR" ]
  }, {
    "SPDXID" : "SPDXRef-item9851444",
    "checksums" : [ {
      "algorithm" : "SHA256",
      "checksumValue" : "302601f55edc1c28382e383e4c96ee3820f56df01964350a8bae16afd2f27f78"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "2f4aa44e3ea860e3710feb09e5f700ad"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "b1f8382702f77f8ec4df80c46d82a39592ece158"
    } ],
    "copyrightText" : "Copyright (c) 2008 Guido U. Draheim <guidod@gmx.de>\nCopyright (c) 2011 Maarten Bosmans <mkbosmans@gmail.com>",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/m4/ax_check_compile_flag.m4",
    "licenseConcluded" : "LicenseRef-GPL-3.0-or-later-WITH-Autoconf-exception-44340b8ffba581c57e1e73e97bf161ce",
    "licenseInfoInFiles" : [ "LicenseRef-Autoconf-exception", "LicenseRef-Autoconf-exception-2.0", "LicenseRef-Autoconf-exception-macro", "LicenseRef-GPL-3.0-or-later" ]
  }, {
    "SPDXID" : "SPDXRef-item9851445",
    "checksums" : [ {
      "algorithm" : "MD5",
      "checksumValue" : "285e2370fcb5e886f6600a6969f88b25"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "a06bfd06aafd205b9add5c2adc84438ae27a318c"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "e6d983c51ef63af2b100064946c6fed0e4bcb5a62b46966f81c8cac9d859a6ac"
    } ],
    "copyrightText" : "Copyright (C) 2008-2014 Free Software Foundation, Inc.",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/m4/ld-version-script.m4",
    "licenseConcluded" : "LicenseRef-FSFULLR-564001a1604da16622c52d713e5f360b",
    "licenseInfoInFiles" : [ "LicenseRef-FSFULLR" ]
  }, {
    "SPDXID" : "SPDXRef-item9851446",
    "checksums" : [ {
      "algorithm" : "SHA256",
      "checksumValue" : "0c08d2f64147f65eb7e255019102c1042ab695c60fd49add19793951a1279a1a"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "bf6793ca89cb1eea208f6b1a29f1d2b7"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "65960142716999eedf7cd796ba0bb184ec98a9ff"
    } ],
    "copyrightText" : "Copyright (c) 2008 Benjamin Kosnik <bkoz@redhat.com>\nCopyright (c) 2012 Zack Weinberg <zackw@panix.com>\nCopyright (c) 2013 Roy Stogner <roystgnr@ices.utexas.edu>\nCopyright (c) 2014, 2015 Google Inc.; contributed by Alexey Sokolov <sokolov@google.com>\nCopyright (c) 2015 Paul Norman <penorman@mac.com>\nCopyright (c) 2015 Moritz Klammler <moritz@klammler.eu>\nCopyright (c) 2016, 2018 Krzesimir Nowak <qdlacz@gmail.com>",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/m4/ax_cxx_compile_stdcxx.m4",
    "licenseConcluded" : "LicenseRef-FSFAP-27b6144a5a871aae6cbd42c8a2812171",
    "licenseInfoInFiles" : [ "LicenseRef-FSFAP" ]
  }, {
    "SPDXID" : "SPDXRef-item9851447",
    "checksums" : [ {
      "algorithm" : "SHA1",
      "checksumValue" : "3e73ef150df9e98db724dab6b211d7deba18b137"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "b97b533ce9d549b370e00f919ee8612f010514802244e88f859c3cf222f17c8c"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "fe5098ee56016d0c16da7f32298e089c"
    } ],
    "copyrightText" : "Copyright  2004 Scott James Remnant <scott@netsplit.com>.",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/m4/pkg.m4",
    "licenseConcluded" : "LicenseRef-GPL-2.0-or-later-WITH-Autoconf-exception",
    "licenseInfoInFiles" : [ "LicenseRef-Autoconf-exception", "LicenseRef-GPL-2.0-or-later", "LicenseRef-Autoconf-exception-generic", "LicenseRef-scancode-autoconf-simple-exception-2.0" ]
  }, {
    "SPDXID" : "SPDXRef-item9851448",
    "checksums" : [ {
      "algorithm" : "MD5",
      "checksumValue" : "43d37c4e386893d27ba57ca89b34f3ed"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "ab7be7987d12607b77ea53d0f44bdae249090497"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "b96df5710e539dde8424e3c38174598386aeaff62e4b4a3a878a3f8290a7f9fe"
    } ],
    "copyrightText" : "NOASSERTION",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/m4/.gitignore",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "NOASSERTION" ]
  }, {
    "SPDXID" : "SPDXRef-item9851449",
    "checksums" : [ {
      "algorithm" : "MD5",
      "checksumValue" : "edae0af3e6c8402366d0153c3e1fad31"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "4852e6f44f36c967f9792b258409dd984a081a8aefd0a18476c7ee891f048026"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "39f5f88dde4b7a0fb55943613acc1b15aa26c268"
    } ],
    "copyrightText" : "Copyright  2012, 2014 Philip Withnall\nCopyright  2012 Xan Lopez\nCopyright  2012 Christian Persch\nCopyright  2012 Paolo Borelli\nCopyright  2012 Dan Winship",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/m4/code_coverage.m4",
    "licenseConcluded" : "LicenseRef-LGPL-2.1-or-later",
    "licenseInfoInFiles" : [ "LicenseRef-LGPL-2.1-or-later", "LicenseRef-scancode-unknown-license-reference" ]
  }, {
    "SPDXID" : "SPDXRef-item9851450",
    "checksums" : [ {
      "algorithm" : "MD5",
      "checksumValue" : "ac7612e07eabb1320408c51d2c208952"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "f119bab5c70b44825403958339c438683bb03b88"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "333504e5b25b78a44b90a7a69529941cf50ffc440d9a96235c2b1858e13515fb"
    } ],
    "copyrightText" : "NOASSERTION",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/.commit_docs.sh",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "NOASSERTION" ]
  }, {
    "SPDXID" : "SPDXRef-item9851451",
    "checksums" : [ {
      "algorithm" : "MD5",
      "checksumValue" : "629cb0362b0b4aff4e9d0129c79ead62"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "62b2d54f78e6abfcd8d4ced0a02d552749c72037"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "fe8fe4e81447ccc50db7fa1aff6c7f3862c3d133fe672aea96b32e6e33a4dc8e"
    } ],
    "copyrightText" : "NOASSERTION",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/DoxygenLayout.xml",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "NOASSERTION" ]
  }, {
    "SPDXID" : "SPDXRef-item9851453",
    "checksums" : [ {
      "algorithm" : "SHA256",
      "checksumValue" : "436b6b05afd63364b87244136433de1952c6ea5ef95d13449ffb380f604eed73"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "4ecafad8de201c75b350bec6f97a20ad"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "3ce856f45e4b51bd951bd0d67250f492dbe55cd6"
    } ],
    "copyrightText" : "NOASSERTION",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/protobuf-c/libprotobuf-c.pc.in",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "NOASSERTION" ]
  }, {
    "SPDXID" : "SPDXRef-item9851454",
    "checksums" : [ {
      "algorithm" : "SHA1",
      "checksumValue" : "363eb6edb948466c270a0caa12d337b90d4c627b"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "cea6e61e9d7786fb4652a2c3faa7a74151f6cd5dab763701764c22d01e83f922"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "229a0e9e862958f8d693be5d640e8dc8"
    } ],
    "copyrightText" : "Copyright (c) 2021, the protobuf-c authors. All rights reserved.",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/protobuf-c/protobuf-c.proto",
    "licenseConcluded" : "LicenseRef-BSD-2-Clause-64d547dda59824f98aba23eb314af065",
    "licenseInfoInFiles" : [ "LicenseRef-BSD-2-Clause" ]
  }, {
    "SPDXID" : "SPDXRef-item9851455",
    "checksums" : [ {
      "algorithm" : "SHA1",
      "checksumValue" : "37ace271f6f0c4d66788ac32da3f6753be1d67bb"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "509c57290e8113febf32ffedeb994e7f834d26bbc5b832ff4277d6329433a214"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "ddd0cba5702bcfcfbfb8da5f9585c530"
    } ],
    "copyrightText" : "Copyright (c) 2008-2023, Dave Benson and the protobuf-c authors. All rights reserved.",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/protobuf-c/protobuf-c.h",
    "licenseConcluded" : "LicenseRef-BSD-2-Clause-64d547dda59824f98aba23eb314af065",
    "licenseInfoInFiles" : [ "LicenseRef-BSD-2-Clause", "LicenseRef-BSD-3-Clause" ]
  }, {
    "SPDXID" : "SPDXRef-item9851456",
    "checksums" : [ {
      "algorithm" : "SHA256",
      "checksumValue" : "e43a2e4f6c8b0e9ee022628f82e1f79f0bc1cf7ed43a9803ef099621b3ef34ce"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "da3386c401329923c4a34683b571d4b8"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "372e17e7d7aff9da476f35e165c12eff9c993ace"
    } ],
    "copyrightText" : "Copyright (c) 2008-2023, Dave Benson and the protobuf-c authors. All rights reserved.",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/protobuf-c/protobuf-c.c",
    "licenseConcluded" : "LicenseRef-BSD-2-Clause-64d547dda59824f98aba23eb314af065",
    "licenseInfoInFiles" : [ "LicenseRef-BSD-2-Clause", "LicenseRef-BSD-3-Clause" ]
  }, {
    "SPDXID" : "SPDXRef-item9851457",
    "checksums" : [ {
      "algorithm" : "MD5",
      "checksumValue" : "50850418f9ac52457b9ac0d31dea7133"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "ccdae7d3930ab7e813019b224a6138de9e10f3dd"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "b2a5f102e87f9249a54aa1cfe732317c6613471217bd372624cae49353225981"
    } ],
    "copyrightText" : "NOASSERTION",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/protobuf-c/libprotobuf-c.sym",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "NOASSERTION" ]
  }, {
    "SPDXID" : "SPDXRef-item9851458",
    "checksums" : [ {
      "algorithm" : "SHA1",
      "checksumValue" : "57fc14ffd617512b521070ea8a51a048b821330d"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "8b0996d03afab43239483c232c1fda51c0056a4c5632c97ddc91c7e9042a2fb9"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "5361e63a3c84ad04f0de90df6147e167"
    } ],
    "copyrightText" : "NOASSERTION",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/ChangeLog.old",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "LicenseRef-Apache-2.0", "LicenseRef-BSD-2-Clause", "LicenseRef-BSD-3-Clause" ]
  }, {
    "SPDXID" : "SPDXRef-item9851459",
    "checksums" : [ {
      "algorithm" : "SHA1",
      "checksumValue" : "e5f188752e29a92a82562cf7c32e2faa1aeb0716"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "c789f9481805eef0bae721af0d255ebd057ba2ed2a653e2f5ed6bbbbf7266206"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "474a7505a60fe6d8796034bd9256ee4f"
    } ],
    "copyrightText" : "NOASSERTION",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/CHANGELOG.md",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "NOASSERTION" ]
  }, {
    "SPDXID" : "SPDXRef-item9851460",
    "checksums" : [ {
      "algorithm" : "SHA256",
      "checksumValue" : "fc14bbcd364840736d8762e68db3f60274707193f572597f6926de9644b6413d"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "1aff8435a6a39570304dd2a5004ef8b9"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "b04430268f824c9482f53a6531b5238e4b211029"
    } ],
    "copyrightText" : "NOASSERTION",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/.gitignore",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "NOASSERTION" ]
  }, {
    "SPDXID" : "SPDXRef-item9851461",
    "checksums" : [ {
      "algorithm" : "MD5",
      "checksumValue" : "164f910af068d15601b7e84ff5ab18a6"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "252b969489479653bd7696347826b2da513731b50d6f16c913f6d8fea6d51816"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "73780c007ef9de14a04933751f6d27719a71ae26"
    } ],
    "copyrightText" : "NOASSERTION",
    "fileName" : "protobuf-c-1.5.0.tar.gz/protobuf-c-1.5.0.tar/protobuf-c-1.5.0/Makefile.am",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "NOASSERTION" ]
  } ],
  "relationships" : [ {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851360"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851363"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851364"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851365"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851366"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851368"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851369"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851370"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851372"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851373"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851374"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851376"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851377"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851378"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851380"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851381"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851382"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851383"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851385"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851386"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851387"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851389"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851390"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851391"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851393"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851394"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851395"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851397"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851398"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851400"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851401"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851402"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851403"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851405"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851406"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851407"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851408"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851410"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851411"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851412"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851413"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851414"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851415"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851416"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851417"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851418"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851419"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851420"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851421"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851422"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851423"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851424"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851425"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851426"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851427"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851428"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851429"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851430"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851431"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851432"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851433"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851434"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851435"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851436"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851437"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851440"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851441"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851443"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851444"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851445"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851446"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851447"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851448"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851449"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851450"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851451"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851453"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851454"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851455"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851456"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851457"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851458"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851459"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851460"
  }, {
    "spdxElementId" : "SPDXRef-upload2276",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item9851461"
  }, {
    "spdxElementId" : "SPDXRef-DOCUMENT",
    "relationshipType" : "DESCRIBES",
    "relatedSpdxElement" : "SPDXRef-upload2276"
  } ]
}