{
  "SPDXID" : "SPDXRef-DOCUMENT",
  "spdxVersion" : "SPDX-2.3",
  "creationInfo" : {
    "comment" : "This document was created using license information and a generator from Fossology.\nIt contains the license and copyright analysis of libxinerama libXinerama-1.1.5\nPlease check \"LicenseComments\" for explanations of concluded licenses",
    "created" : "2025-04-02T17:18:10Z",
    "creators" : [ "Tool: fossology-4.4.0.51", "Person: Oliver Fendt" ],
    "licenseListVersion" : "3.22"
  },
  "name" : "/srv/fossology/repository/report",
  "dataLicense" : "CC0-1.0",
  "hasExtractedLicensingInfos" : [ {
    "licenseId" : "LicenseRef-CC0-1.0",
    "extractedText" : "Creative Commons Legal Code\n\nCC0 1.0 Universal\n\n    CREATIVE COMMONS CORPORATION IS NOT A LAW FIRM AND DOES NOT PROVIDE\n    LEGAL SERVICES. DISTRIBUTION OF THIS DOCUMENT DOES NOT CREATE AN\n    ATTORNEY-CLIENT RELATIONSHIP. CREATIVE COMMONS PROVIDES THIS\n    INFORMATION ON AN \"AS-IS\" BASIS. CREATIVE COMMONS MAKES NO WARRANTIES\n    REGARDING THE USE OF THIS DOCUMENT OR THE INFORMATION OR WORKS\n    PROVIDED HEREUNDER, AND DISCLAIMS LIABILITY FOR DAMAGES RESULTING FROM\n    THE USE OF THIS DOCUMENT OR THE INFORMATION OR WORKS PROVIDED\n    HEREUNDER.\n\nStatement of Purpose\n\nThe laws of most jurisdictions throughout the world automatically confer\nexclusive Copyright and Related Rights (defined below) upon the creator\nand subsequent owner(s) (each and all, an \"owner\") of an original work of\nauthorship and/or a database (each, a \"Work\").\n\nCertain owners wish to permanently relinquish those rights to a Work for\nthe purpose of contributing to a commons of creative, cultural and\nscientific works (\"Commons\") that the public can reliably and without fear\nof later claims of infringement build upon, modify, incorporate in other\nworks, reuse and redistribute as freely as possible in any form whatsoever\nand for any purposes, including without limitation commercial purposes.\nThese owners may contribute to the Commons to promote the ideal of a free\nculture and the further production of creative, cultural and scientific\nworks, or to gain reputation or greater distribution for their Work in\npart through the use and efforts of others.\n\nFor these and/or other purposes and motivations, and without any\nexpectation of additional consideration or compensation, the person\nassociating CC0 with a Work (the \"Affirmer\"), to the extent that he or she\nis an owner of Copyright and Related Rights in the Work, voluntarily\nelects to apply CC0 to the Work and publicly distribute the Work under its\nterms, with knowledge of his or her Copyright and Related Rights in the\nWork and the meaning and intended legal effect of CC0 on those rights.\n\n1. Copyright and Related Rights. A Work made available under CC0 may be\nprotected by copyright and related or neighboring rights (\"Copyright and\nRelated Rights\"). Copyright and Related Rights include, but are not\nlimited to, the following:\n\n  i. the right to reproduce, adapt, distribute, perform, display,\n     communicate, and translate a Work;\n ii. moral rights retained by the original author(s) and/or performer(s);\niii. publicity and privacy rights pertaining to a person's image or\n     likeness depicted in a Work;\n iv. rights protecting against unfair competition in regards to a Work,\n     subject to the limitations in paragraph 4(a), below;\n  v. rights protecting the extraction, dissemination, use and reuse of data\n     in a Work;\n vi. database rights (such as those arising under Directive 96/9/EC of the\n     European Parliament and of the Council of 11 March 1996 on the legal\n     protection of databases, and under any national implementation\n     thereof, including any amended or successor version of such\n     directive); and\nvii. other similar, equivalent or corresponding rights throughout the\n     world based on applicable law or treaty, and any national\n     implementations thereof.\n\n2. Waiver. To the greatest extent permitted by, but not in contravention\nof, applicable law, Affirmer hereby overtly, fully, permanently,\nirrevocably and unconditionally waives, abandons, and surrenders all of\nAffirmer's Copyright and Related Rights and associated claims and causes\nof action, whether now known or unknown (including existing as well as\nfuture claims and causes of action), in the Work (i) in all territories\nworldwide, (ii) for the maximum duration provided by applicable law or\ntreaty (including future time extensions), (iii) in any current or future\nmedium and for any number of copies, and (iv) for any purpose whatsoever,\nincluding without limitation commercial, advertising or promotional\npurposes (the \"Waiver\"). Affirmer makes the Waiver for the benefit of each\nmember of the public at large and to the detriment of Affirmer's heirs and\nsuccessors, fully intending that such Waiver shall not be subject to\nrevocation, rescission, cancellation, termination, or any other legal or\nequitable action to disrupt the quiet enjoyment of the Work by the public\nas contemplated by Affirmer's express Statement of Purpose.\n\n3. Public License Fallback. Should any part of the Waiver for any reason\nbe judged legally invalid or ineffective under applicable law, then the\nWaiver shall be preserved to the maximum extent permitted taking into\naccount Affirmer's express Statement of Purpose. In addition, to the\nextent the Waiver is so judged Affirmer hereby grants to each affected\nperson a royalty-free, non transferable, non sublicensable, non exclusive,\nirrevocable and unconditional license to exercise Affirmer's Copyright and\nRelated Rights in the Work (i) in all territories worldwide, (ii) for the\nmaximum duration provided by applicable law or treaty (including future\ntime extensions), (iii) in any current or future medium and for any number\nof copies, and (iv) for any purpose whatsoever, including without\nlimitation commercial, advertising or promotional purposes (the\n\"License\"). The License shall be deemed effective as of the date CC0 was\napplied by Affirmer to the Work. Should any part of the License for any\nreason be judged legally invalid or ineffective under applicable law, such\npartial invalidity or ineffectiveness shall not invalidate the remainder\nof the License, and in such case Affirmer hereby affirms that he or she\nwill not (i) exercise any of his or her remaining Copyright and Related\nRights in the Work or (ii) assert any associated claims and causes of\naction with respect to the Work, in either case contrary to Affirmer's\nexpress Statement of Purpose.\n\n4. Limitations and Disclaimers.\n\n a. No trademark or patent rights held by Affirmer are waived, abandoned,\n    surrendered, licensed or otherwise affected by this document.\n b. Affirmer offers the Work as-is and makes no representations or\n    warranties of any kind concerning the Work, express, implied,\n    statutory or otherwise, including without limitation warranties of\n    title, merchantability, fitness for a particular purpose, non\n    infringement, or the absence of latent or other defects, accuracy, or\n    the present or absence of errors, whether or not discoverable, all to\n    the greatest extent permissible under applicable law.\n c. Affirmer disclaims responsibility for clearing rights of other persons\n    that may apply to the Work or any use thereof, including without\n    limitation any person's Copyright and Related Rights in the Work.\n    Further, Affirmer disclaims responsibility for obtaining any necessary\n    consents, permissions or other rights required for any use of the\n    Work.\n d. Affirmer understands and acknowledges that Creative Commons is not a\n    party to this document and has no duty or obligation with respect to\n    this CC0 or use of the Work.",
    "name" : "Creative Commons Zero v1.0 Universal"
  }, {
    "licenseId" : "LicenseRef-HPND-sell-variant",
    "extractedText" : "Copyright 1993 by OpenVision Technologies, Inc.\n\nPermission to use, copy, modify, distribute, and sell this software\nand its documentation for any purpose is hereby granted without fee,\nprovided that the above copyright notice appears in all copies and\nthat both that copyright notice and this permission notice appear in\nsupporting documentation, and that the name of OpenVision not be used\nin advertising or publicity pertaining to distribution of the software\nwithout specific, written prior permission. OpenVision makes no\nrepresentations about the suitability of this software for any\npurpose.  It is provided \"as is\" without express or implied warranty.\n\nOPENVISION DISCLAIMS ALL WARRANTIES WITH REGARD TO THIS SOFTWARE,\nINCLUDING ALL IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS, IN NO\nEVENT SHALL OPENVISION BE LIABLE FOR ANY SPECIAL, INDIRECT OR\nCONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF\nUSE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR\nOTHER TORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR\nPERFORMANCE OF THIS SOFTWARE.",
    "name" : "Historical Permission Notice and Disclaimer - sell variant"
  }, {
    "licenseId" : "LicenseRef-HPND-sell-variant-0b820e94cfa6f74c097d614b45c47f24",
    "extractedText" : "Permission to use, copy, modify, distribute, and sell this software and its\ndocumentation for any purpose is hereby granted without fee, provided that\nthe above copyright notice appear in all copies and that both that\ncopyright notice and this permission notice appear in supporting\ndocumentation, and that the name of Red Hat not be used in\nadvertising or publicity pertaining to distribution of the software without\nspecific, written prior permission. Red Hat makes no\nrepresentations about the suitability of this software for any purpose. It\nis provided \"as is\" without express or implied warranty.\n\nRED HAT DISCLAIMS ALL WARRANTIES WITH REGARD TO THIS SOFTWARE,\nINCLUDING ALL IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS, IN NO\nEVENT SHALL RED HAT BE LIABLE FOR ANY SPECIAL, INDIRECT OR\nCONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM LOSS OF USE,\nDATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER\nTORTIOUS ACTION, ARISING OUT OF OR IN CONNECTION WITH THE USE OR\nPERFORMANCE OF THIS SOFTWARE.",
    "name" : "Historical Permission Notice and Disclaimer - sell variant"
  }, {
    "licenseId" : "LicenseRef-MIT",
    "extractedText" : "MIT License\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.",
    "name" : "MIT License"
  }, {
    "licenseId" : "LicenseRef-MIT-99db7cd1d38ca65ee94c318d11ba74fb",
    "extractedText" : "Permission is hereby granted, free of charge, to any person obtaining a\ncopy of this software and associated documentation files (the \"Software\"),\nto deal in the Software without restriction, including without limitation\nthe rights to use, copy, modify, merge, publish, distribute, sublicense,\nand/or sell copies of the Software, and to permit persons to whom the\nSoftware is furnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice (including the next\nparagraph) shall be included in all copies or substantial portions of the\nSoftware.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL\nTHE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER\nLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING\nFROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER\nDEALINGS IN THE SOFTWARE.",
    "name" : "MIT License"
  }, {
    "licenseId" : "LicenseRef-MIT-open-group",
    "extractedText" : "Copyright <yyyy, yyyy> The Open Group\n\nPermission to use, copy, modify, distribute, and sell this software and\nits documentation for any purpose is hereby granted without fee,\nprovided that the above copyright notice appear in all copies and that\nboth that copyright notice and this permission notice appear in\nsupporting documentation.\n\nThe above copyright notice and this permission notice shall be included\nin all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS\nOR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\nMERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.\nIN NO EVENT SHALL BE LIABLE FOR ANY CLAIM, DAMAGES\nOR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR\nOTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR\nTHE USE OR OTHER DEALINGS IN THE SOFTWARE.\n\nExcept as contained in this notice, the name of The Open Group\nshall not be used in advertising or otherwise to promote the sale, use\nor other dealings in this Software without prior written authorization\nfrom The Open Group.",
    "name" : "MIT Open Group variant"
  }, {
    "licenseId" : "LicenseRef-MIT-open-group-bc2363e93a3186eca6722775f4b0fe44",
    "extractedText" : "Permission to use, copy, modify, distribute, and sell this software and its\ndocumentation for any purpose is hereby granted without fee, provided that\nthe above copyright notice appear in all copies and that both that\ncopyright notice and this permission notice appear in supporting\ndocumentation.\n\nThe above copyright notice and this permission notice shall be included in\nall copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE\nOPEN GROUP BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN\nAN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN\nCONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n\nExcept as contained in this notice, the name of The Open Group shall not be\nused in advertising or otherwise to promote the sale, use or other dealings\nin this Software without prior written authorization from The Open Group.",
    "name" : "MIT Open Group variant"
  }, {
    "licenseId" : "LicenseRef-X11",
    "extractedText" : "X11 License\n\nCopyright (C) 1996 X Consortium\n\nPermission is hereby granted, free of charge, to any person obtaining a copy of this software and associated documentation files (the \"Software\"), to deal in the Software without restriction, including without limitation the rights to use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the Software is furnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included in all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE X CONSORTIUM BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n\nExcept as contained in this notice, the name of the X Consortium shall not be used in advertising or otherwise to promote the sale, use or other dealings in this Software without prior written authorization from the X Consortium.\n\nX Window System is a trademark of X Consortium, Inc.",
    "name" : "X11 License"
  }, {
    "licenseId" : "LicenseRef-X11-distribute-modifications-variant",
    "extractedText" : "Copyright (c) <year> <copyright holders>\n\nPermission is hereby granted, free of charge, to any person obtaining a\ncopy of this software and associated documentation files (the\n\"Software\"), to deal in the Software without restriction, including\nwithout limitation the rights to use, copy, modify, merge, publish,\ndistribute, distribute with modifications, sublicense, and/or sell\ncopies of the Software, and to permit persons to whom the Software is\nfurnished to do so, subject to the following conditions:\n\nThe above copyright notice and this permission notice shall be included\nin all copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS\nOR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF\nMERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.\nIN NO EVENT SHALL THE ABOVE COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM,\nDAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR\nOTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR\nTHE USE OR OTHER DEALINGS IN THE SOFTWARE.\n\nExcept as contained in this notice, the name(s) of the above copyright\nholders shall not be used in advertising or otherwise to promote the\nsale, use or other dealings in this Software without prior written\nauthorization.",
    "name" : "X11 License Distribution Modification Variant"
  }, {
    "licenseId" : "LicenseRef-X11-distribute-modifications-variant-4e8b4715072fedb621c8eb5016321e1c",
    "extractedText" : "Permission is hereby granted, free of charge, to any person obtaining a copy\nof this software and associated documentation files (the \"Software\"), to deal\nin the Software without restriction, including without limitation the rights\nto use, copy, modify, merge, publish, distribute, sublicense, and/or sell\ncopies of the Software.\n\nThe above copyright notice and this permission notice shall be included in\nall copies or substantial portions of the Software.\n\nTHE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR\nIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,\nFITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL\nDIGITAL EQUIPMENT CORPORATION BE LIABLE FOR ANY CLAIM, DAMAGES, INCLUDING,\nBUT NOT LIMITED TO CONSEQUENTIAL OR INCIDENTAL DAMAGES, OR OTHER LIABILITY,\nWHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR\nIN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.\n\nExcept as contained in this notice, the name of Digital Equipment Corporation\nshall not be used in advertising or otherwise to promote the sale, use or other\ndealings in this Software without prior written authorization from Digital\nEquipment Corporation.",
    "name" : "X11 License Distribution Modification Variant"
  } ],
  "documentNamespace" : "http://fossy.osadl.org/repo/SPDX2TV_libxinerama-libXinerama-1.1.5.tar.gz_1743614290.spdx",
  "packages" : [ {
    "SPDXID" : "SPDXRef-upload2845",
    "checksums" : [ {
      "algorithm" : "MD5",
      "checksumValue" : "8a8d2671abebbbe86ba5fe87dbf60965"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "9baca7bc7ef0b7b5c18bbb91cd6987b12b3d9be0"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "71cce01ca3c4b5c12870f39ae2e4fa63a9bc303807f9b1c4e75ed7d122a560f9"
    } ],
    "copyrightText" : "NOASSERTION",
    "downloadLocation" : "https://gitlab.freedesktop.org/xorg/lib/libxinerama/-/archive/libXinerama-1.1.5/libxinerama-libXinerama-1.1.5.tar.gz",
    "externalRefs" : [ {
      "referenceCategory" : "PACKAGE-MANAGER",
      "referenceLocator" : "pkg:generic/libxinerama@libXinerama-1.1.5?download_url=https://gitlab.freedesktop.org/xorg/lib/libxinerama/-/archive/libXinerama-1.1.5/libxinerama-libXinerama-1.1.5.tar.gz",
      "referenceType" : "purl"
    } ],
    "filesAnalyzed" : true,
    "licenseComments" : "licenseInfoInFile determined by Scanners:\n - nomos (\"4.4.0.51\".1e52cb)\n - monk (\"4.4.0.51\".1e52cb)\n - ojo (\"4.4.0.51\".1e52cb)\n- scancode (\"4.4.0.51\".1e52cb)",
    "licenseConcluded" : "NOASSERTION",
    "licenseDeclared" : "(LicenseRef-MIT-open-group-bc2363e93a3186eca6722775f4b0fe44 AND LicenseRef-X11-distribute-modifications-variant-4e8b4715072fedb621c8eb5016321e1c AND LicenseRef-MIT-99db7cd1d38ca65ee94c318d11ba74fb)",
    "licenseInfoFromFiles" : [ "NOASSERTION" ],
    "name" : "libxinerama-libXinerama-1.1.5.tar.gz",
    "packageFileName" : "libxinerama-libXinerama-1.1.5.tar.gz",
    "packageVerificationCode" : {
      "packageVerificationCodeValue" : "83ee8d39072fefa69e64cf876a808ef81747597c"
    }
  } ],
  "files" : [ {
    "SPDXID" : "SPDXRef-item13244423",
    "checksums" : [ {
      "algorithm" : "SHA256",
      "checksumValue" : "98281c414013774f1ca5fff98f55159606d48b4f73cc6059a3f0049795140659"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "c729e3a68a65e7235f93aff7588e2f1c"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "3ee6e824e5b048b25ad3d105de0a9f52b49ed792"
    } ],
    "copyrightText" : "NOASSERTION",
    "fileName" : "libxinerama-libXinerama-1.1.5.tar.gz/libxinerama-libXinerama-1.1.5.tar/libxinerama-libXinerama-1.1.5/src/Makefile.am",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "NOASSERTION" ]
  }, {
    "SPDXID" : "SPDXRef-item13244412",
    "checksums" : [ {
      "algorithm" : "MD5",
      "checksumValue" : "2dcc6783fc513e6d90f0c8d98fdcea9e"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "5aaf3dc1b43bf647478eb47795f63de26d778a90"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "b4fb5a8c42daa9e9817e84be0c3d0dc177c7d862dd086471a707e13bf6d5e957"
    } ],
    "copyrightText" : "Copyright 2003 The Open Group",
    "fileName" : "libxinerama-libXinerama-1.1.5.tar.gz/libxinerama-libXinerama-1.1.5.tar/libxinerama-libXinerama-1.1.5/include/X11/extensions/Xinerama.h",
    "licenseConcluded" : "LicenseRef-MIT-open-group-bc2363e93a3186eca6722775f4b0fe44",
    "licenseInfoInFiles" : [ "LicenseRef-X11", "LicenseRef-MIT-open-group" ]
  }, {
    "SPDXID" : "SPDXRef-item13244403",
    "checksums" : [ {
      "algorithm" : "SHA256",
      "checksumValue" : "f8c920805580e24c077a42fe4c2ab283e74bf38468f62a04f606272efae92184"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "d3c1c34621f2d2770a9106f57916539e"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "1c54405c6b3f78e65b9a214d88231b32f6b85f99"
    } ],
    "copyrightText" : "NOASSERTION",
    "fileName" : "libxinerama-libXinerama-1.1.5.tar.gz/libxinerama-libXinerama-1.1.5.tar/libxinerama-libXinerama-1.1.5/.gitlab-ci.yml",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "NOASSERTION" ]
  }, {
    "SPDXID" : "SPDXRef-item13244407",
    "checksums" : [ {
      "algorithm" : "SHA256",
      "checksumValue" : "a62b48456595215605286015d5f8a847049ed13e9a9f0363fd1a1894fdd7914e"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "553b79325a1dcc6880ea6b68c8a553fe"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "52bf01d951516ffee6717f839542e66491a738e0"
    } ],
    "copyrightText" : "NOASSERTION",
    "fileName" : "libxinerama-libXinerama-1.1.5.tar.gz/libxinerama-libXinerama-1.1.5.tar/libxinerama-libXinerama-1.1.5/autogen.sh",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "NOASSERTION" ]
  }, {
    "SPDXID" : "SPDXRef-item13244425",
    "checksums" : [ {
      "algorithm" : "MD5",
      "checksumValue" : "a2b4c4cde2c256557066f398a57ecc90"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "5759dbd5b711877100c8b858a024fd86e7c8039b"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "3666cffabbb259c2feae57086d4e0128413e95a99cd9774f22203a718e09da4c"
    } ],
    "copyrightText" : "Copyright 2005 Red Hat, Inc.",
    "fileName" : "libxinerama-libXinerama-1.1.5.tar.gz/libxinerama-libXinerama-1.1.5.tar/libxinerama-libXinerama-1.1.5/Makefile.am",
    "licenseConcluded" : "LicenseRef-HPND-sell-variant-0b820e94cfa6f74c097d614b45c47f24",
    "licenseInfoInFiles" : [ "LicenseRef-HPND-sell-variant" ]
  }, {
    "SPDXID" : "SPDXRef-item13244422",
    "checksums" : [ {
      "algorithm" : "MD5",
      "checksumValue" : "ac9d191041e80bc508a969803a112291"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "7481560c86af886a6442e7e38eb8ed61d80c4149dced03e68a3d8a5fdbbb9775"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "d0b7011846e44b7630002c80e943ec79021a81aa"
    } ],
    "copyrightText" : "Copyright (c) 1991, 1997 Digital Equipment Corporation, Maynard, Massachusetts.",
    "fileName" : "libxinerama-libXinerama-1.1.5.tar.gz/libxinerama-libXinerama-1.1.5.tar/libxinerama-libXinerama-1.1.5/src/Xinerama.c",
    "licenseConcluded" : "LicenseRef-X11-distribute-modifications-variant-4e8b4715072fedb621c8eb5016321e1c",
    "licenseInfoInFiles" : [ "LicenseRef-X11", "LicenseRef-MIT", "LicenseRef-X11-distribute-modifications-variant" ]
  }, {
    "SPDXID" : "SPDXRef-item13244404",
    "checksums" : [ {
      "algorithm" : "SHA256",
      "checksumValue" : "8d854a9af4091c8d47e080c80ae93ec2791262c8ea575a1ff87f3e1edbd86ab1"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "eb9a840b4a79c5bba8276d1eb21f9fdd"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "79063943386cfa2a4321804e99c2b233325caa60"
    } ],
    "copyrightText" : "NOASSERTION",
    "fileName" : "libxinerama-libXinerama-1.1.5.tar.gz/libxinerama-libXinerama-1.1.5.tar/libxinerama-libXinerama-1.1.5/README.md",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "NOASSERTION" ]
  }, {
    "SPDXID" : "SPDXRef-item13244419",
    "checksums" : [ {
      "algorithm" : "SHA1",
      "checksumValue" : "742f6a1d1a24b20ba86ae2169c89ed210a8ca90e"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "032bb287cc846f2d47ae3fbf2dfba634e1b814897f64a0dd40275114fcbf7ed1"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "9daa4b713151e979f65cbc889c64b150"
    } ],
    "copyrightText" : "Copyright (c) 2007, Oracle and/or its affiliates. All rights reserved.",
    "fileName" : "libxinerama-libXinerama-1.1.5.tar.gz/libxinerama-libXinerama-1.1.5.tar/libxinerama-libXinerama-1.1.5/man/Xinerama.man",
    "licenseConcluded" : "LicenseRef-MIT-99db7cd1d38ca65ee94c318d11ba74fb",
    "licenseInfoInFiles" : [ "LicenseRef-MIT" ]
  }, {
    "SPDXID" : "SPDXRef-item13244408",
    "checksums" : [ {
      "algorithm" : "MD5",
      "checksumValue" : "6f4f634d1643a2e638bba3fcd19c2536"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "be90ae29e7e0977910b397571efe56601c123793"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "f661fd883b6e980b3b118e0fbe230fbf10eef8d4d4a35931355f29ed647ddbe3"
    } ],
    "copyrightText" : "Copyright (c) 2007, Oracle and/or its affiliates. All rights reserved.\nCopyright 2003 The Open Group\nCopyright (c) 1991, 1997 Digital Equipment Corporation, Maynard, Massachusetts.",
    "fileName" : "libxinerama-libXinerama-1.1.5.tar.gz/libxinerama-libXinerama-1.1.5.tar/libxinerama-libXinerama-1.1.5/COPYING",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "LicenseRef-MIT", "LicenseRef-X11", "LicenseRef-MIT-open-group", "LicenseRef-X11-distribute-modifications-variant" ]
  }, {
    "SPDXID" : "SPDXRef-item13244420",
    "checksums" : [ {
      "algorithm" : "SHA1",
      "checksumValue" : "b1d381953599ed9d937bc03a77699598d1279931"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "fe407e6c371f483724b7b4e040cfac3a64343c3fc43a07dabb5822aae426f5e1"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "f7c098cc91f44f6a2ec9f82fc4f7df04"
    } ],
    "copyrightText" : "Copyright (c) 2007, Oracle and/or its affiliates. All rights reserved.",
    "fileName" : "libxinerama-libXinerama-1.1.5.tar.gz/libxinerama-libXinerama-1.1.5.tar/libxinerama-libXinerama-1.1.5/man/Makefile.am",
    "licenseConcluded" : "LicenseRef-MIT-99db7cd1d38ca65ee94c318d11ba74fb",
    "licenseInfoInFiles" : [ "LicenseRef-MIT" ]
  }, {
    "SPDXID" : "SPDXRef-item13244415",
    "checksums" : [ {
      "algorithm" : "MD5",
      "checksumValue" : "9970c0afe3f6178a2071329320f0a587"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "7b22692a18031aef837a25c5d9454d18e0d37002"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "064bf85c255a6705b5446c190f55a266b071144bf0c9b55d21c4d03d2e234c7a"
    } ],
    "copyrightText" : "NOASSERTION",
    "fileName" : "libxinerama-libXinerama-1.1.5.tar.gz/libxinerama-libXinerama-1.1.5.tar/libxinerama-libXinerama-1.1.5/man/XineramaQueryScreens.man",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "NOASSERTION" ]
  }, {
    "SPDXID" : "SPDXRef-item13244424",
    "checksums" : [ {
      "algorithm" : "SHA1",
      "checksumValue" : "9528cc457db4cbb7912ec4a2a59dc65f7f8da993"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "9f55fda6c371caeefb6e83bf5ad7defb9a7c8450a2fba20776353d615a5903e4"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "517fbfcb3a0ef3e34e48c0886ead1e30"
    } ],
    "copyrightText" : "NOASSERTION",
    "fileName" : "libxinerama-libXinerama-1.1.5.tar.gz/libxinerama-libXinerama-1.1.5.tar/libxinerama-libXinerama-1.1.5/.gitignore",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "NOASSERTION" ]
  }, {
    "SPDXID" : "SPDXRef-item13244406",
    "checksums" : [ {
      "algorithm" : "MD5",
      "checksumValue" : "db1dde16de0b6029c694df4d56aa25e7"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "d78993763a06d92eb4d567a654353bdb19789f35"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "9c2c5eee53ec0e8bb8994de5007166e1f56c439be93921cf2960995a9db072df"
    } ],
    "copyrightText" : "NOASSERTION",
    "fileName" : "libxinerama-libXinerama-1.1.5.tar.gz/libxinerama-libXinerama-1.1.5.tar/libxinerama-libXinerama-1.1.5/xinerama.pc.in",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "NOASSERTION" ]
  }, {
    "SPDXID" : "SPDXRef-item13244413",
    "checksums" : [ {
      "algorithm" : "SHA256",
      "checksumValue" : "6067417fadee5a070126970e81fb0703441c0e721acf08883e6e1d52d9268c5f"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "28d70f6509bc592a2a92f9e4df5ec2b3"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "f4acfee288002b22bb666504af07a3dafa8610ac"
    } ],
    "copyrightText" : "Copyright (c) 1991, 1997 Digital Equipment Corporation, Maynard, Massachusetts.",
    "fileName" : "libxinerama-libXinerama-1.1.5.tar.gz/libxinerama-libXinerama-1.1.5.tar/libxinerama-libXinerama-1.1.5/include/X11/extensions/panoramiXext.h",
    "licenseConcluded" : "LicenseRef-X11-distribute-modifications-variant-4e8b4715072fedb621c8eb5016321e1c",
    "licenseInfoInFiles" : [ "LicenseRef-X11", "LicenseRef-MIT", "LicenseRef-X11-distribute-modifications-variant" ]
  }, {
    "SPDXID" : "SPDXRef-item13244418",
    "checksums" : [ {
      "algorithm" : "MD5",
      "checksumValue" : "9970c0afe3f6178a2071329320f0a587"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "7b22692a18031aef837a25c5d9454d18e0d37002"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "064bf85c255a6705b5446c190f55a266b071144bf0c9b55d21c4d03d2e234c7a"
    } ],
    "copyrightText" : "NOASSERTION",
    "fileName" : "libxinerama-libXinerama-1.1.5.tar.gz/libxinerama-libXinerama-1.1.5.tar/libxinerama-libXinerama-1.1.5/man/XineramaIsActive.man",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "NOASSERTION" ]
  }, {
    "SPDXID" : "SPDXRef-item13244416",
    "checksums" : [ {
      "algorithm" : "MD5",
      "checksumValue" : "9970c0afe3f6178a2071329320f0a587"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "064bf85c255a6705b5446c190f55a266b071144bf0c9b55d21c4d03d2e234c7a"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "7b22692a18031aef837a25c5d9454d18e0d37002"
    } ],
    "copyrightText" : "NOASSERTION",
    "fileName" : "libxinerama-libXinerama-1.1.5.tar.gz/libxinerama-libXinerama-1.1.5.tar/libxinerama-libXinerama-1.1.5/man/XineramaQueryExtension.man",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "NOASSERTION" ]
  }, {
    "SPDXID" : "SPDXRef-item13244405",
    "checksums" : [ {
      "algorithm" : "SHA256",
      "checksumValue" : "7b5644bebc9112d78fb1c19d03f38515fa2fd0161b48b8f49738ff9318fd0e9e"
    }, {
      "algorithm" : "MD5",
      "checksumValue" : "b9acef86998de87c25637f926f5424cf"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "ff298c58f2fbf56d33d6b10132def1994119d166"
    } ],
    "copyrightText" : "Copyright 2005 Red Hat, Inc.",
    "fileName" : "libxinerama-libXinerama-1.1.5.tar.gz/libxinerama-libXinerama-1.1.5.tar/libxinerama-libXinerama-1.1.5/configure.ac",
    "licenseConcluded" : "LicenseRef-HPND-sell-variant-0b820e94cfa6f74c097d614b45c47f24",
    "licenseInfoInFiles" : [ "LicenseRef-HPND-sell-variant" ]
  }, {
    "SPDXID" : "SPDXRef-item13244417",
    "checksums" : [ {
      "algorithm" : "MD5",
      "checksumValue" : "9970c0afe3f6178a2071329320f0a587"
    }, {
      "algorithm" : "SHA1",
      "checksumValue" : "7b22692a18031aef837a25c5d9454d18e0d37002"
    }, {
      "algorithm" : "SHA256",
      "checksumValue" : "064bf85c255a6705b5446c190f55a266b071144bf0c9b55d21c4d03d2e234c7a"
    } ],
    "copyrightText" : "NOASSERTION",
    "fileName" : "libxinerama-libXinerama-1.1.5.tar.gz/libxinerama-libXinerama-1.1.5.tar/libxinerama-libXinerama-1.1.5/man/XineramaQueryVersion.man",
    "licenseConcluded" : "NOASSERTION",
    "licenseInfoInFiles" : [ "NOASSERTION" ]
  } ],
  "relationships" : [ {
    "spdxElementId" : "SPDXRef-DOCUMENT",
    "relationshipType" : "DESCRIBES",
    "relatedSpdxElement" : "SPDXRef-upload2845"
  }, {
    "spdxElementId" : "SPDXRef-upload2845",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item13244408"
  }, {
    "spdxElementId" : "SPDXRef-upload2845",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item13244422"
  }, {
    "spdxElementId" : "SPDXRef-upload2845",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item13244407"
  }, {
    "spdxElementId" : "SPDXRef-upload2845",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item13244419"
  }, {
    "spdxElementId" : "SPDXRef-upload2845",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item13244425"
  }, {
    "spdxElementId" : "SPDXRef-upload2845",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item13244416"
  }, {
    "spdxElementId" : "SPDXRef-upload2845",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item13244403"
  }, {
    "spdxElementId" : "SPDXRef-upload2845",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item13244413"
  }, {
    "spdxElementId" : "SPDXRef-upload2845",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item13244415"
  }, {
    "spdxElementId" : "SPDXRef-upload2845",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item13244423"
  }, {
    "spdxElementId" : "SPDXRef-upload2845",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item13244404"
  }, {
    "spdxElementId" : "SPDXRef-upload2845",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item13244417"
  }, {
    "spdxElementId" : "SPDXRef-upload2845",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item13244418"
  }, {
    "spdxElementId" : "SPDXRef-upload2845",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item13244412"
  }, {
    "spdxElementId" : "SPDXRef-upload2845",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item13244406"
  }, {
    "spdxElementId" : "SPDXRef-upload2845",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item13244420"
  }, {
    "spdxElementId" : "SPDXRef-upload2845",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item13244405"
  }, {
    "spdxElementId" : "SPDXRef-upload2845",
    "relationshipType" : "CONTAINS",
    "relatedSpdxElement" : "SPDXRef-item13244424"
  } ]
}